[
  {
    "id": "1",
    "name": "A' Bhuidheanach Bheag",
    "extra": "",
    "area": "Cairngorms",
    "meters": 936,
    "section": "05B",
    "region": "05B: Loch Ericht to Glen Tromie & Glen Garry",
    "feet": 3071,
    "summited": false,
    "lat": 56.870342,
    "lng": -4.199001,
    "link": "https://www.walkhighlands.co.uk/munros/a-bhuidheanach-bheag",
    "description": "A' Bhuidheanach Bheag features a wide, rounded summit situated on the expansive plateau to the east of the Drumochter Pass. While the plateau itself is characterized by its lack of prominent landforms, it exudes a sense of wildness and desolation that appeals to those seeking solitude in nature. The vast, open landscape offers a unique experience, with sweeping views that stretch across the rugged terrain, making it a memorable destination for munro baggers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/a-bhuidheanach-bheag2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/56.90890,-4.23660/"
  },
  {
    "id": "2",
    "name": "A' Chailleach",
    "extra": "",
    "area": "Cairngorms",
    "meters": 929,
    "section": "09B",
    "region": "09B: Glen Albyn and the Monadh Liath",
    "feet": 3049,
    "summited": false,
    "lat": 57.109564,
    "lng": -4.179285,
    "link": "https://www.walkhighlands.co.uk/munros/a-chailleach-monadhliath",
    "description": "A' Chailleach stands as a well-known landmark visible from the vicinity of Newtonmore. Crowned with a substantial cairn, it is not only the most frequently climbed peak in the Monadhliath range but also arguably the most impressive. Its prominence and accessibility make it a favorite among hikers and outdoor enthusiasts, offering stunning views and a rewarding ascent.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/a-chailleach-monadhliath2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/57.07050,-4.15760/"
  },
  {
    "id": "3",
    "name": "A' Chailleach",
    "extra": "",
    "area": "Ullapool",
    "meters": 999,
    "section": "14B",
    "region": "14B: The Fannaichs",
    "feet": 3276,
    "summited": false,
    "lat": 57.693773,
    "lng": -5.128713,
    "link": "https://www.walkhighlands.co.uk/munros/a-chailleach",
    "description": "A' Chailleach stands as the western sentinel of the Fannich range, offering breathtaking vistas that stretch across the rugged expanse of the Fisherfield Forest and extend towards the majestic An Teallach. This munro provides a rewarding experience for hikers, with its panoramic views and the sense of isolation that comes from being in such a remote and wild part of Scotland. The journey to its summit is not just a climb but an immersion into the natural beauty and tranquility of the Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/a-chailleach2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/57.73740,-5.09000/"
  },
  {
    "id": "4",
    "name": "A' Chralaig",
    "extra": "",
    "area": "Kintail",
    "meters": 1120,
    "section": "11B",
    "region": "11B: Glen Affric to Glen Moriston",
    "feet": 3675,
    "summited": false,
    "lat": 57.184186,
    "lng": -5.154837,
    "link": "https://www.walkhighlands.co.uk/munros/a-chralaig",
    "description": "A' Chralaig stands as a formidable mountain, often overshadowed by its more famous neighbors, yet it proudly holds the title of the highest peak in Kintail. The climb begins at the Cluanie Inn and is a relentless uphill journey, demanding both stamina and determination. However, the effort is richly rewarded as the ascent culminates in a magnificent ridge, offering breathtaking panoramic views that make the strenuous trek worthwhile.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/a-chralaig2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/57.15960,-5.16470/"
  },
  {
    "id": "5",
    "name": "A' Ghlas-bheinn",
    "extra": "",
    "area": "Kintail",
    "meters": 918,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3012,
    "summited": false,
    "lat": 57.255081,
    "lng": -5.303686,
    "link": "https://www.walkhighlands.co.uk/munros/a-ghlas-bheinn",
    "description": "A' Ghlas-bheinn is a rugged and craggy peak that stands prominently near Morvich in the picturesque region of Kintail. This mountain, though modest in stature, offers a rewarding climb with its challenging terrain and stunning vistas. For those looking to extend their adventure, the ascent of A' Ghlas-bheinn can be seamlessly paired with a trip to the renowned Falls of Glomach, one of Scotland's highest waterfalls. This combination provides a perfect blend of mountain trekking and natural beauty, making it a memorable experience for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/a-ghlas-bheinn2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/57.23480,-5.38090/"
  },
  {
    "id": "6",
    "name": "A' Mhaighdean",
    "extra": "",
    "area": "Ullapool",
    "meters": 967,
    "section": "14A",
    "region": "14A: Loch Maree to Loch Broom",
    "feet": 3173,
    "summited": false,
    "lat": 57.719653,
    "lng": -5.346721,
    "link": "https://www.walkhighlands.co.uk/munros/a-mhaighdean",
    "description": "A' Mhaighdean is frequently considered the most remote of all the Munros, nestled deep within the vast expanse of the Fisherfield Forest. This majestic mountain, with its striking castellated ridges and dramatic cliffs, stands as a testament to nature's grandeur. Renowned for offering one of the most breathtaking viewpoints in Britain, A' Mhaighdean rewards those who venture into its secluded wilderness with unparalleled panoramic vistas.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/a-mhaighdean2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/57.77680,-5.25450/"
  },
  {
    "id": "7",
    "name": "A' Mharconaich",
    "extra": "",
    "area": "Cairngorms",
    "meters": 973,
    "section": "05A",
    "region": "05A: Loch Ericht to Glen Tromie & Glen Garry",
    "feet": 3193,
    "summited": false,
    "lat": 56.857002,
    "lng": -4.290668,
    "link": "https://www.walkhighlands.co.uk/munros/a-mharconaich",
    "description": "A' Mharconaich stands out prominently among the peaks towering over the Drumochter Pass, presenting a strikingly steep and rugged nose to the northeast. This mountain's unique profile makes it easily recognizable and a favorite among hikers and climbers exploring the region. Its dramatic slopes and commanding presence offer both a visual treat and a rewarding challenge for those who venture to its summit.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/a-mharconaich2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/56.88350,-4.25360/"
  },
  {
    "id": "8",
    "name": "Am Basteir",
    "extra": "",
    "area": "Islands",
    "meters": 934,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3064,
    "summited": false,
    "lat": 57.24794,
    "lng": -6.202966,
    "link": "https://www.walkhighlands.co.uk/munros/am-basteir",
    "description": "Am Basteir stands as a striking, vertically-sided blade of rock, presenting a thrilling challenge for avid scramblers who approach from Bealach a Basteir. This rugged ascent rewards climbers with breathtaking views and a sense of accomplishment. Nestled just below the summit lies the extraordinary Basteir Tooth, a formidable and imposing fang of rock. This remarkable feature is accessible solely to skilled rock-climbers, adding an extra layer of adventure for those seeking to conquer its heights. The dramatic landscape and unique geological formations make Am Basteir a must-visit for any dedicated munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/am-basteir2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/57.28910,-6.17690/"
  },
  {
    "id": "9",
    "name": "Am Bodach",
    "extra": "",
    "area": "Fort William",
    "meters": 1032,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3385,
    "summited": false,
    "lat": 56.74173,
    "lng": -4.98337,
    "link": "https://www.walkhighlands.co.uk/munros/am-bodach",
    "description": "Am Bodach is a striking and rugged peak situated along the main ridge of the Mamores, nestled between the scenic locales of Kinlochleven and Fort William. This mountain is known for its steep, stony slopes that challenge and reward climbers with breathtaking views and a sense of accomplishment. Its prominent position in the Mamores range makes it a must-visit for any dedicated munro bagger exploring the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/am-bodach2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/56.77770,-5.00034/"
  },
  {
    "id": "10",
    "name": "Am Faochagach",
    "extra": "",
    "area": "Ullapool",
    "meters": 953,
    "section": "15A",
    "region": "15A: Loch Broom to Strath Oykel",
    "feet": 3127,
    "summited": false,
    "lat": 57.771801,
    "lng": -4.853882,
    "link": "https://www.walkhighlands.co.uk/munros/am-faochagach",
    "description": "Am Faochagach is a gently contoured Munro situated to the north of the Dirrie Mòr road, near Ullapool. The initial approach presents the primary challenge, as it involves traversing a flat expanse of moorland that is often boggy and includes a river crossing that can be tricky, especially after heavy rain. Once past this initial section, the climb to the summit is relatively uncomplicated, offering a more straightforward ascent. The peak rewards hikers with expansive views and a sense of accomplishment after navigating the initial hurdles.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/am-faochagach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.72480,-4.89430/"
  },
  {
    "id": "11",
    "name": "An Caisteal",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 996,
    "section": "01C",
    "region": "01C: Loch Lomond to Strathyre",
    "feet": 3267,
    "summited": false,
    "lat": 56.338618,
    "lng": -4.62437,
    "link": "https://www.walkhighlands.co.uk/munros/an-caisteal",
    "description": "An Caisteal presents itself as an elongated, ridged mountain situated to the south of Crianlarich. The journey across its terrain is highly enjoyable, offering a variety of intriguing features along the way. Hikers are rewarded with expansive and breathtaking views of the surrounding landscape, making it a memorable experience for all who venture its paths.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/an-caisteal-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.37900,-4.64300/"
  },
  {
    "id": "12",
    "name": "An Coileachan",
    "extra": "",
    "area": "Ullapool",
    "meters": 924,
    "section": "14B",
    "region": "14B: The Fannaichs",
    "feet": 3031,
    "summited": false,
    "lat": 57.667625,
    "lng": -4.949498,
    "link": "https://www.walkhighlands.co.uk/munros/an-coileachan",
    "description": "An Coileachan stands as the eastern sentinel of the Fannich range, characterized by its steep, domed slopes that ascend gracefully to the south of Loch Gorm. Although it appears relatively close to the track leading to Loch Fannich, the typical route from the northern side involves a lengthy and challenging trek across expansive boggy terrain. This journey, though arduous, rewards hikers with the serene beauty and rugged charm that define the Fannichs.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/an-coileachan-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.72480,-4.89430/"
  },
  {
    "id": "13",
    "name": "An Gearanach",
    "extra": "",
    "area": "Fort William",
    "meters": 982,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3220,
    "summited": false,
    "lat": 56.759172,
    "lng": -4.96623,
    "link": "https://www.walkhighlands.co.uk/munros/an-gearanach",
    "description": "An Gearanach is a stunning ridge that stretches northward from the central backbone of the Mamores range. The peak and the connecting ridge form a slender arete, evoking the dramatic ridge that links Càrn Mòr Dearg to Ben Nevis. This narrow pathway offers breathtaking views and a thrilling experience for those who traverse its length, making it a memorable highlight for any munro bagger. The rugged terrain and the sense of exposure add to the adventure, ensuring that An Gearanach remains a favorite among hikers seeking both challenge and beauty in the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/an-gearanach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.77770,-5.00034/"
  },
  {
    "id": "14",
    "name": "An Riabhachan",
    "extra": "",
    "area": "Loch Ness",
    "meters": 1129,
    "section": "12B",
    "region": "12B: Killilan to Inverness",
    "feet": 3704,
    "summited": false,
    "lat": 57.362429,
    "lng": -5.104728,
    "link": "https://www.walkhighlands.co.uk/munros/an-riabhachan",
    "description": "An Riabhachan is an imposing, ridge-lined mountain situated to the north of Loch Mullardoch. This majestic peak offers an exhilarating challenge and can be paired with nearby summits for an unforgettable adventure. Whether you choose to approach it from the scenic shores of Loch Mullardoch or the remote upper reaches of Glen Strathfarrar to the north, An Riabhachan promises a day of epic proportions. The varied routes and stunning vistas make it a must-visit for any dedicated munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/an-riabhachan-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.33990,-4.96150/"
  },
  {
    "id": "15",
    "name": "An Sgarsoch",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1007,
    "section": "06A",
    "region": "06A: Glen Tromie to Glen Tilt",
    "feet": 3302,
    "summited": false,
    "lat": 56.932109,
    "lng": -3.754294,
    "link": "https://www.walkhighlands.co.uk/munros/an-sgarsoch",
    "description": "An Sgarsoch, while not particularly striking in its rounded appearance, holds the distinction of being one of the most remote Munros in Scotland. Nestled in the desolate expanse that bridges the Mounth and the Cairngorms, this mountain offers a true sense of isolation. Reaching its summit demands a lengthy and challenging journey, no matter which direction you choose to approach from. The solitude and effort required to conquer An Sgarsoch make it a unique and rewarding experience for dedicated munro baggers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/an-sgarsoch-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.98940,-3.54350/"
  },
  {
    "id": "16",
    "name": "An Socach",
    "extra": "Braemar",
    "area": "Cairngorms",
    "meters": 944,
    "section": "06B",
    "region": "06B: Pitlochry to Braemar & Blairgowrie",
    "feet": 3097,
    "summited": false,
    "lat": 56.902286,
    "lng": -3.513164,
    "link": "https://www.walkhighlands.co.uk/munros/an-socach-braemar",
    "description": "An Socach is a modestly prominent, wedge-shaped peak that offers a relatively swift ascent from Baddoch in Glen Clunie. One of its appealing features is that it provides a serene escape from the bustling ski developments located at the upper end of the glen. The climb, though not particularly challenging, rewards hikers with a sense of tranquility and a break from the more commercialized areas nearby.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/an-socach-braemar-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.93130,-3.41700/"
  },
  {
    "id": "17",
    "name": "An Socach",
    "extra": "Affric",
    "area": "Loch Ness",
    "meters": 920,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3017,
    "summited": false,
    "lat": 57.25755,
    "lng": -5.171311,
    "link": "https://www.walkhighlands.co.uk/munros/an-socach-affric",
    "description": "An Socach stands as a remarkably secluded Munro, nestled at the far reaches of Glen Affric. Essentially, it marks the eastern end of the east ridge of Sgùrr nan Ceathreamhnan. While many adventurers choose to pair its ascent with that of Sgùrr nan Ceathreamhnan, An Socach can also be tackled as a standalone challenge. For those opting to climb it solo, be prepared for a lengthy and rewarding journey starting from the road's end in Glen Affric. The trek offers a true sense of isolation and the opportunity to immerse oneself in the rugged beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/an-socach-affric-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.23220,-5.18340/"
  },
  {
    "id": "18",
    "name": "An Socach",
    "extra": "Mullardoch",
    "area": "Loch Ness",
    "meters": 1069,
    "section": "12B",
    "region": "12B: Killilan to Inverness",
    "feet": 3507,
    "summited": false,
    "lat": 57.350229,
    "lng": -5.158603,
    "link": "https://www.walkhighlands.co.uk/munros/an-socach-mullardoch",
    "description": "An Socach is one of three Munros sharing this name, and it is nestled in the remote and rugged terrain above the upper reaches of Loch Mullardoch. This particular Munro is known for its seclusion and the challenging nature of its approach. To reach An Socach, one must navigate a very rough path that runs along the loch. There are a couple of routes to consider: you can approach from the north via Glen Strathfarrar, which offers a scenic yet demanding journey, or you can embark on a lengthy trek from Killilan in Kintail. Both routes promise an adventurous experience through some of Scotland's wildest landscapes.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/an-socach-mullardoch-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.33990,-4.96150/"
  },
  {
    "id": "19",
    "name": "An Stuc",
    "extra": "",
    "area": "Perthshire",
    "meters": 1117,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3665,
    "summited": false,
    "lat": 56.560084,
    "lng": -4.216248,
    "link": "https://www.walkhighlands.co.uk/munros/an-stuc",
    "description": "An Stùc, which gained Munro status in 1997, stands out as the most precipitous and jagged peak within the Ben Lawers range. This formidable mountain presents a particularly challenging climb, especially when approached from Meall Garbh. The ascent is characterized by its extreme steepness, exposure, and loose terrain, demanding both caution and determination from those who dare to tackle it. The rugged path and dramatic inclines make An Stùc a memorable and exhilarating experience for seasoned hikers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/an-stuc-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.52950,-4.15186/"
  },
  {
    "id": "20",
    "name": "Bidein a' Ghlas Thuill",
    "extra": "An Teallach",
    "area": "Ullapool",
    "meters": 1063,
    "section": "14A",
    "region": "14A: Loch Maree to Loch Broom",
    "feet": 3486,
    "summited": false,
    "lat": 57.807098,
    "lng": -5.251767,
    "link": "https://www.walkhighlands.co.uk/munros/bidein-a-ghlas-thuill-an-teallach",
    "description": "Bidein a' Ghlas Thuill stands as the loftiest peak of the awe-inspiring An Teallach range. While it may not possess the striking features of its nearby counterpart, Sgùrr Fiona, it offers unparalleled panoramic views that are among the most breathtaking in all of Britain. This summit is often approached as a segment of a full ridge traverse, but it is equally rewarding when ascended as a standalone adventure. The journey to its peak promises a memorable experience, showcasing the rugged beauty and dramatic landscapes that define this iconic mountain.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/bidein-a-ghlas-thuill-an-teallach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.84000,-5.21500/"
  },
  {
    "id": "21",
    "name": "Sgurr Fiona",
    "extra": "An Teallach",
    "area": "Ullapool",
    "meters": 1059,
    "section": "14A",
    "region": "14A: Loch Maree to Loch Broom",
    "feet": 3473,
    "summited": false,
    "lat": 57.800726,
    "lng": -5.259443,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-fiona-an-teallach",
    "description": "Sgùrr Fiona stands as the more distinguished of the two Munro peaks gracing the awe-inspiring ridge of An Teallach. This striking, pyramid-shaped summit is a marvel of rugged rock formations, marking the onset of the most challenging section of the traverse. Its commanding presence not only offers breathtaking views but also serves as a sentinel for adventurers embarking on this demanding yet rewarding journey.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-fiona-an-teallach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.84000,-5.21500/"
  },
  {
    "id": "22",
    "name": "Aonach air Chrith",
    "extra": "",
    "area": "Kintail",
    "meters": 1020,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3345,
    "summited": false,
    "lat": 57.12464,
    "lng": -5.221291,
    "link": "https://www.walkhighlands.co.uk/munros/aonach-air-chrith",
    "description": "Aonach Air Chrith stands as the tallest of the seven Munros gracing the southern ridge of Glen Shiel. This majestic peak features a particularly narrow segment along its western ridge, adding a touch of thrill to the ascent. Additionally, adventurers will find a striking spur extending to the north, offering even more breathtaking views and challenging terrain.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/aonach-air-chrith-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.15600,-5.17815/"
  },
  {
    "id": "23",
    "name": "Aonach Beag",
    "extra": "Nevis Range",
    "area": "Fort William",
    "meters": 1234,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 4049,
    "summited": false,
    "lat": 56.799998,
    "lng": -4.954138,
    "link": "https://www.walkhighlands.co.uk/munros/aonach-beag-nevis-range",
    "description": "Aonach Beag stands as the second tallest peak within the Nevis Range, yet it often remains concealed from view by its slightly shorter but more imposing neighbor, Aonach Mòr. The mountain's rounded summit emerges above a landscape characterized by sprawling, rugged crags and deep corries, offering a sense of hidden grandeur to those who venture to its heights.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/aonach-beag-nevis-range-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.77770,-5.00031/"
  },
  {
    "id": "24",
    "name": "Aonach Beag",
    "extra": "Alder",
    "area": "Cairngorms",
    "meters": 1116,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3661,
    "summited": false,
    "lat": 56.833498,
    "lng": -4.529175,
    "link": "https://www.walkhighlands.co.uk/munros/aonach-beag-alder",
    "description": "Aonach Beag is a prominent peak nestled within the high mountain ridge that lies just north of the majestic Ben Alder. This mountain boasts a distinctive dome-shaped summit, complemented by three extending ridges that radiate outward. Its steep, dramatic flanks contribute to the grandeur of the ridge walk, offering an exhilarating experience for those who venture along its paths. The panoramic views and rugged terrain make Aonach Beag a memorable highlight for any munro bagger exploring this stunning region.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/aonach-beag-alder-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.85350,-4.42380/"
  },
  {
    "id": "25",
    "name": "Meall Dearg",
    "extra": "Aonach Eagach",
    "area": "Fort William",
    "meters": 952,
    "section": "03A",
    "region": "03A: Loch Leven to Rannoch Station",
    "feet": 3124,
    "summited": false,
    "lat": 56.68074,
    "lng": -5.003235,
    "link": "https://www.walkhighlands.co.uk/munros/meall-dearg-aonach-eagach",
    "description": "Meall Dearg stands as the central peak on the renowned Aonach Eagach ridge, a highlight for many hillwalkers in Scotland. Typically, it is conquered as part of the challenging scramble along the ridge, which eventually leads to Sgòrr nam Fiannaidh. However, for those who are wary of heights or prefer a less daunting route, Meall Dearg can also be ascended independently by taking a northern approach. This alternative path offers a more accessible way to experience the majesty of this summit without the need to traverse the entire ridge.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-dearg-aonach-eagach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.66660,-4.98240/"
  },
  {
    "id": "26",
    "name": "Sgorr nam Fiannaidh",
    "extra": "Aonach Eagach",
    "area": "Fort William",
    "meters": 968,
    "section": "03A",
    "region": "03A: Loch Leven to Rannoch Station",
    "feet": 3175,
    "summited": false,
    "lat": 56.679387,
    "lng": -5.037143,
    "link": "https://www.walkhighlands.co.uk/munros/sgorr-nam-fiannaidh-aonach-eagach",
    "description": "Sgòrr nam Fiannaidh stands as the western pinnacle of the renowned Aonach Eagach ridge. Typically, this summit is conquered as part of the iconic and challenging scramble that traverses the entire ridge, including the ascent of Meall Dearg. However, for those who prefer to avoid the more technical scrambling sections, there is an alternative route. This path leads to the bealach, or mountain pass, near the Pap of Glencoe, offering a less daunting yet equally rewarding climb to the summit. The journey provides breathtaking views and a sense of accomplishment, whether you choose the adventurous ridge scramble or the more accessible path.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgorr-nam-fiannaidh-aonach-eagach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.66660,-4.98240/"
  },
  {
    "id": "27",
    "name": "Aonach Meadhoin",
    "extra": "",
    "area": "Kintail",
    "meters": 1001,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3284,
    "summited": false,
    "lat": 57.173026,
    "lng": -5.229166,
    "link": "https://www.walkhighlands.co.uk/munros/aonach-meadhoin",
    "description": "Aonach Meadhoin is a notable Munro located along the Brothers Ridge, which graces the northern side of Glen Shiel. This mountain is nestled between the impressive Sgùrr a' Bhealaich Dheirg and the striking peak of Sgùrr an Fhuaraill. The ridge offers a captivating blend of rugged terrain and sweeping vistas, making it a rewarding climb for avid munro baggers. The surrounding landscape is rich with natural beauty, providing a serene yet challenging experience for those who venture to its heights.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/aonach-meadhoin-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.16960,-5.29450/"
  },
  {
    "id": "28",
    "name": "Aonach Mor",
    "extra": "",
    "area": "Fort William",
    "meters": 1220,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 4004,
    "summited": false,
    "lat": 56.812941,
    "lng": -4.961712,
    "link": "https://www.walkhighlands.co.uk/munros/aonach-mor",
    "description": "Despite being shorter than its nearby counterpart Aonach Beag, Aonach Mòr earns the 'Mòr' designation due to its more substantial mass, which conceals its taller neighbor. This mountain is prominently visible from the Commando Memorial, offering a striking view. However, it's worth noting that the landscape on this side of Aonach Mòr is marred by various ski developments, which detract somewhat from its natural beauty.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/aonach-mor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.77770,-5.00031/"
  },
  {
    "id": "29",
    "name": "Sgorr Dhearg",
    "extra": "Beinn a’Bheithir",
    "area": "Fort William",
    "meters": 1024,
    "section": "03B",
    "region": "03B: Loch Linnhe to Loch Etive",
    "feet": 3360,
    "summited": false,
    "lat": 56.65393,
    "lng": -5.171511,
    "link": "https://www.walkhighlands.co.uk/munros/sgorr-dhearg-beinn-a-bheithir",
    "description": "Sgòrr Dhearg stands as the loftiest of the two Munros gracing Beinn a'Bheithir, marking the end of an elegantly curved ridge that extends from the summit of Sgòrr Bhan. This magnificent mountain presents a striking silhouette, especially when viewed from the northern shores of Loch Leven. Its impressive stature and graceful contours make it a notable feature in the landscape, drawing the admiration of all who behold it.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgorr-dhearg-beinn-a-bheithir-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.67830,-5.12981/"
  },
  {
    "id": "30",
    "name": "Sgorr Dhonuill",
    "extra": "Beinn a’Bheithir",
    "area": "Fort William",
    "meters": 1002,
    "section": "03B",
    "region": "03B: Loch Linnhe to Loch Etive",
    "feet": 3288,
    "summited": false,
    "lat": 56.650531,
    "lng": -5.19789,
    "link": "https://www.walkhighlands.co.uk/munros/sgorr-dhonuill-beinn-a-bheithir",
    "description": "Sgòrr Dhònuill stands as the western Munro of the Beinn a'Bheithir range, offering a truly majestic peak that serves as an exceptional vantage point. From its summit, one can enjoy breathtaking views that encompass striking mountain ranges, expansive lochs stretching into the distance, and the shimmering expanse of the sea. This Munro not only promises a rewarding climb but also an unforgettable panorama that captures the essence of Scotland's natural beauty.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgorr-dhonuill-beinn-a-bheithir-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.67830,-5.12981/"
  },
  {
    "id": "31",
    "name": "Beinn a' Bhuird",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1196,
    "section": "08B",
    "region": "08B: Cairngorms",
    "feet": 3924,
    "summited": false,
    "lat": 57.08759,
    "lng": -3.499383,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-a-bhuird",
    "description": "Beinn a' Bhuird stands as one of the towering giants within the Cairngorms, characterized by its vast and imposing presence. The mountain's expansive plateau gracefully encircles a series of stunning corries, with the secluded Garbh Choire being the most impressive of them all. Adventurers can reach this majestic peak by traversing the serene pinewoods of Glen Quoich or by crossing the rugged moorlands of Gleann an t-Slugain. Each route offers its own unique and breathtaking journey to the summit.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-a-bhuird-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.00170,-3.45540/"
  },
  {
    "id": "32",
    "name": "Beinn a' Chaorainn",
    "extra": "Cairngorms",
    "area": "Cairngorms",
    "meters": 1083,
    "section": "08B",
    "region": "08B: Cairngorms",
    "feet": 3554,
    "summited": false,
    "lat": 57.093272,
    "lng": -3.577434,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-a-chaorainn-cairngorms",
    "description": "Beinn a' Chaorainn stands sentinel over the eastern flank of the renowned Lairig an Laoigh pass, which threads its way through the heart of the Cairngorms. The mountain's slopes that rise above the pass are notably steep, presenting a challenging ascent for hikers. However, to the south of its rounded summit lies the expansive and moss-covered plateau known as the Moine Bhealaidh. This vast, verdant expanse offers a striking contrast to the rugged inclines, providing a serene and open landscape that stretches as far as the eye can see.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-a-chaorainn-cairngorms-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.99000,-3.54430/"
  },
  {
    "id": "33",
    "name": "Beinn a' Chaorainn",
    "extra": "Glen Spear",
    "area": "Fort William",
    "meters": 1049,
    "section": "09C",
    "region": "09C: Loch Lochy to Loch Laggan",
    "feet": 3442,
    "summited": false,
    "lat": 56.928624,
    "lng": -4.653644,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-a-chaorainn-glen-spean",
    "description": "Beinn a' Chaorainn presents itself as a straightforward north-south ridge adorned with three distinct summits, majestically rising above the dense forestry that lies to the north of Loch Laggan. The mountain's eastern side is dramatically sculpted into steep, rugged corries, offering a striking contrast to the more subdued and featureless slopes found on its western flank. This combination of dramatic and gentle landscapes makes Beinn a' Chaorainn a fascinating destination for munro baggers seeking both challenge and beauty in their ascent.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-a-chaorainn-glen-spean-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.89510,-4.66560/"
  },
  {
    "id": "34",
    "name": "Beinn a' Chlachair",
    "extra": "",
    "area": "Fort William",
    "meters": 1088,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3569,
    "summited": false,
    "lat": 56.869534,
    "lng": -4.509668,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-a-chlachair",
    "description": "Beinn a' Chlachair stands as the tallest peak among a trio of Munros nestled within the Ardverikie Forest, just south of the picturesque Loch Laggan. One of its most striking characteristics is Coire Mòr a' Chlachair, a magnificent corrie that graces its northern slopes. The mountain boasts an expansive plateau, offering sweeping views, yet it presents an imposing barrier to the secluded An Lairig to the south. On all other sides, the terrain is notably steep, adding to the mountain's rugged allure.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-a-chlachair-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.91220,-4.57556/"
  },
  {
    "id": "35",
    "name": "Beinn a' Chleibh",
    "extra": "",
    "area": "Argyll",
    "meters": 916,
    "section": "01D",
    "region": "01D: Inveraray to Crianlarich",
    "feet": 3006,
    "summited": false,
    "lat": 56.39023,
    "lng": -4.83563,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-a-chleibh",
    "description": "Beinn a' Chlèibh barely qualifies as a Munro, often standing in the shadow of its more renowned neighbor, Ben Lui. Typically, hikers tackle both peaks in a single outing. From Glen Lochay, Beinn a' Chlèibh reveals its dauntingly steep inclines, offering a challenging yet rewarding ascent for those who venture up its slopes. Despite its lesser fame, the mountain provides a unique and fulfilling experience for dedicated Munro baggers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-a-chleibh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.40990,-4.85552/"
  },
  {
    "id": "36",
    "name": "Beinn a' Chochuill",
    "extra": "",
    "area": "Argyll",
    "meters": 980,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3215,
    "summited": false,
    "lat": 56.44979,
    "lng": -5.068552,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-a-chochuill",
    "description": "Beinn a' Chochuill is somewhat tucked away behind the more renowned Ben Cruachan range. This munro features an extended, nearly flat summit ridge that offers excellent vistas. From the top, you can enjoy impressive views of the majestic Cruachan, as well as sweeping panoramas over Glen Kinglas and the shimmering waters of Loch Etive to the north. The relative seclusion of Beinn a' Chochuill makes it a hidden gem for those seeking a quieter, yet equally rewarding, hiking experience.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-a-chochuill-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.41450,-5.02331/"
  },
  {
    "id": "37",
    "name": "Beinn a' Chreachain",
    "extra": "",
    "area": "Argyll",
    "meters": 1081,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3545,
    "summited": false,
    "lat": 56.560387,
    "lng": -4.647589,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-a-chreachain",
    "description": "Beinn a' Chreachain stands as the easternmost peak among the quartet of Munros near the Bridge of Orchy. While it may not boast the same striking features as its nearby counterpart, Beinn Achaladair, it still offers its own unique charm. One of its most captivating aspects is Coire an Lochain, nestled on its northern side, which cradles a picturesque lochan. From the summit of Beinn a' Chreachain, hikers are rewarded with sweeping views over the vast expanse of Rannoch Moor, a sight that underscores the mountain's serene and majestic presence.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-a-chreachain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.55560,-4.74610/"
  },
  {
    "id": "38",
    "name": "Beinn a' Chroin",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 941,
    "section": "01C",
    "region": "01C: Loch Lomond to Strathyre",
    "feet": 3089,
    "summited": false,
    "lat": 56.331991,
    "lng": -4.609644,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-a-chroin",
    "description": "Beinn a' Chròin is an unexpectedly rugged and rocky peak situated to the south of Crianlarich. This mountain has sparked some debate over the years regarding the location of its true summit. For a long time, the point with the largest cairn was believed to be the highest. However, it has since been established that the actual Munro summit lies further west along the ridge. This discovery has added an extra layer of intrigue for those who venture to conquer this distinctive mountain.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-a-chroin-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.37900,-4.64300/"
  },
  {
    "id": "39",
    "name": "Braigh Coire Chruinn-bhalgain",
    "extra": "Beinn a’ Ghlo",
    "area": "Perthshire",
    "meters": 1070,
    "section": "06B",
    "region": "06B: Pitlochry to Braemar & Blairgowrie",
    "feet": 3510,
    "summited": false,
    "lat": 56.831101,
    "lng": -3.729489,
    "link": "https://www.walkhighlands.co.uk/munros/braigh-coire-chruinn-bhalgain",
    "description": "Braigh Coire Chruinn-bhalgain, the central peak of the Beinn a' Ghlò range, is a fascinating and intricate mountain characterized by its winding ridges and steep, dramatic slopes. This impressive summit holds a commanding position overlooking the picturesque Glen Tilt, offering hikers stunning views and a rewarding challenge.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/braigh-coire-chruinn-bhalgain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.78260,-3.79260/"
  },
  {
    "id": "40",
    "name": "Carn Liath",
    "extra": "Beinn a’ Ghlo",
    "area": "Perthshire",
    "meters": 976,
    "section": "06B",
    "region": "06B: Pitlochry to Braemar & Blairgowrie",
    "feet": 3201,
    "summited": false,
    "lat": 56.80777,
    "lng": -3.74409,
    "link": "https://www.walkhighlands.co.uk/munros/carn-liath-beinn-a-ghlo",
    "description": "Càrn Liath, while being the least elevated of the three peaks that make up Beinn a' Ghlò, stands out for its accessibility and striking visibility from the main A9 road. Despite its lower altitude, it offers a rewarding climb and is often the first choice for many hikers due to its prominent and inviting appearance. The journey to its summit is relatively straightforward, making it an excellent introduction to the Beinn a' Ghlò range.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-liath-beinn-a-ghlo-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.78260,-3.79260/"
  },
  {
    "id": "41",
    "name": "Carn nan Gabhar",
    "extra": "Beinn a’ Ghlo",
    "area": "Perthshire",
    "meters": 1122,
    "section": "06B",
    "region": "06B: Pitlochry to Braemar & Blairgowrie",
    "feet": 3681,
    "summited": false,
    "lat": 56.839846,
    "lng": -3.688022,
    "link": "https://www.walkhighlands.co.uk/munros/carn-nan-gabhar",
    "description": "Càrn nan Gabhar stands as the tallest and most secluded peak within the Beinn a' Ghlò range. This majestic summit provides breathtaking vistas over the vast, uninhabited expanse of the Mounth. It serves as a splendid conclusion to an exhilarating ridge-walk, rewarding hikers with its serene and panoramic beauty.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-nan-gabhar-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.78260,-3.79260/"
  },
  {
    "id": "42",
    "name": "Beinn Achaladair",
    "extra": "",
    "area": "Argyll",
    "meters": 1039,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3407,
    "summited": false,
    "lat": 56.551909,
    "lng": -4.694515,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-achaladair",
    "description": "Beinn Achaladair stands out as arguably the most magnificent of the quartet of Munros near Bridge of Orchy. Its striking north face commands attention, rising majestically above the enchanting pinewoods of the Black Wood of Rannoch. From its summit, the panorama is nothing short of breathtaking, offering sweeping views over the serene waters of Loch Tulla and the expansive Rannoch Moor. The vista extends further to encompass the rugged beauty of the Black Mount and the dramatic landscapes of Glencoe, making it a truly memorable experience for any hillwalker.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-achaladair-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.55560,-4.74610/"
  },
  {
    "id": "43",
    "name": "Sgurr Mor",
    "extra": "Beinn Alligin",
    "area": "Torridon",
    "meters": 986,
    "section": "13A",
    "region": "13A: Loch Torridon to Loch Maree",
    "feet": 3235,
    "summited": false,
    "lat": 57.590829,
    "lng": -5.572765,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-mor-beinn-alligin",
    "description": "Sgùrr Mòr stands as the prominent peak of Beinn Alligin, characterized by its elegant, domed shape. This summit offers an absolutely breathtaking vantage point, providing sweeping views of the Isle of Skye across the waters and the rugged landscapes of the Horns of Alligin and Liathach further inland. The panoramic scenery from Sgùrr Mòr is nothing short of spectacular, making it a must-visit for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-mor-beinn-alligin-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.55890,-5.56391/"
  },
  {
    "id": "44",
    "name": "Tom na Gruagaich",
    "extra": "Beinn Alligin",
    "area": "Torridon",
    "meters": 922,
    "section": "13A",
    "region": "13A: Loch Torridon to Loch Maree",
    "feet": 3025,
    "summited": false,
    "lat": 57.580519,
    "lng": -5.581912,
    "link": "https://www.walkhighlands.co.uk/munros/tom-na-gruagaich-beinn-alligin",
    "description": "Tom na Gruagaich, which was previously classified as a Top, gained recognition as the second Munro of Beinn Alligin in 1997. This peak offers breathtaking vistas stretching across the sea towards the Isle of Skye. For many hikers, it serves as the gateway to the exhilarating traverse of the entire mountain range. The journey begins with a rewarding ascent that unveils panoramic views, setting the stage for an unforgettable adventure through rugged terrain and dramatic landscapes.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/tom-na-gruagaich-beinn-alligin-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.55890,-5.56391/"
  },
  {
    "id": "45",
    "name": "Beinn an Dothaidh",
    "extra": "",
    "area": "Argyll",
    "meters": 1004,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3294,
    "summited": false,
    "lat": 56.53013,
    "lng": -4.713981,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-an-dothaidh",
    "description": "While it may not enjoy the same level of fame as its nearby counterpart Beinn Dòrain, Beinn an Dòthaidh offers a superior vantage point. The summit cairn, perched on the steep northern slopes, provides an extraordinary aerial view that stretches over the stunning Loch Tulla and the expansive Rannoch Moor. This breathtaking panorama makes the climb well worth the effort, rewarding hikers with a visual feast of Scotland's natural beauty.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-an-dothaidh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.51690,-4.76920/"
  },
  {
    "id": "46",
    "name": "Beinn Bheoil",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1019,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3343,
    "summited": false,
    "lat": 56.813276,
    "lng": -4.430662,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-bheoil",
    "description": "Often ascended in conjunction with its towering parent peak, Ben Alder, the secluded Bheinn Bheoil offers a relatively straightforward ridge walk that soars high above the serene waters of Loch Ericht. This remote Munro provides a rewarding experience for those seeking solitude and breathtaking views in the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-bheoil-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.85350,-4.42380/"
  },
  {
    "id": "47",
    "name": "Beinn Bhreac",
    "extra": "",
    "area": "Cairngorms",
    "meters": 930,
    "section": "08B",
    "region": "08B: Cairngorms",
    "feet": 3052,
    "summited": false,
    "lat": 57.055072,
    "lng": -3.553472,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-bhreac",
    "description": "Beinn Bhreac, though considered modest in height by Cairngorms standards, stands proudly at the southern edge of an expansive, marshy moorland. This Munro offers a picturesque vantage point, towering above the stunning Glen Derry. Its serene and elevated position provides hikers with breathtaking views and a sense of tranquility amidst the rugged beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-bhreac-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.99000,-3.54430/"
  },
  {
    "id": "48",
    "name": "Beinn Bhrotain",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1157,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 3796,
    "summited": false,
    "lat": 57.009868,
    "lng": -3.723797,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-bhrotain",
    "description": "Beinn Bhrotain is an expansive and imposing mountain that dominates a particularly isolated area on the western flank of Glen Dee. Its northern slopes descend steeply into the dramatic chasm of Glen Geusachan, creating a striking and rugged landscape. This remote giant offers a sense of solitude and adventure, making it a compelling destination for dedicated munro baggers seeking to experience the wild beauty of Scotland's highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-bhrotain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.06310,-3.89700/"
  },
  {
    "id": "49",
    "name": "Beinn Bhuidhe",
    "extra": "",
    "area": "Argyll",
    "meters": 949,
    "section": "01D",
    "region": "01D: Inveraray to Crianlarich",
    "feet": 3112,
    "summited": false,
    "lat": 56.326686,
    "lng": -4.906709,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-bhuidhe",
    "description": "Beinn Bhuidhe is often overlooked by many Munro baggers, as it is discreetly nestled between the serene Glens Shira and Fyne, near the head of Loch Fyne. Despite its somewhat hidden location, the mountain's upper ridge offers a surprisingly steep and rocky ascent, rewarding climbers with breathtaking panoramic views. The journey to its summit is both challenging and immensely satisfying, making it a hidden gem for those who seek a more secluded and rewarding climb.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-bhuidhe-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.27300,-4.91910/"
  },
  {
    "id": "50",
    "name": "Beinn Chabhair",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 932,
    "section": "01C",
    "region": "01C: Loch Lomond to Strathyre",
    "feet": 3058,
    "summited": false,
    "lat": 56.325779,
    "lng": -4.641476,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-chabhair",
    "description": "Beinn Chabhair towers impressively above Inverarnan, situated just north of the picturesque Loch Lomond. This rugged and rocky peak is not only easily accessible but also a favorite among hikers. The summit offers a splendid vantage point, providing breathtaking views that stretch down the length of Loch Long. The journey to the top is as rewarding as the panoramic scenery that awaits, making Beinn Chabhair a must-visit for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-chabhair-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.32850,-4.72180/"
  },
  {
    "id": "51",
    "name": "Ben Challum",
    "extra": "",
    "area": "Argyll",
    "meters": 1025,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3363,
    "summited": false,
    "lat": 56.454573,
    "lng": -4.619184,
    "link": "https://www.walkhighlands.co.uk/munros/ben-challum",
    "description": "Ben Challum is typically ascended starting from Strath Fillan. While the initial part of the hike may feel like a monotonous trek, the journey becomes more rewarding as you approach the final ridge, offering splendid views. The mountain truly reveals its most striking profile from the more secluded side above the head of Glen Lochay, where it takes on the appearance of a conical peak.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-challum-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.41680,-4.66690/"
  },
  {
    "id": "52",
    "name": "Beinn Dearg",
    "extra": "Blair Athol",
    "area": "Perthshire",
    "meters": 1009,
    "section": "06A",
    "region": "06A: Glen Tromie to Glen Tilt",
    "feet": 3309,
    "summited": false,
    "lat": 56.877346,
    "lng": -3.883719,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-dearg-blair-atholl",
    "description": "Beinn Dearg stands as a majestic dome of pink granite, towering over the expansive moorlands in the secluded region to the north of Blair Atholl. This striking mountain, with its distinctive hue and impressive elevation, offers a captivating sight for those venturing into this remote part of Scotland. The rugged terrain and serene landscape surrounding Beinn Dearg make it a notable destination for avid munro baggers seeking both challenge and natural beauty.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-dearg-blair-atholl-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.77450,-3.84344/"
  },
  {
    "id": "53",
    "name": "Beinn Dearg",
    "extra": "Ullapool",
    "area": "Ullapool",
    "meters": 1084,
    "section": "15A",
    "region": "15A: Loch Broom to Strath Oykel",
    "feet": 3556,
    "summited": false,
    "lat": 57.78635,
    "lng": -4.929557,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-dearg-ullapool",
    "description": "Beinn Dearg stands as the tallest peak north of the Dirrie Mòr, boasting a majestic, dome-like summit. This impressive mountain rises prominently above deep, evocative corries, offering a breathtaking and dramatic landscape. It serves as a magnificent centerpiece to an already stunning range, making it a truly rewarding climb for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-dearg-ullapool-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.81980,-5.06250/"
  },
  {
    "id": "54",
    "name": "Beinn Dorain",
    "extra": "",
    "area": "Argyll",
    "meters": 1076,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3530,
    "summited": false,
    "lat": 56.50287,
    "lng": -4.722173,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-dorain",
    "description": "Beinn Dòrain stands as one of the most recognizable and iconic peaks in the Scottish Highlands, its elegant and steep grassy slopes forming a striking pyramid shape that becomes visible as you journey northward from Tyndrum. This majestic hill is not only a favorite among hillwalkers but also holds a special place in Scottish cultural heritage, having been immortalized in the verses of the renowned Gaelic poet, Duncan Bàn MacIntyre. The mountain's beauty and cultural significance make it a must-visit for both outdoor enthusiasts and those interested in Scotland's rich literary history.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-dorain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.51690,-4.76920/"
  },
  {
    "id": "55",
    "name": "Beinn Dubhchraig",
    "extra": "",
    "area": "Argyll",
    "meters": 979,
    "section": "01D",
    "region": "01D: Inveraray to Crianlarich",
    "feet": 3211,
    "summited": false,
    "lat": 56.391295,
    "lng": -4.743193,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-dubhchraig",
    "description": "Beinn Dubhchraig, often tackled in conjunction with its nearby peak Ben Oss, forms an integral part of the majestic Ben Lui mountain range. This Munro is typically approached from the starting point at Dalrigh, which lies nestled between the charming villages of Crianlarich and Tyndrum. The ascent offers a rewarding experience, with stunning vistas and a sense of adventure as you traverse the rugged terrain.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-dubhchraig-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.42500,-4.68680/"
  },
  {
    "id": "56",
    "name": "Beinn Eibhinn",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1103,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3620,
    "summited": false,
    "lat": 56.825255,
    "lng": -4.542077,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-eibhinn",
    "description": "Beinn Èibhinn is characterized by its steep, rugged slopes that gracefully arc around the scenic Coire a' Charra Mhoir. As a prominent feature of the Geal Chàrn ridge system, which lies to the north of the imposing Ben Alder, this munro presents a challenging yet rewarding trek. Reaching Beinn Èibhinn demands a considerable hike, no matter which direction you approach from, making it a true adventure for dedicated hillwalkers. The journey, though lengthy, offers breathtaking views and a sense of accomplishment for those who conquer its heights.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-eibhinn-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.85350,-4.42380/"
  },
  {
    "id": "57",
    "name": "Ruadh-stac Mor",
    "extra": "Beinn Eighe",
    "area": "Torridon",
    "meters": 1010,
    "section": "13A",
    "region": "13A: Loch Torridon to Loch Maree",
    "feet": 3314,
    "summited": false,
    "lat": 57.593735,
    "lng": -5.429454,
    "link": "https://www.walkhighlands.co.uk/munros/ruadh-stac-mor-beinn-eighe",
    "description": "Beinn Eighe stands proudly as one of the renowned giants of Torridon. Its highest peak, Ruadh Stac-Mhòr, rises as a steep-sided dome situated to the north of the main ridge. This majestic summit towers above Coire Mhic Fhearchair, which is widely regarded as one of the most magnificent corries in Scotland. The rugged beauty and dramatic landscapes of Beinn Eighe make it a must-visit for any munro bagger seeking to experience the grandeur of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ruadh-stac-mor-beinn-eighe-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.55560,-5.41370/"
  },
  {
    "id": "58",
    "name": "Spidean Coire nan Clach",
    "extra": "Beinn Eighe",
    "area": "Torridon",
    "meters": 993,
    "section": "13A",
    "region": "13A: Loch Torridon to Loch Maree",
    "feet": 3258,
    "summited": false,
    "lat": 57.582098,
    "lng": -5.403706,
    "link": "https://www.walkhighlands.co.uk/munros/spidean-coire-nan-clach-beinn-eighe",
    "description": "In 1997, Spidean Coire nan Clach was elevated to Munro status, making it the second Munro on the Beinn Eighe massif. This majestic peak features a trig point situated at 972 meters along the ridge. However, the true summit, a striking rocky pinnacle, lies a bit further to the northeast and reaches an elevation of 992 meters. This elevation change offers climbers a rewarding challenge and stunning views, making it a must-visit for any dedicated Munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/spidean-coire-nan-clach-beinn-eighe-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.55560,-5.41370/"
  },
  {
    "id": "59",
    "name": "Beinn Eunaich",
    "extra": "",
    "area": "Argyll",
    "meters": 989,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3245,
    "summited": false,
    "lat": 56.450352,
    "lng": -5.026639,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-eunaich",
    "description": "Beinn Eunaich towers majestically above the lower reaches of Glen Strae, presenting a challenging ascent with its steep, grassy slopes interspersed with rugged, broken rock. This munro demands a good level of fitness and determination from those who seek to conquer it. Hikers often pair this climb with the nearby Beinn a' Chochuill, making for a rewarding and comprehensive day of munro bagging in this stunning part of Scotland. The combination of these two peaks offers a varied and exhilarating experience, showcasing the raw beauty and demanding terrain of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-eunaich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.41450,-5.02331/"
  },
  {
    "id": "60",
    "name": "Beinn Fhada",
    "extra": "",
    "area": "Kintail",
    "meters": 1032,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3385,
    "summited": false,
    "lat": 57.221002,
    "lng": -5.283519,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-fhada",
    "description": "Beinn Fhada boasts an expansive summit plateau characterized by its rugged, craggy flanks and a number of impressive corries. This majestic mountain is prominently visible from Morvich, situated near the head of Loch Duich, offering a striking and memorable view. The varied terrain and dramatic landscape make Beinn Fhada a rewarding climb for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-fhada2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/57.23480,-5.38090/"
  },
  {
    "id": "61",
    "name": "Beinn Fhionnlaidh",
    "extra": "",
    "area": "Argyll",
    "meters": 959,
    "section": "03B",
    "region": "03B: Loch Linnhe to Loch Etive",
    "feet": 3146,
    "summited": false,
    "lat": 56.600978,
    "lng": -5.104749,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-fhionnlaidh",
    "description": "Beinn Fhionnlaidh stretches out as a lengthy, broad, and gently rolling ridge nestled between the scenic Glen Etive and the tranquil Loch Creran. This majestic munro offers multiple ascent routes, but the path starting from Loch Creran is particularly favored. This approach not only sidesteps the densest forestry sections but also rewards climbers with stunning panoramic views of the sea. Whether you're an experienced hiker or a novice, the journey up Beinn Fhionnlaidh promises a memorable adventure with its captivating landscapes and serene vistas.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-fhionnlaidh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.59040,-5.20007/"
  },
  {
    "id": "62",
    "name": "Beinn Fhionnlaidh",
    "extra": "Carn Eige",
    "area": "Loch Ness",
    "meters": 1005,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3297,
    "summited": false,
    "lat": 57.305977,
    "lng": -5.129909,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-fhionnlaidh-carn-eige",
    "description": "Beinn Fhionnlaidh presents a unique challenge for Munro enthusiasts due to its remote location on the ridge extending north from Càrn Eige. The formidable Loch Mullardoch lies at the base of this ridge, acting as a natural barrier and making access particularly difficult. As a result, most climbers find themselves having to summit Càrn Eige not once, but twice, in order to reach and return from Beinn Fhionnlaidh. This double ascent adds an extra layer of complexity and effort, making the journey to this peak both demanding and rewarding for those who undertake it.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-fhionnlaidh-carn-eige-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.27340,-4.96180/"
  },
  {
    "id": "63",
    "name": "Beinn Ghlas",
    "extra": "",
    "area": "Perthshire",
    "meters": 1103,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3619,
    "summited": false,
    "lat": 56.535996,
    "lng": -4.236992,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-ghlas",
    "description": "Beinn Ghlas, though not widely recognized on its own, is one of the most frequently ascended Munros in Scotland. This popularity stems from its location along the common route to the more famous Ben Lawers. Rarely tackled as a standalone peak, Beinn Ghlas boasts a remarkable array of arctic flora, making it a botanical treasure. Nestled within the Ben Lawers National Nature Reserve, it offers hikers a unique opportunity to experience the rich natural heritage of the area while on their journey to conquer Ben Lawers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-ghlas-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.51100,-4.26287/"
  },
  {
    "id": "64",
    "name": "Beinn Ime",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 1012,
    "section": "01D",
    "region": "01D: Inveraray to Crianlarich",
    "feet": 3321,
    "summited": false,
    "lat": 56.236794,
    "lng": -4.817125,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-ime",
    "description": "Beinn Ìme stands as the tallest peak among the Arrochar Alps, offering a commanding presence in the region. Most hikers choose to ascend via the expansive southern slopes, starting from the Bealach a'Mhàim. This route provides a relatively gentle climb compared to the mountain's other faces, which are characterized by their steepness and rugged terrain. The varied topography ensures that Beinn Ìme presents a rewarding challenge for all who venture to its summit.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-ime-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.20600,-4.75070/"
  },
  {
    "id": "65",
    "name": "Beinn Iutharn Mhor",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1045,
    "section": "06B",
    "region": "06B: Pitlochry to Braemar & Blairgowrie",
    "feet": 3428,
    "summited": false,
    "lat": 56.894994,
    "lng": -3.568229,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-iutharn-mhor",
    "description": "Beinn Iutharn Mhòr stands as a prominent, steep-sided peak amidst the otherwise gently undulating wilderness of the Mounth region. This majestic mountain is most commonly approached through the extensive and scenic Glen Ey, which stretches out from the north, offering a rewarding journey for those who venture into this remote and captivating landscape. The ascent provides a striking contrast between the rugged slopes of Beinn Iutharn Mhòr and the softer contours of the surrounding terrain, making it a memorable experience for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-iutharn-mhor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.98510,-3.50030/"
  },
  {
    "id": "66",
    "name": "Beinn Liath Mhor",
    "extra": "",
    "area": "Torridon",
    "meters": 926,
    "section": "13B",
    "region": "13B: Applecross to Achnasheen",
    "feet": 3038,
    "summited": false,
    "lat": 57.512083,
    "lng": -5.400618,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-liath-mhor",
    "description": "Beinn Liath Mhòr is an elongated ridge characterized by multiple summits, composed primarily of striking sandstone. Its steep, rugged flanks add to its dramatic appearance, while the summit is adorned with patches of gleaming white quartzite. From the top, hikers are rewarded with captivating vistas that stretch over the Coulin Forest and extend into the majestic landscapes of Torridon. The unique geological features and panoramic views make this munro a memorable climb for any outdoor enthusiast.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-liath-mhor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.48170,-5.32935/"
  },
  {
    "id": "67",
    "name": "Beinn Liath Mhor Fannaich",
    "extra": "",
    "area": "Ullapool",
    "meters": 954,
    "section": "14B",
    "region": "14B: The Fannaichs",
    "feet": 3131,
    "summited": false,
    "lat": 57.706095,
    "lng": -4.989775,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-liath-mhor-fannaich",
    "description": "Beinn Liath Mhòr Fannaich is a substantial Munro located just north of the primary Fannichs ridge. This mountain provides excellent vistas, not only of the adjacent peaks but also extending towards the Beinn Dearg range. Its prominent position makes it a rewarding climb for those seeking to experience the diverse and stunning landscapes of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-liath-mhor-fannaich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.72480,-4.89430/"
  },
  {
    "id": "68",
    "name": "Beinn Mhanach",
    "extra": "",
    "area": "Argyll",
    "meters": 953,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3125,
    "summited": false,
    "lat": 56.534032,
    "lng": -4.646042,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-mhanach",
    "description": "Beinn Mhanach, while not the most striking of Munros, presents itself as a gentle, rounded hill regardless of the viewpoint. This mountain can be accessed via two main routes: the scenic Auch Glen offers a picturesque approach, while a less conventional path leads over the Bealach Achaladair starting from Achaladair Farm. Both routes provide unique experiences for those looking to add this Munro to their collection.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-mhanach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.46070,-4.71466/"
  },
  {
    "id": "69",
    "name": "Beinn Mheadhoin",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1183,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 3881,
    "summited": false,
    "lat": 57.095849,
    "lng": -3.611464,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-mheadhoin",
    "description": "Beinn Mheadhoin is nestled deep within the rugged expanse of the Cairngorms range, offering a truly remote and wild experience. The summit plateau is adorned with striking granite tors that add a dramatic flair to the landscape. Adventurers can reach this majestic peak from the north, traversing the breathtaking Loch Avon basin, though this route demands significant effort on the return journey due to the necessary reascent. Alternatively, a longer but equally rewarding approach can be taken from the south, providing a different perspective of this captivating mountain.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-mheadhoin-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.13400,-3.67120/"
  },
  {
    "id": "70",
    "name": "Beinn na Lap",
    "extra": "",
    "area": "Fort William",
    "meters": 935,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3068,
    "summited": false,
    "lat": 56.78939,
    "lng": -4.659977,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-na-lap",
    "description": "Beinn na Lap is a gently sloping mountain nestled in the rugged wilderness to the northeast of Rannoch Moor. This serene peak is conveniently accessible, with the West Highland railway running near its base. Starting your ascent from Corrour Station, you'll find the climb to be both brief and uncomplicated, making it an ideal choice for those seeking a rewarding yet manageable hike in the Scottish Highlands. The surrounding landscape offers a sense of isolation and tranquility, perfect for those looking to immerse themselves in nature.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-na-lap-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.76040,-4.69070/"
  },
  {
    "id": "71",
    "name": "Beinn nan Aighenan",
    "extra": "",
    "area": "Fort William",
    "meters": 959,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3146,
    "summited": false,
    "lat": 56.520349,
    "lng": -5.011178,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-nan-aighenan",
    "description": "Beinn nan Aighenan stands as a solitary peak, presenting a challenging endeavor for Munro baggers. This remote summit can be accessed through two primary routes: a lengthy trek up the scenic Glen Kinglas or a demanding ascent over the intervening ridge from the picturesque Glen Etive. Both approaches require a good level of fitness and determination, rewarding hikers with a sense of accomplishment and stunning views of the surrounding highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-nan-aighenan-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.57650,-5.03520/"
  },
  {
    "id": "72",
    "name": "Beinn Narnain",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 927,
    "section": "01D",
    "region": "01D: Inveraray to Crianlarich",
    "feet": 3041,
    "summited": false,
    "lat": 56.220956,
    "lng": -4.789003,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-narnain",
    "description": "Beinn Narnain, a prominent peak within the Arrochar Alps, is frequently one of the initial Munros that climbers choose to conquer. This rugged and rocky mountain offers a challenging ascent, featuring sections of scrambling and multiple deceptive false summits that can test even seasoned hikers. Its dramatic landscape and the sense of achievement upon reaching the true summit make it a memorable experience for all who undertake the climb.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-narnain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.20600,-4.75070/"
  },
  {
    "id": "73",
    "name": "Beinn Sgritheall",
    "extra": "",
    "area": "Kintail",
    "meters": 974,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3196,
    "summited": false,
    "lat": 57.153815,
    "lng": -5.579727,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-sgritheall",
    "description": "Beinn Sgritheall boasts one of the most spectacular locations of all the Munros, majestically rising above the quaint village of Arnisdale on the shores of Loch Hourn. The climb to its summit is a relentless and challenging endeavor, but those who reach the top are rewarded with some of the most breathtaking vistas in all of Scotland. The panoramic views stretch far and wide, offering a truly unforgettable experience for any avid hillwalker.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-sgritheall-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.13440,-5.56790/"
  },
  {
    "id": "74",
    "name": "Beinn Sgulaird",
    "extra": "",
    "area": "Argyll",
    "meters": 937,
    "section": "03B",
    "region": "03B: Loch Linnhe to Loch Etive",
    "feet": 3074,
    "summited": false,
    "lat": 56.56624,
    "lng": -5.170399,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-sgulaird",
    "description": "Perched along the coastline, Beinn Sgulaird is renowned for offering breathtaking panoramic views. This reputation is well-earned, as the vistas from its summit are truly spectacular. However, don't be deceived by its proximity to the road; the journey to the top is far more challenging than it appears. The steep inclines and rolling ridge demand a significant effort, making the ascent a rigorous and rewarding adventure for any dedicated munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-sgulaird-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.55560,-5.24130/"
  },
  {
    "id": "75",
    "name": "Beinn Heasgarnich",
    "extra": "",
    "area": "Perthshire",
    "meters": 1077,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3535,
    "summited": false,
    "lat": 56.510254,
    "lng": -4.579217,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-heasgarnich",
    "description": "Beinn Heasgarnich is an expansive and majestic mountain, offering a rewarding challenge for avid munro baggers. This impressive peak can be accessed via the elevated private road that connects the scenic Glen Lochay with the picturesque Glen Lyon. However, adventurers should be prepared to navigate through a natural barrier of extensive peat bogs that encircle the mountain, adding an extra layer of difficulty to the ascent. The journey to the summit is both demanding and exhilarating, promising breathtaking views and a profound sense of accomplishment.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-heasgarnich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.49910,-4.47590/"
  },
  {
    "id": "76",
    "name": "Beinn Tarsuinn",
    "extra": "",
    "area": "Ullapool",
    "meters": 934,
    "section": "14A",
    "region": "14A: Loch Maree to Loch Broom",
    "feet": 3064,
    "summited": false,
    "lat": 57.702051,
    "lng": -5.291634,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-tarsuinn",
    "description": "Beinn Tarsuinn stands proudly in the heart of the Fisherfield Forest, a region renowned for its untamed beauty and remote wilderness. Ascending this munro is no small feat and demands a truly epic journey. Whether you choose to tackle it alongside the other Fisherfield Munros starting from Shenavall in the north, or opt for the southern approach from Kinlochewe, the adventure promises to be both challenging and rewarding. The rugged terrain and breathtaking landscapes make every step of the ascent a memorable experience, immersing you in one of Scotland's most pristine natural environments.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-tarsuinn-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.77680,-5.25450/"
  },
  {
    "id": "77",
    "name": "Beinn Teallach",
    "extra": "",
    "area": "Fort William",
    "meters": 915,
    "section": "09C",
    "region": "09C: Loch Lochy to Loch Laggan",
    "feet": 3001,
    "summited": false,
    "lat": 56.935932,
    "lng": -4.694754,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-teallach",
    "description": "Beinn Teallach, which once held the title of the highest Corbett, has since been reclassified as one of the smallest Munros. The mountain features steep terrain on its eastern flank, yet it doesn't possess any particularly striking characteristics. Despite its modest elevation, Beinn Teallach offers a rewarding climb with panoramic views that make the effort worthwhile. The ascent may not be as challenging as some of the more prominent Munros, but it provides a satisfying experience for those looking to explore the diverse landscapes of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-teallach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.89510,-4.66560/"
  },
  {
    "id": "78",
    "name": "Beinn Tulaichean",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 946,
    "section": "01C",
    "region": "01C: Loch Lomond to Strathyre",
    "feet": 3103,
    "summited": false,
    "lat": 56.342234,
    "lng": -4.563315,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-tulaichean",
    "description": "Beinn Tulaichean, while often considered a lesser peak on the southern ridge of Cruach Àrdrain, offers its own unique charm and appeal. This munro is most prominently viewed and accessed from Inverlochlarig in the picturesque Braes of Balquhidder. For those seeking an alternative route, it is also feasible to reach Beinn Tulaichean by traversing over Cruach Àrdrain from the A82. The journey to its summit provides a rewarding experience, showcasing the serene beauty and rugged landscapes of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-tulaichean-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.33300,-4.51570/"
  },
  {
    "id": "79",
    "name": "Beinn Udlamain",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1010,
    "section": "05A",
    "region": "05A: Loch Ericht to Glen Tromie & Glen Garry",
    "feet": 3314,
    "summited": false,
    "lat": 56.835444,
    "lng": -4.329976,
    "link": "https://www.walkhighlands.co.uk/munros/beinn-udlamain",
    "description": "Beinn Udlamain stands as the tallest of the quartet of peaks located on the western flank of the Drumochter Pass. This majestic mountain provides hikers with stunning vistas, particularly of the impressive Ben Alder range. The journey to its summit rewards adventurers with sweeping panoramas that capture the rugged beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/beinn-udlamain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.85150,-4.24440/"
  },
  {
    "id": "80",
    "name": "Ben Alder",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1148,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3766,
    "summited": false,
    "lat": 56.813804,
    "lng": -4.46509,
    "link": "https://www.walkhighlands.co.uk/munros/ben-alder",
    "description": "Ben Alder stands as one of the most secluded Munros in Scotland, offering a truly remote and wild experience. This expansive plateau is encircled by imposing cliffs and steep inclines, giving the mountain a distinctive and unforgettable character. The journey to its summit is made even more exhilarating by the striking Leachas ridges, which present opportunities for some exciting scrambling. The rugged terrain and breathtaking scenery make Ben Alder a must-visit for any dedicated Munro bagger seeking adventure and solitude.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-alder-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.85350,-4.42380/"
  },
  {
    "id": "81",
    "name": "Ben Avon",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1172,
    "section": "08B",
    "region": "08B: Cairngorms",
    "feet": 3845,
    "summited": false,
    "lat": 57.099347,
    "lng": -3.434438,
    "link": "https://www.walkhighlands.co.uk/munros/ben-avon",
    "description": "Ben Avon stands as the easternmost peak among the towering Cairngorms. This remarkable mountain features an expansive plateau that extends for miles, adorned with an impressive collection of granite tors. These unique rock formations add to the mountain's rugged beauty. The summit itself is marked by one of these tors, necessitating a brief but exhilarating scramble to reach the top. The panoramic views from the summit make the effort well worth it, offering a breathtaking perspective of the surrounding landscape.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-avon-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.00570,-3.33810/"
  },
  {
    "id": "82",
    "name": "Ben Chonzie",
    "extra": "",
    "area": "Perthshire",
    "meters": 930,
    "section": "01A",
    "region": "01A: Loch Tay to Perth",
    "feet": 3052,
    "summited": false,
    "lat": 56.453851,
    "lng": -3.992057,
    "link": "https://www.walkhighlands.co.uk/munros/ben-chonzie",
    "description": "Ben Chonzie stands as the tallest peak amidst the heathery moorlands situated to the north of Crieff. While its most picturesque aspect can be admired from the east, overlooking Glen Turret, the mountain is more commonly and swiftly ascended via well-trodden paths originating from the west. The journey from this direction offers a more direct route, making it a popular choice for many hikers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-chonzie-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.42090,-4.03940/"
  },
  {
    "id": "83",
    "name": "Ben Cruachan",
    "extra": "",
    "area": "Argyll",
    "meters": 1127,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3698,
    "summited": false,
    "lat": 56.426841,
    "lng": -5.131802,
    "link": "https://www.walkhighlands.co.uk/munros/ben-cruachan",
    "description": "Ben Cruachan stands as a highly favored mountain, boasting the highest peak within an impressive array of jagged summits nestled between Loch Awe and Loch Etive. Its striking presence is easily recognizable from afar, making it a prominent feature in many distant vistas. Adding to its allure, beneath the central corrie lies a massive underground hydro-electric power station, a marvel of engineering that harnesses the natural energy of the landscape. This combination of natural beauty and human ingenuity makes Ben Cruachan a must-visit for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-cruachan-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.39370,-5.11198/"
  },
  {
    "id": "84",
    "name": "Ben Hope",
    "extra": "",
    "area": "Sutherland",
    "meters": 927,
    "section": "16B",
    "region": "16B: Durness to Loch Shin",
    "feet": 3041,
    "summited": false,
    "lat": 58.413113,
    "lng": -4.60786,
    "link": "https://www.walkhighlands.co.uk/munros/ben-hope",
    "description": "Ben Hope, the northernmost of all the Munros, stands as a solitary giant in the rugged landscape of Scotland. Its typical ascent is relatively brief, allowing for a swift climb to the summit. Once at the top, you are rewarded with breathtaking vistas of a starkly beautiful wilderness, dotted with serene lochans and expansive moorlands. The sense of isolation and the raw, untamed beauty of the surroundings make the journey to Ben Hope an unforgettable experience for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-hope-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/58.39040,-4.63280/"
  },
  {
    "id": "85",
    "name": "Ben Klibreck",
    "extra": "",
    "area": "Sutherland",
    "meters": 962,
    "section": "16D",
    "region": "16D: Altnaharra to Dornoch",
    "feet": 3156,
    "summited": false,
    "lat": 58.235202,
    "lng": -4.41113,
    "link": "https://www.walkhighlands.co.uk/munros/ben-klibreck",
    "description": "Ben Klibreck stands as a majestic giant, reminiscent of a colossal whale, amidst the remote and untamed landscapes of East Sutherland. This Munro, known for its isolation, offers a challenging yet rewarding climb. The most common route to the summit involves a steep ascent, leading adventurers to a bealach situated to the south of the hill. Upon reaching this vantage point, climbers are greeted with a breathtaking panorama that showcases the rugged beauty of Scotland's northern wilderness, making the effort truly worthwhile.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-klibreck-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/58.20850,-4.49930/"
  },
  {
    "id": "86",
    "name": "Ben Lawers",
    "extra": "",
    "area": "Perthshire",
    "meters": 1214,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3983,
    "summited": false,
    "lat": 56.544921,
    "lng": -4.220876,
    "link": "https://www.walkhighlands.co.uk/munros/ben-lawers",
    "description": "Ben Lawers stands as the tallest mountain in the Southern Highlands, making it one of the most frequented summits in Scotland. Towering majestically above the serene waters of Loch Tay, this peak is celebrated not only for its impressive height but also for its rich arctic-alpine flora, which adds a unique touch to its rugged landscape. Recognized as a National Nature Reserve, Ben Lawers offers a haven for nature enthusiasts and botanists alike. The mountain is under the stewardship of the National Trust for Scotland, ensuring its preservation and accessibility for future generations of hikers and nature lovers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-lawers-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.51100,-4.26287/"
  },
  {
    "id": "87",
    "name": "Ben Lomond",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 974,
    "section": "01C",
    "region": "01C: Loch Lomond to Strathyre",
    "feet": 3195,
    "summited": false,
    "lat": 56.190302,
    "lng": -4.63301,
    "link": "https://www.walkhighlands.co.uk/munros/ben-lomond",
    "description": "Ben Lomond stands as one of the most recognizable and beloved Munros in Scotland. Its striking summit is easily visible from the southern tip of Loch Lomond at Balloch, making it a prominent feature in the landscape. The well-trodden path leading up its slopes is often bustling with hikers, reflecting its popularity. However, reaching the summit reveals a dramatic setting perched above a steep corrie, offering unparalleled views over the expansive Loch Lomond. The breathtaking panorama from the top is truly unmatched, making the climb well worth the effort.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-lomond-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.15250,-4.64310/"
  },
  {
    "id": "88",
    "name": "Ben Lui",
    "extra": "",
    "area": "Argyll",
    "meters": 1131,
    "section": "01D",
    "region": "01D: Inveraray to Crianlarich",
    "feet": 3712,
    "summited": false,
    "lat": 56.397004,
    "lng": -4.810509,
    "link": "https://www.walkhighlands.co.uk/munros/ben-lui",
    "description": "Ben Lui is a majestic summit, often hailed as the most exquisite mountain in the Southern Highlands. Its most picturesque aspect faces Dalrigh, where adventurers can embark on a thrilling scramble around either edge of its northeastern corrie. However, the more common ascent begins from Glen Lochay, offering a shorter and more direct route to the peak. This mountain's elegant form and varied approaches make it a favorite among climbers seeking both beauty and challenge.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-lui-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.40990,-4.85552/"
  },
  {
    "id": "89",
    "name": "Ben Macdui",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1309,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 4295,
    "summited": false,
    "lat": 57.070368,
    "lng": -3.669099,
    "link": "https://www.walkhighlands.co.uk/munros/ben-macdui",
    "description": "Ben Macdui, standing as the second tallest peak in Britain, is nestled in the heart of the Cairngorms plateau, an area that exudes a rugged, almost arctic wilderness far removed from the more frequented paths of Ben Nevis. This majestic mountain is a popular destination for climbers, with routes commonly taken from both Deeside and Speyside. Adding to its mystique, the summit of Ben Macdui is steeped in local legend, with tales of the spectral Old Grey Man said to haunt its lofty heights. The combination of its challenging terrain and eerie folklore makes Ben Macdui a truly captivating experience for any adventurer.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-macdui-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.13400,-3.67120/"
  },
  {
    "id": "90",
    "name": "Ben More",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 1174,
    "section": "01C",
    "region": "01C: Loch Lomond to Strathyre",
    "feet": 3852,
    "summited": false,
    "lat": 56.385952,
    "lng": -4.540087,
    "link": "https://www.walkhighlands.co.uk/munros/ben-more",
    "description": "Ben More stands out as a distinctive, towering pyramid, easily identifiable from the vicinity of Crianlarich. When viewed from further away, it is often seen alongside its close companion, Stob Binnein. The ascent from Benmore Farm is particularly challenging, with its slopes presenting a relentless and steep climb. This munro is a true test of endurance and offers breathtaking views for those who reach its summit.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-more-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.40280,-4.56120/"
  },
  {
    "id": "91",
    "name": "Ben More",
    "extra": "Mull",
    "area": "Islands",
    "meters": 966,
    "section": "17E",
    "region": "17E: Mull and Nearby Islands",
    "feet": 3169,
    "summited": false,
    "lat": 56.424829,
    "lng": -6.013999,
    "link": "https://www.walkhighlands.co.uk/munros/ben-more-mull",
    "description": "Ben More stands as the sole island Munro outside of Skye, offering a majestic and rugged presence. This impressive, rocky peak provides an exceptional vantage point, allowing hikers to gaze upon a multitude of islands scattered across the Minches. Its commanding views and striking landscape make it a must-visit for any Munro bagger seeking a unique and memorable experience.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-more-mull-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.44920,-6.06790/"
  },
  {
    "id": "92",
    "name": "Ben More Assynt",
    "extra": "",
    "area": "Ullapool",
    "meters": 998,
    "section": "16E",
    "region": "16E: Scourie to Lairg",
    "feet": 3274,
    "summited": false,
    "lat": 58.138164,
    "lng": -4.858208,
    "link": "https://www.walkhighlands.co.uk/munros/ben-more-assynt",
    "description": "Ben More Assynt stands as the tallest peak in the remarkable and rugged terrain of Assynt. This majestic mountain remains concealed from the main roads, overshadowed by its neighboring summit, Conival. The mountain boasts expansive flanks covered in scree, offering a challenging yet rewarding ascent. The approach ridge is both striking and exhilarating, leading adventurers to a summit that provides a breathtaking panorama of the surrounding, seemingly desolate landscape. The sense of isolation and raw beauty from the top is unparalleled, making Ben More Assynt a must-visit for any dedicated munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-more-assynt-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/58.14870,-4.97340/"
  },
  {
    "id": "93",
    "name": "Ben Nevis",
    "extra": "",
    "area": "Fort William",
    "meters": 1345,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 4411,
    "summited": false,
    "lat": 56.796891,
    "lng": -5.003675,
    "link": "https://www.walkhighlands.co.uk/munros/ben-nevis",
    "description": "Ben Nevis, standing as the tallest mountain in Britain, is a magnet for adventurers, drawing throngs of hikers who labor up its lengthy and grueling rocky path to reach the summit during the summer season. In stark contrast, the North Face offers a dramatically different challenge. Its imposing cliffs and slender gullies form one of the most renowned rock and ice climbing venues in the nation, attracting climbers seeking a more formidable and exhilarating experience. Whether you're a casual hiker or a seasoned climber, Ben Nevis provides a diverse range of challenges that cater to all levels of outdoor enthusiasts.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-nevis-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.81080,-5.07710/"
  },
  {
    "id": "94",
    "name": "Ben Oss",
    "extra": "",
    "area": "Argyll",
    "meters": 1030,
    "section": "01D",
    "region": "01D: Inveraray to Crianlarich",
    "feet": 3379,
    "summited": false,
    "lat": 56.389027,
    "lng": -4.775179,
    "link": "https://www.walkhighlands.co.uk/munros/ben-oss",
    "description": "Ben Oss is a striking and rugged peak, often ascended starting from Dalrigh, a quaint spot near Tyndrum. Despite its impressive features, it tends to be overshadowed by its more majestic and towering neighbor, Ben Lui. The journey to Ben Oss offers a rewarding experience, with its own unique charm and breathtaking vistas that make the climb worthwhile. The path winds through picturesque landscapes, providing a sense of solitude and adventure that is distinct from the more frequented routes leading to Ben Lui.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-oss-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.42500,-4.68680/"
  },
  {
    "id": "95",
    "name": "Ben Starav",
    "extra": "",
    "area": "Fort William",
    "meters": 1080,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3542,
    "summited": false,
    "lat": 56.538922,
    "lng": -5.049748,
    "link": "https://www.walkhighlands.co.uk/munros/ben-starav",
    "description": "Ben Starav is a striking and formidable mountain that rises dramatically from the shores at the head of Loch Etive. As you ascend, you'll encounter some impressive ridges that add to the mountain's rugged charm. The higher you climb, the more rewarding the views become, offering breathtaking panoramas that make the effort well worth it.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-starav-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.57620,-5.03566/"
  },
  {
    "id": "96",
    "name": "Ben Vane",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 916,
    "section": "01D",
    "region": "01D: Inveraray to Crianlarich",
    "feet": 3004,
    "summited": false,
    "lat": 56.249786,
    "lng": -4.781655,
    "link": "https://www.walkhighlands.co.uk/munros/ben-vane",
    "description": "Ben Vane, one of the distinguished Arrochar Alps, narrowly qualifies as a Munro but boasts a remarkable character. Its slopes are exceptionally steep and rugged, presenting a formidable challenge to climbers. The bealachs, or mountain passes, connecting Ben Vane to neighboring peaks are notably low, making it a common practice to ascend Ben Vane as a standalone adventure. Despite its modest height, the mountain's dramatic terrain and panoramic views make it a rewarding climb for any Munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-vane-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.25160,-4.70884/"
  },
  {
    "id": "97",
    "name": "Ben Vorlich",
    "extra": "Loch Earn",
    "area": "Perthshire",
    "meters": 985,
    "section": "01B",
    "region": "01B: Strathyre to Strathallan",
    "feet": 3233,
    "summited": false,
    "lat": 56.34268,
    "lng": -4.219464,
    "link": "https://www.walkhighlands.co.uk/munros/ben-vorlich-loch-earn",
    "description": "Ben Vorlich, majestically rising above Loch Earn, stands as one of Scotland's most renowned peaks and is a favorite among hikers. Situated near the Highland boundary, this mountain offers breathtaking vistas that extend into the Lowlands, making it a must-visit for those seeking both natural beauty and a rewarding climb.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-vorlich-loch-earn-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.38130,-4.21580/"
  },
  {
    "id": "98",
    "name": "Ben Vorlich",
    "extra": "Loch Lomond",
    "area": "Loch Lomond",
    "meters": 943,
    "section": "01D",
    "region": "01D: Inveraray to Crianlarich",
    "feet": 3093,
    "summited": false,
    "lat": 56.274021,
    "lng": -4.755046,
    "link": "https://www.walkhighlands.co.uk/munros/ben-vorlich-loch-lomond",
    "description": "Ben Vorlich majestically rises above the western shores at the northern end of Loch Lomond. Despite its proximity to the road, the mountain's steep inclines make for a challenging climb. On its eastern slopes, you'll find the Inveruglas hydro-electric power station, with pipelines threading through the mountain from Loch Sloy. Most hikers tackle Ben Vorlich via a steep ascent from the Loch Sloy side, but for those seeking a more varied and intriguing route, a circuit starting from Ardlui offers a rewarding alternative.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-vorlich-loch-lomond-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.25160,-4.70884/"
  },
  {
    "id": "99",
    "name": "Ben Wyvis",
    "extra": "",
    "area": "Loch Ness",
    "meters": 1046,
    "section": "15B",
    "region": "15B: Loch Vaich to Moray Firth",
    "feet": 3432,
    "summited": false,
    "lat": 57.678914,
    "lng": -4.57925,
    "link": "https://www.walkhighlands.co.uk/munros/ben-wyvis",
    "description": "Ben Wyvis stands as a solitary, massive, and imposing Munro, emerging majestically from the expansive moorlands of Easter Ross, much like a colossal elephant. Its striking presence is a familiar sight in numerous vistas, making Ben Wyvis a renowned and favored destination for many hillwalkers and climbers. The mountain's broad, sweeping slopes and distinctive profile contribute to its popularity, drawing outdoor enthusiasts who seek to conquer its heights and enjoy the panoramic views it offers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ben-wyvis-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.66580,-4.66680/"
  },
  {
    "id": "100",
    "name": "Bidean nam Bian",
    "extra": "",
    "area": "Fort William",
    "meters": 1149,
    "section": "03B",
    "region": "03B: Loch Linnhe to Loch Etive",
    "feet": 3771,
    "summited": false,
    "lat": 56.642759,
    "lng": -5.029335,
    "link": "https://www.walkhighlands.co.uk/munros/bidean-nam-bian",
    "description": "Bidean nam Bian is best described as a sprawling mountain range rather than a solitary peak. This vast and intricate formation boasts an array of dramatic cliffs, ridges, and summits that dominate the southern landscape of Glen Coe. The principal summit remains concealed from the roadside view, tucked away behind the iconic Three Sisters—three prominent ridges that stand as sentinels—and the lofty heights of Stob Coire nan Lochain. This majestic massif offers a labyrinth of rugged terrain, inviting adventurers to explore its hidden depths and panoramic vistas.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/bidean-nam-bian-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.66770,-4.98650/"
  },
  {
    "id": "101",
    "name": "Bidein a' Choire Sheasgaich",
    "extra": "",
    "area": "Torridon",
    "meters": 945,
    "section": "12A",
    "region": "12A: Kyle of Lochalsh to Garve",
    "feet": 3100,
    "summited": false,
    "lat": 57.41971,
    "lng": -5.250472,
    "link": "https://www.walkhighlands.co.uk/munros/bidein-a-choire-sheasgaich",
    "description": "Bidein a' Choire Sheasgaich stands as one of the most secluded Munros, a truly splendid summit nestled deep within the untamed expanse above Loch Monar. The journey to its base is a challenging endeavor, no matter the chosen route, involving significant climbs and descents through rugged terrain. This remote peak rewards the determined with breathtaking views and a profound sense of isolation, making the effort to reach it all the more worthwhile.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/bidein-a-choire-sheasgaich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.39150,-5.45534/"
  },
  {
    "id": "102",
    "name": "Binnein Beag",
    "extra": "",
    "area": "Fort William",
    "meters": 943,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3094,
    "summited": false,
    "lat": 56.766961,
    "lng": -4.911161,
    "link": "https://www.walkhighlands.co.uk/munros/binnein-beag",
    "description": "Binnein Beag stands as a solitary sentinel within the Mamores range, distinguished by its remote and isolated position. Despite its proximity to the towering Binnein Mòr, Binnein Beag maintains its own unique character. This steep-sided, conical peak commands respect and admiration, refusing to be overshadowed by its loftier neighbors. Its rugged slopes and distinct shape make it a noteworthy challenge for any munro bagger, offering a rewarding experience for those who venture to its summit.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/binnein-beag-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.71680,-4.96280/"
  },
  {
    "id": "103",
    "name": "Binnein Mor",
    "extra": "",
    "area": "Islands",
    "meters": 1130,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3707,
    "summited": false,
    "lat": 56.754376,
    "lng": -4.925796,
    "link": "https://www.walkhighlands.co.uk/munros/binnein-mor",
    "description": "Binnein Mòr stands as the tallest peak within the stunning Mamores range, a favorite destination for avid hillwalkers in Scotland. This mountain is not only the highest in the range but also boasts an elegant and striking presence. The panoramic vistas from its summit are truly spectacular, offering breathtaking sights of Ben Nevis and sweeping views over its lesser-known surrounding peaks. Whether you're an experienced climber or a passionate hillwalker, Binnein Mòr promises an unforgettable adventure with its remarkable scenery and challenging ascent.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/binnein-mor2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/56.71690,-4.96308/"
  },
  {
    "id": "104",
    "name": "Blà Bheinn",
    "extra": "",
    "area": "Islands",
    "meters": 929,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3047,
    "summited": false,
    "lat": 57.219565,
    "lng": -6.09321,
    "link": "https://www.walkhighlands.co.uk/munros/bla-bheinn",
    "description": "Blà Bheinn, often referred to by its anglicised name Blaven, is a strikingly isolated peak that stands apart from the main Cuillin Ridge on the Isle of Skye. This majestic mountain rises dramatically above the serene waters of Loch Slapin, offering a breathtaking spectacle. Its less visible side reveals an even more awe-inspiring landscape, making it not only one of the most impressive mountains in Britain but also one of the most exceptional vantage points you could ever experience. The panoramic views from its summit are truly unparalleled, providing a feast for the eyes and a memorable highlight for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/bla-bheinn-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.22030,-6.04290/"
  },
  {
    "id": "105",
    "name": "Braeriach",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1296,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 4252,
    "summited": false,
    "lat": 57.078307,
    "lng": -3.72839,
    "link": "https://www.walkhighlands.co.uk/munros/braeriach",
    "description": "Braeriach, standing as the third tallest peak in Britain, is often considered the crown jewel of the Cairngorms. Ascending to its expansive summit plateau demands a lengthy and challenging approach, underscoring the mountain's untamed and remote nature. Encircling the plateau, you'll find an array of striking and picturesque corries, each contributing to the mountain's dramatic and awe-inspiring landscape. This journey through rugged terrain and breathtaking scenery makes Braeriach a truly unforgettable experience for any avid munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/braeriach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.15610,-3.79430/"
  },
  {
    "id": "106",
    "name": "Broad Cairn",
    "extra": "",
    "area": "Cairngorms",
    "meters": 998,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3274,
    "summited": false,
    "lat": 56.919148,
    "lng": -3.249082,
    "link": "https://www.walkhighlands.co.uk/munros/broad-cairn",
    "description": "Broad Cairn is a prominent feature of the expansive, undulating Mounth plateau. The most accessible route to its summit begins at Loch Muick, offering the most picturesque views of the mountain from this vantage point. The journey from Loch Muick not only provides a convenient ascent but also allows hikers to fully appreciate the natural beauty and rugged terrain that characterize this part of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/broad-cairn-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.95230,-3.13620/"
  },
  {
    "id": "107",
    "name": "Bruach na Frithe",
    "extra": "",
    "area": "Islands",
    "meters": 959,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3146,
    "summited": false,
    "lat": 57.246761,
    "lng": -6.210795,
    "link": "https://www.walkhighlands.co.uk/munros/bruach-na-frithe",
    "description": "Bruach na Frithe stands out as one of the more accessible Munros within the Cuillin range, making it a popular choice for those new to Munro bagging. Although it remains concealed from the Sligachan area by the imposing Sgùrr a Bhasteir, its summit is distinctly pointed. Unlike some of its more dramatic neighbors, Bruach na Frithe features fewer sheer crags, which contributes to its reputation as a less daunting climb. Despite this, it offers an exceptional vantage point for taking in the breathtaking views of the main Cuillin Ridge, making the effort to reach its peak well worth it.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/bruach-na-frithe2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/57.28880,-6.18420/"
  },
  {
    "id": "108",
    "name": "Stob Coire Raineach",
    "extra": "Buachaille Etive Beag",
    "area": "Fort William",
    "meters": 925,
    "section": "03B",
    "region": "03B: Loch Linnhe to Loch Etive",
    "feet": 3033,
    "summited": false,
    "lat": 56.649895,
    "lng": -4.951601,
    "link": "https://www.walkhighlands.co.uk/munros/stob-coire-raineach-buachaille-etive-beag",
    "description": "Stob Coire Raineach, recognized as the northern peak of Buachaille Etive Beag, earned its status as a Munro in 1997. This expansive summit offers breathtaking vistas, particularly of the dramatic Aonach Eagach ridge. The panoramic views from the top are truly spectacular, making it a rewarding climb for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-coire-raineach-buachaille-etive-beag-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.66270,-4.95820/"
  },
  {
    "id": "109",
    "name": "Stob Dubh",
    "extra": "Buachaille Etive Beag",
    "area": "Fort William",
    "meters": 958,
    "section": "03B",
    "region": "03B: Loch Linnhe to Loch Etive",
    "feet": 3143,
    "summited": false,
    "lat": 56.638159,
    "lng": -4.970747,
    "link": "https://www.walkhighlands.co.uk/munros/stob-dubh-buachaille-etive-beag",
    "description": "Stob Dubh, the loftier of the two Munros gracing Buachaille Etive Beag, stands as a magnificent peak along an impressive stretch of ridge. This summit offers breathtaking views, particularly overlooking the serene waters of Loch Etive. The journey to Stob Dubh is a rewarding experience, with the ridge providing a dramatic backdrop that enhances the sense of adventure and accomplishment.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-dubh-buachaille-etive-beag-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.66270,-4.95820/"
  },
  {
    "id": "110",
    "name": "Stob Dearg",
    "extra": "Buachaille Etive Mor",
    "area": "Fort William",
    "meters": 1021,
    "section": "03B",
    "region": "03B: Loch Linnhe to Loch Etive",
    "feet": 3351,
    "summited": false,
    "lat": 56.646228,
    "lng": -4.900377,
    "link": "https://www.walkhighlands.co.uk/munros/stob-dearg-buachaille-etive-mor",
    "description": "Stob Dearg stands as the tallest and most magnificent summit of Buachaille Etive Mòr, earning its place as one of the most iconic landmarks in the Scottish Highlands. This mountain offers an awe-inspiring pyramid of rock that captivates the eyes of those journeying along the A82 through the vast expanse of Rannoch Moor. Its striking silhouette and rugged beauty make it a must-see for any adventurer exploring this breathtaking region.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-dearg-buachaille-etive-mor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.66440,-4.90450/"
  },
  {
    "id": "111",
    "name": "Stob na Broige",
    "extra": "Buachaille Etive Mor",
    "area": "Fort William",
    "meters": 953,
    "section": "03B",
    "region": "03B: Loch Linnhe to Loch Etive",
    "feet": 3128,
    "summited": false,
    "lat": 56.629879,
    "lng": -4.951162,
    "link": "https://www.walkhighlands.co.uk/munros/stob-na-broige-buachaille-etive-mor",
    "description": "Stob na Bròige stands proudly at the Glen Etive terminus of the iconic Buachaille Etive Mòr. Elevated to the status of a separate Munro in 1997, this peak has since become a must-visit for avid munro baggers. The reclassification encourages enthusiasts to undertake a full traverse of the ridge, offering a more comprehensive and rewarding hiking experience. The journey across the ridge not only provides a sense of accomplishment but also treats hikers to breathtaking vistas and a deeper connection with the rugged beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-na-broige-buachaille-etive-mor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.66440,-4.90450/"
  },
  {
    "id": "112",
    "name": "Bynack More",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1090,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 3576,
    "summited": false,
    "lat": 57.13822,
    "lng": -3.584716,
    "link": "https://www.walkhighlands.co.uk/munros/bynack-more",
    "description": "Bynack More stands as a prominent sentinel in the northeastern reaches of the High Cairngorms, its distinctive pyramidal peak often giving the impression of being the tallest mountain in the range when viewed from various points in Moray. The summit offers sweeping, panoramic vistas that are truly breathtaking. Adding to the mountain's allure are the impressive tors known as the Barns of Bynack, which are scattered along the eastern side of the ridge, providing an intriguing geological feature for hikers to explore.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/bynack-more-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.15910,-3.68160/"
  },
  {
    "id": "113",
    "name": "Cairn Bannoch",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1012,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3320,
    "summited": false,
    "lat": 56.927728,
    "lng": -3.278403,
    "link": "https://www.walkhighlands.co.uk/munros/cairn-bannoch",
    "description": "Cairn Bannoch, while not particularly prominent, is a notable peak situated on the expansive Mounth plateau, just south of the renowned Lochnagar. Though the summit itself may seem modest, the surrounding landscape offers dramatic features, most notably the impressive cliff face of Creag an Dubh Loch, which lies to the northeast. This striking cliff, although hidden from direct view at Cairn Bannoch, adds a sense of grandeur to the area and is a significant landmark for those exploring the region.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/cairn-bannoch-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.95250,-3.13640/"
  },
  {
    "id": "114",
    "name": "Cairn Gorm",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1245,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 4084,
    "summited": false,
    "lat": 57.116714,
    "lng": -3.644477,
    "link": "https://www.walkhighlands.co.uk/munros/cairn-gorm",
    "description": "Cairn Gorm stands as one of Scotland's most iconic peaks. Although it doesn't claim the title of the highest summit, its name has been bestowed upon the entire mountain range. The area has seen significant development, particularly for skiing, and the funicular railway that ascends to the Ptarmigan restaurant. These modern conveniences, while popular, have somewhat diminished the sense of wilderness and the traditional experience of ascending the mountain on foot. Despite this, Cairn Gorm remains a beloved destination for outdoor enthusiasts and offers breathtaking views and a unique blend of natural beauty and human ingenuity.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/cairn-gorm-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.13400,-3.67120/"
  },
  {
    "id": "115",
    "name": "Cairn of Claise",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1063,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3488,
    "summited": false,
    "lat": 56.894179,
    "lng": -3.338638,
    "link": "https://www.walkhighlands.co.uk/munros/cairn-of-claise",
    "description": "Cairn of Claise is a modest elevation situated on the expansive plateau to the east of the Cairnwell Pass. This munro may not stand out dramatically, but it offers a unique charm with its sweeping views. Near the summit, you'll find a substantial stone wall that historically marked the boundary between counties, adding a touch of historical intrigue to your hike.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/cairn-of-claise-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.90330,-3.40080/"
  },
  {
    "id": "116",
    "name": "Cairn Toul",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1291,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 4236,
    "summited": false,
    "lat": 57.054406,
    "lng": -3.710757,
    "link": "https://www.walkhighlands.co.uk/munros/cairn-toul",
    "description": "Cairn Toul stands out as one of the most striking peaks in the high Cairngorms, towering majestically above the nascent River Dee. Its elegant, shapely form makes it a prominent feature in this rugged landscape. Situated in an exceptionally wild and remote area, reaching Cairn Toul often requires a multi-day expedition. Whether you approach from Deeside or Speyside, an overnight stay is typically necessary to conquer this impressive mountain. The journey, though challenging, rewards adventurers with breathtaking views and a profound sense of accomplishment.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/cairn-toul-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.14620,-3.67930/"
  },
  {
    "id": "117",
    "name": "Carn a' Chlamain",
    "extra": "",
    "area": "Perthshire",
    "meters": 964,
    "section": "06A",
    "region": "06A: Glen Tromie to Glen Tilt",
    "feet": 3161,
    "summited": false,
    "lat": 56.860965,
    "lng": -3.779634,
    "link": "https://www.walkhighlands.co.uk/munros/carn-a-chlamain",
    "description": "Càrn a' Chlamain boasts a rocky peak perched on the boundary of an expansive plateau overlooking Glen Tilt. The typical route to this munro winds through the glen, offering a journey filled with stunning natural beauty, making it an exceptionally rewarding hike. The scenic vistas and serene atmosphere of Glen Tilt enhance the overall experience, ensuring that the trek to Càrn a' Chlamain is both memorable and enjoyable.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-a-chlamain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.77450,-3.84325/"
  },
  {
    "id": "118",
    "name": "Carn a' Choire Bhoidheach",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1110,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3641,
    "summited": false,
    "lat": 56.945773,
    "lng": -3.272707,
    "link": "https://www.walkhighlands.co.uk/munros/carn-a-choire-bhoidheach",
    "description": "Càrn a' Choire Bhòidheach is situated at the heart of the expansive White Mounth plateau, offering a unique experience for munro baggers. The actual summit is a rather unremarkable rise, but just a short trek to the north lies the more striking Stuic. This minor peak is perched on the edge of two breathtaking corries, providing a dramatic contrast to the otherwise gentle landscape. The area is a blend of serene flatlands and rugged beauty, making it a must-visit for those seeking both tranquility and awe-inspiring views.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-a-choire-bhoidheach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.95250,-3.13640/"
  },
  {
    "id": "119",
    "name": "Carn a' Gheoidh",
    "extra": "",
    "area": "Cairngorms",
    "meters": 976,
    "section": "06B",
    "region": "06B: Pitlochry to Braemar & Blairgowrie",
    "feet": 3202,
    "summited": false,
    "lat": 56.873065,
    "lng": -3.466616,
    "link": "https://www.walkhighlands.co.uk/munros/carn-a-gheoidh",
    "description": "Càrn a' Ghèoidh is tucked away behind the more well-known Cairnwell Munros, providing a serene and secluded escape from the bustling ski developments that characterize its neighboring peaks. This hidden gem offers a tranquil retreat, allowing hikers to immerse themselves in the wild, unspoiled beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-a-gheoidh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.88680,-3.41490/"
  },
  {
    "id": "120",
    "name": "Carn a' Mhaim",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1037,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 3402,
    "summited": false,
    "lat": 57.036871,
    "lng": -3.658384,
    "link": "https://www.walkhighlands.co.uk/munros/carn-a-mhaim",
    "description": "Càrn a' Mhàim stands sentinel over the Lairig Ghru as you approach from Braemar. This Munro is connected to the formidable Ben Macdui by what is arguably the most slender ridge in the Cairngorms, offering an exhilarating traverse. The journey culminates in a challenging and steep ascent, rewarding climbers with the majestic summit of Ben Macdui. The route not only tests your endurance but also provides breathtaking views and a sense of accomplishment as you conquer one of Scotland's most iconic landscapes.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-a-mhaim-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.99000,-3.54430/"
  },
  {
    "id": "121",
    "name": "Carn an Fhidhleir",
    "extra": "Carn Ealar",
    "area": "Cairngorms",
    "meters": 994,
    "section": "06A",
    "region": "06A: Glen Tromie to Glen Tilt",
    "feet": 3261,
    "summited": false,
    "lat": 56.936029,
    "lng": -3.801535,
    "link": "https://www.walkhighlands.co.uk/munros/carn-an-fhidhleir-carn-ealar",
    "description": "Càrn an Fhìdhleir, while not the most visually striking Munro with its rounded and unassuming summit, offers a unique challenge due to its remote location. Nestled deep within an expansive, roadless wilderness, reaching this peak demands a significant effort. Adventurers can embark on their journey from Glen Feshie, Glen Tilt, or more commonly, the Linn of Dee. The latter route is particularly popular as it can be made more manageable with the use of a mountain bike, allowing for a more efficient and enjoyable approach through the rugged terrain.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-an-fhidhleir-carn-ealar-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.98940,-3.54350/"
  },
  {
    "id": "122",
    "name": "Carn an Righ",
    "extra": "",
    "area": "Perthshire",
    "meters": 1029,
    "section": "06B",
    "region": "06B: Pitlochry to Braemar & Blairgowrie",
    "feet": 3376,
    "summited": false,
    "lat": 56.876583,
    "lng": -3.595273,
    "link": "https://www.walkhighlands.co.uk/munros/carn-an-righ",
    "description": "Càrn an Rìgh stands as a prominent, steep-sided peak nestled in the central region of the Mounth. This majestic mountain is typically ascended from the southeast, with the journey beginning at the Spittal of Glenshee. The route offers a challenging yet rewarding experience, showcasing the rugged beauty and serene landscapes that characterize this part of Scotland.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-an-righ-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.81410,-3.46720/"
  },
  {
    "id": "123",
    "name": "Carn an t-Sagairt Mor",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1047,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3435,
    "summited": false,
    "lat": 56.942973,
    "lng": -3.303227,
    "link": "https://www.walkhighlands.co.uk/munros/carn-an-t-sagairt-mor",
    "description": "Càrn an t-Sagairt Mòr is situated on the expansive Mounth plateau, lying to the west of the renowned Lochnagar. The southern slopes of this munro are traversed by an ancient path that leads to the Lochnagar summit from Glen Callater, offering a historical route for hikers. The hill itself is characterized by its dome-like shape, and one of its most intriguing features is the scattered aircraft wreckage found to the north of the summit. This wreckage serves as a poignant reminder of the area's history and adds a unique point of interest for those who venture to its peak.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-an-t-sagairt-mor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.95250,-3.13640/"
  },
  {
    "id": "124",
    "name": "Carn an Tuirc",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1019,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3343,
    "summited": false,
    "lat": 56.908265,
    "lng": -3.357125,
    "link": "https://www.walkhighlands.co.uk/munros/carn-an-tuirc",
    "description": "Càrn an Tuirc is a rocky, dome-shaped peak, standing as one of the four Munros that rise above the eastern side of the Cairnwell Pass. The summits in this area are spread across a broad plateau, offering ample opportunities for hikers to plan various routes that encompass multiple peaks in a single adventure. The terrain and layout make it an ideal destination for those looking to experience the grandeur of the Scottish Highlands while tackling several Munros in one go.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-an-tuirc-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.90330,-3.40080/"
  },
  {
    "id": "125",
    "name": "Carn Aosda",
    "extra": "",
    "area": "Cairngorms",
    "meters": 915,
    "section": "06B",
    "region": "06B: Pitlochry to Braemar & Blairgowrie",
    "feet": 3003,
    "summited": false,
    "lat": 56.895696,
    "lng": -3.423274,
    "link": "https://www.walkhighlands.co.uk/munros/carn-aosda",
    "description": "Càrn Aosda stands out as one of the most accessible and swift Munros to ascend, making it an ideal choice for those seeking a brief yet rewarding climb. However, this ease of access is perhaps its most notable feature. The mountain's natural beauty has been significantly altered due to extensive development for skiing activities. Ski pistes, tow lifts, and access tracks crisscross its slopes, particularly above the Cairnwell Pass, detracting from its otherwise rugged charm. Despite this, Càrn Aosda offers a unique perspective on the balance between outdoor recreation and natural preservation.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-aosda-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.88680,-3.41490/"
  },
  {
    "id": "126",
    "name": "Carn Bhac",
    "extra": "",
    "area": "Cairngorms",
    "meters": 945,
    "section": "06B",
    "region": "06B: Pitlochry to Braemar & Blairgowrie",
    "feet": 3101,
    "summited": false,
    "lat": 56.930558,
    "lng": -3.560897,
    "link": "https://www.walkhighlands.co.uk/munros/carn-bhac",
    "description": "Càrn Bhac is a gently sloping mountain nestled in the remote wilderness of the Mounth, just south of Inverey. As one of the less frequented Munros, it provides a serene escape for those seeking solitude and reflection amidst the rugged beauty of the Scottish Highlands. The tranquility of this area makes it an ideal destination for hikers looking to immerse themselves in nature and enjoy a peaceful, unhurried adventure.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-bhac-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.98510,-3.50030/"
  },
  {
    "id": "127",
    "name": "Carn Dearg",
    "extra": "Loch Pattack",
    "area": "Cairngorms",
    "meters": 1034,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3392,
    "summited": false,
    "lat": 56.855242,
    "lng": -4.454693,
    "link": "https://www.walkhighlands.co.uk/munros/carn-dearg-loch-pattack",
    "description": "Càrn Dearg is a distinctive, wedge-shaped mountain that sprawls extensively above Culra Bothy, nestled deep within the Ben Alder forest. This expansive peak offers a unique and captivating landscape, making it a notable feature in the heart of this remote wilderness area.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-dearg-loch-pattack-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.85350,-4.42380/"
  },
  {
    "id": "128",
    "name": "Carn Dearg",
    "extra": "Corrour",
    "area": "Fort William",
    "meters": 941,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3087,
    "summited": false,
    "lat": 56.759931,
    "lng": -4.589888,
    "link": "https://www.walkhighlands.co.uk/munros/carn-dearg-corrour",
    "description": "Càrn Dearg is a secluded summit nestled between the expansive Rannoch Moor and the rugged Ben Alder range, towering above the serene waters of Loch Ossian. This munro offers a sense of isolation and tranquility, making it a rewarding challenge for avid hikers. Adventurers can embark on their journey to the peak from either Corrour or Rannoch stations, both conveniently located along the scenic West Highland railway line. The trek promises breathtaking vistas and a true sense of wilderness, perfect for those seeking to immerse themselves in the natural beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-dearg-corrour-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.76040,-4.69070/"
  },
  {
    "id": "129",
    "name": "Carn Dearg",
    "extra": "Monadhliath",
    "area": "Cairngorms",
    "meters": 946,
    "section": "09B",
    "region": "09B: Glen Albyn and the Monadh Liath",
    "feet": 3103,
    "summited": false,
    "lat": 57.092261,
    "lng": -4.253246,
    "link": "https://www.walkhighlands.co.uk/munros/carn-dearg-monadhliath",
    "description": "Càrn Dearg stands as the tallest peak within the Monadhliath range, perched on a relatively narrow ridge that extends southward from the central plateau, making it somewhat unique compared to the rest of the range. This Munro is often climbed in conjunction with its neighboring peaks to the east, offering a more comprehensive exploration of the area. The ascent provides a rewarding experience with varied terrain and stunning vistas, making it a favorite among avid hillwalkers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-dearg-monadhliath-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.07050,-4.15760/"
  },
  {
    "id": "130",
    "name": "Carn Eige",
    "extra": "",
    "area": "Loch Ness",
    "meters": 1183,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3881,
    "summited": false,
    "lat": 57.287701,
    "lng": -5.115159,
    "link": "https://www.walkhighlands.co.uk/munros/carn-eige",
    "description": "Càrn Eige stands as the tallest mountain north of the Great Glen, serving as the crowning jewel of the impressive range of peaks that line the northern side of the picturesque Glen Affric. This majestic summit is frequently ascended in tandem with its twin and close companion, Mam Sodhail, offering a rewarding challenge for avid munro baggers. The journey to the top of Càrn Eige not only provides a sense of accomplishment but also treats climbers to breathtaking vistas and a profound connection with the rugged beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-eige-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.27340,-4.96180/"
  },
  {
    "id": "131",
    "name": "Carn Ghluasaid",
    "extra": "",
    "area": "Kintail",
    "meters": 956,
    "section": "11B",
    "region": "11B: Glen Affric to Glen Moriston",
    "feet": 3137,
    "summited": false,
    "lat": 57.165959,
    "lng": -5.068159,
    "link": "https://www.walkhighlands.co.uk/munros/carn-ghluasaid",
    "description": "Càrn Ghluasaid can be accessed via a well-maintained stalkers' path originating from the northern shores of Loch Cluanie. On the opposite side, the mountain dramatically descends in a series of rugged crags into Coire Sgreumh. Although it stands as a Munro in its own right, Càrn Ghluasaid is essentially a minor subsidiary peak of the more prominent Sgùrr nan Conbhairean. If you approach from the direction of its parent peak, you'll find that the ascent involves less than 60 meters of climbing. This makes it a relatively straightforward addition for those already tackling Sgùrr nan Conbhairean.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-ghluasaid-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.14610,-5.06820/"
  },
  {
    "id": "132",
    "name": "Carn Gorm",
    "extra": "",
    "area": "Perthshire",
    "meters": 1030,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3378,
    "summited": false,
    "lat": 56.622537,
    "lng": -4.226021,
    "link": "https://www.walkhighlands.co.uk/munros/carn-gorm",
    "description": "Càrn Gorm is part of a quartet of Munros located on the northern side of Glen Lyon, often tackled as a collective challenge by hikers. The summit of Càrn Gorm features a wide, rounded dome that may lack dramatic features, but it compensates with impressive vistas overlooking the glen. The expansive views from the top provide a rewarding experience for those who make the ascent.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-gorm-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.60290,-4.19200/"
  },
  {
    "id": "133",
    "name": "Carn Liath",
    "extra": "Creag Meagaidh",
    "area": "Fort William",
    "meters": 1006,
    "section": "09C",
    "region": "09C: Loch Lochy to Loch Laggan",
    "feet": 3301,
    "summited": false,
    "lat": 56.978793,
    "lng": -4.515289,
    "link": "https://www.walkhighlands.co.uk/munros/carn-liath-creag-meagaidh",
    "description": "Càrn Liath, situated on the eastern fringes of the Creag Meagaidh range, presents itself as a somewhat expansive and unremarkable hill. While it may not boast the dramatic features of its neighboring peaks, its gentle slopes and broad expanse offer a unique charm. This hill, often overlooked by many, provides a serene and less challenging ascent, making it a peaceful retreat for those seeking a quieter Munro-bagging experience.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-liath-creag-meagaidh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.95210,-4.49592/"
  },
  {
    "id": "134",
    "name": "Carn Mairg",
    "extra": "",
    "area": "Perthshire",
    "meters": 1043,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3422,
    "summited": false,
    "lat": 56.634635,
    "lng": -4.145624,
    "link": "https://www.walkhighlands.co.uk/munros/carn-mairg",
    "description": "Càrn Mairg stands as the tallest peak in a quartet of Munros located on the northern side of Glen Lyon, just above the village of Invervar. Unlike its neighboring summits, Càrn Mairg is distinguished by its rugged crags and unique, recognizable shape. This mountain's striking features make it a notable landmark in the region, offering a more dramatic and picturesque ascent compared to the other Munros in the range.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-mairg-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.60290,-4.19200/"
  },
  {
    "id": "135",
    "name": "Carn Mor Dearg",
    "extra": "",
    "area": "Fort William",
    "meters": 1220,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 4003,
    "summited": false,
    "lat": 56.805246,
    "lng": -4.986616,
    "link": "https://www.walkhighlands.co.uk/munros/carn-mor-dearg",
    "description": "Càrn Mòr Dearg, despite being one of the tallest mountains in Britain, often finds itself in the shadow of the towering Ben Nevis. However, this majestic peak offers an unparalleled vantage point to take in the awe-inspiring North Face of Ben Nevis. The elegant summit of Càrn Mòr Dearg is perched atop a splendid ridge, which is famously connected to its colossal neighbor by the renowned Càrn Mòr Dearg Arête. This ridge walk is a favorite among hikers, providing both a thrilling challenge and breathtaking views.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-mor-dearg-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.84190,-5.04320/"
  },
  {
    "id": "136",
    "name": "Carn na Caim",
    "extra": "",
    "area": "Cairngorms",
    "meters": 941,
    "section": "05B",
    "region": "05B: Loch Ericht to Glen Tromie & Glen Garry",
    "feet": 3087,
    "summited": false,
    "lat": 56.911722,
    "lng": -4.174444,
    "link": "https://www.walkhighlands.co.uk/munros/carn-na-caim",
    "description": "Càrn na Caim stands as the more northerly of the two Munros that dominate the expansive plateau on the eastern flank of the Drumochter Pass. The journey to its summit can be quite boggy, requiring careful navigation through the wet terrain. However, the effort is well rewarded with panoramic views that surpass expectations, offering a stunning perspective of the surrounding landscape.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-na-caim2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/56.90890,-4.23660/"
  },
  {
    "id": "137",
    "name": "Carn nan Gobhar",
    "extra": "Strathfarrar",
    "area": "Loch Ness",
    "meters": 992,
    "section": "12A",
    "region": "12A: Kyle of Lochalsh to Garve",
    "feet": 3255,
    "summited": false,
    "lat": 57.452331,
    "lng": -4.879935,
    "link": "https://www.walkhighlands.co.uk/munros/carn-nan-gobhar-strathfarrar",
    "description": "Càrn nan Gobhar is a gently contoured peak situated along the northern Strathfarrar ridge. While the ascent is mostly straightforward, the summit itself is characterized by a challenging terrain of jagged, angular boulders that require careful navigation. From the top, hikers are rewarded with expansive and breathtaking views that stretch over the Beauly and Cromarty Firths, making the effort well worth it.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-nan-gobhar-strathfarrar-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.40560,-4.85910/"
  },
  {
    "id": "138",
    "name": "Carn nan Gobhar",
    "extra": "Loch Mullardoch",
    "area": "Loch Ness",
    "meters": 992,
    "section": "12B",
    "region": "12B: Killilan to Inverness",
    "feet": 3256,
    "summited": false,
    "lat": 57.363304,
    "lng": -5.024544,
    "link": "https://www.walkhighlands.co.uk/munros/carn-nan-gobhar-loch-mullardoch",
    "description": "Càrn nan Gobhar, one of two Munros sharing the same name and situated near each other, stands proudly between the serene Loch Mullardoch and the picturesque Glen Strathfarrar. This peak, with its gently rounded summit, may not boast the dramatic flair of its striking neighbor, Sgùrr na Lapaich, but it offers its own unique charm and a rewarding climb for those who venture its slopes. The landscape around Càrn nan Gobhar is a blend of rugged beauty and tranquil vistas, making it a delightful destination for Munro baggers seeking both challenge and serenity.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-nan-gobhar-loch-mullardoch-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.33990,-4.96150/"
  },
  {
    "id": "139",
    "name": "Carn Sgulain",
    "extra": "",
    "area": "Cairngorms",
    "meters": 920,
    "section": "09B",
    "region": "09B: Glen Albyn and the Monadh Liath",
    "feet": 3019,
    "summited": false,
    "lat": 57.124371,
    "lng": -4.176986,
    "link": "https://www.walkhighlands.co.uk/munros/carn-sgulain",
    "description": "Càrn Sgulain is often considered one of the less captivating Munros, characterized by its rather unremarkable, rounded summit within the Monadhliath range. It pales in comparison to its more striking neighbor, A' Chailleach. The terrain between the two peaks is interrupted by a steep, grassy gully, which adds a touch of challenge and can make the short trek to Càrn Sgulain feel somewhat tedious. Despite its lack of distinctive features, the journey to Càrn Sgulain offers a unique experience for those looking to explore the quieter corners of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/carn-sgulain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.07050,-4.15760/"
  },
  {
    "id": "140",
    "name": "Chno Dearg",
    "extra": "",
    "area": "Fort William",
    "meters": 1046,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3432,
    "summited": false,
    "lat": 56.830077,
    "lng": -4.66083,
    "link": "https://www.walkhighlands.co.uk/munros/chno-dearg",
    "description": "Chno Dearg, situated on the southern side of Glen Spean, is one of the more understated mountains in the region. Its gently rounded summit doesn't boast any particularly striking features, making it less visually dramatic compared to some of its neighboring peaks. However, its subtle charm and the serene landscape surrounding it offer a unique appeal to those who appreciate quieter, less rugged climbs.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/chno-dearg-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.86550,-4.70850/"
  },
  {
    "id": "141",
    "name": "Ciste Dhubh",
    "extra": "",
    "area": "Kintail",
    "meters": 981,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3219,
    "summited": false,
    "lat": 57.199234,
    "lng": -5.209032,
    "link": "https://www.walkhighlands.co.uk/munros/ciste-dhubh",
    "description": "Ciste Dhubh stands as a strikingly pointed summit, positioned a bit further back from the scenic areas of Cluanie and Glen Shiel. This peak is not only visually impressive but also boasts a unique and captivating character, making it a truly remarkable destination for any munro bagger. Its dramatic silhouette and distinctive features set it apart, offering an unforgettable experience for those who venture to its heights.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ciste-dhubh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.15960,-5.16470/"
  },
  {
    "id": "142",
    "name": "Cona' Mheall",
    "extra": "",
    "area": "Ullapool",
    "meters": 978,
    "section": "15A",
    "region": "15A: Loch Broom to Strath Oykel",
    "feet": 3209,
    "summited": false,
    "lat": 57.791077,
    "lng": -4.903418,
    "link": "https://www.walkhighlands.co.uk/munros/cona-mheall",
    "description": "Cona' Mheall is a striking, rocky ridge situated to the east of the prominent Beinn Dearg range. This impressive peak provides breathtaking vistas over the rugged and untamed landscape of Coire Ghrunnda. The stony terrain and elevated position make it a rewarding climb for those seeking both challenge and natural beauty.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/cona-mheall-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.81980,-5.06250/"
  },
  {
    "id": "143",
    "name": "Conival",
    "extra": "",
    "area": "Ullapool",
    "meters": 987,
    "section": "16E",
    "region": "16E: Scourie to Lairg",
    "feet": 3238,
    "summited": false,
    "lat": 58.135689,
    "lng": -4.883497,
    "link": "https://www.walkhighlands.co.uk/munros/conival",
    "description": "Conival, though visible from Inchnadamph, tends to be overshadowed by the more prominent lower peaks like Quinag. This mountain, formed from ancient Lewissian Gneiss, offers a challenging climb with its steep and rugged terrain. As you ascend, you'll be rewarded with breathtaking vistas of a surreal landscape filled with lochs and moors. A striking ridge links Conival to its taller neighbor, Ben More Assynt, providing an exhilarating route for adventurous hikers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/conival-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/58.14870,-4.97340/"
  },
  {
    "id": "144",
    "name": "Creag a'Mhaim",
    "extra": "",
    "area": "Kintail",
    "meters": 946,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3104,
    "summited": false,
    "lat": 57.120971,
    "lng": -5.160048,
    "link": "https://www.walkhighlands.co.uk/munros/creag-a-mhaim",
    "description": "Creag a'Mhàim stands as the eastern sentinel among the seven Munros that grace the South Cluanie ridge. Often the initial peak tackled by climbers, it serves as the gateway to this majestic range. While it may not boast the same dramatic allure as some of its more renowned neighbors further along the ridge, Creag a'Mhàim offers its own unique charm and a sense of accomplishment for those who begin their journey here. The ascent provides a wonderful introduction to the rugged beauty and challenging terrain that characterizes the South Cluanie ridge, setting the stage for the adventures that lie ahead.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/creag-a-mhaim-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.15600,-5.17815/"
  },
  {
    "id": "145",
    "name": "Creag Leacach",
    "extra": "",
    "area": "Cairngorms",
    "meters": 988,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3242,
    "summited": false,
    "lat": 56.85464,
    "lng": -3.387768,
    "link": "https://www.walkhighlands.co.uk/munros/creag-leacach",
    "description": "Creag Leacach is a rugged, rocky peak that stands out dramatically above the Devil's Elbow on the ascent through the Cairnwell Pass. Typically, this Munro is climbed as part of a circuit that includes the four Munros located on the eastern side of the pass. However, for those seeking a more scenic and perhaps less trodden path, we also recommend an alternative and equally rewarding route that begins in the picturesque Glen Isla. This alternative approach offers a unique perspective and a chance to experience the serene beauty of the surrounding landscape.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/creag-leacach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.90330,-3.40080/"
  },
  {
    "id": "146",
    "name": "Creag Meagaidh",
    "extra": "",
    "area": "Fort William",
    "meters": 1128,
    "section": "09C",
    "region": "09C: Loch Lochy to Loch Laggan",
    "feet": 3701,
    "summited": false,
    "lat": 56.952023,
    "lng": -4.602117,
    "link": "https://www.walkhighlands.co.uk/munros/creag-meagaidh",
    "description": "Creag Meagaidh stands as an expansive plateau and ranks among the loftier peaks of the central Highlands. It is often easily identifiable from a distance, thanks to the unique and striking feature known as the Window. This mountain is particularly renowned for the breathtaking Coire Àrdair, which is a prime destination for ice-climbers, second in popularity only to the legendary Ben Nevis. The rugged beauty and challenging terrain of Creag Meagaidh make it a must-visit for outdoor enthusiasts and adventurers alike.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/creag-meagaidh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.95210,-4.49592/"
  },
  {
    "id": "147",
    "name": "Creag Mhor",
    "extra": "Glen Lochay",
    "area": "Perthshire",
    "meters": 1047,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3434,
    "summited": false,
    "lat": 56.489519,
    "lng": -4.614038,
    "link": "https://www.walkhighlands.co.uk/munros/creag-mhor-glen-lochay",
    "description": "Creag Mhòr stands majestically at the head of Glen Lochay, presenting a strikingly steep-sided ridge that beckons adventurers. The ascent is made more accessible thanks to a hydro track that traverses the side of the glen, offering a convenient route for climbers. This rugged terrain, combined with the breathtaking views, makes Creag Mhòr a rewarding challenge for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/creag-mhor-glen-lochay-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.49910,-4.47590/"
  },
  {
    "id": "148",
    "name": "Creag nan Damh",
    "extra": "",
    "area": "Kintail",
    "meters": 917,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3009,
    "summited": false,
    "lat": 57.147262,
    "lng": -5.33496,
    "link": "https://www.walkhighlands.co.uk/munros/creag-nan-damh",
    "description": "Creag nan Dàmh stands as the concluding summit on the illustrious South Glen Shiel Ridge. Although it barely meets the criteria to be classified as a Munro, this peak holds its own unique charm. When compared to some of its more imposing neighbors, Creag nan Dàmh might seem modest, yet it offers a rewarding experience for those who venture to its heights. The journey to its summit provides a sense of accomplishment and a chance to appreciate the diverse landscape of the ridge.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/creag-nan-damh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.15600,-5.17815/"
  },
  {
    "id": "149",
    "name": "Creag Pitridh",
    "extra": "",
    "area": "Fort William",
    "meters": 925,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3033,
    "summited": false,
    "lat": 56.899712,
    "lng": -4.484972,
    "link": "https://www.walkhighlands.co.uk/munros/creag-pitridh",
    "description": "This relatively small Munro may be overshadowed by its taller neighbors, Geal Chàrn and Beinn a' Chlachair, but incorporating it into your hike with these peaks demands minimal additional effort. Despite its modest stature, its elevated position overlooking Lochan na h-Earba offers breathtaking panoramic views, making it a truly rewarding vantage point.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/creag-pitridh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.91220,-4.57556/"
  },
  {
    "id": "150",
    "name": "Creise",
    "extra": "",
    "area": "Fort William",
    "meters": 1100,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3608,
    "summited": false,
    "lat": 56.614448,
    "lng": -4.871987,
    "link": "https://www.walkhighlands.co.uk/munros/creise",
    "description": "Creise stands as the central peak and highest point of an impressive ridge that extends from Clach Leathad—once considered the true summit—to the dramatic, steep face of Sron na Creise. This ridge offers a striking and picturesque feature of the mountain, particularly evident in photographs. The journey along this ridge provides a rewarding experience for hikers, with panoramic views and a sense of accomplishment upon reaching the summit. The rugged terrain and natural beauty make Creise a memorable highlight for any munro bagger exploring the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/creise-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.63240,-4.82790/"
  },
  {
    "id": "151",
    "name": "Cruach Ardrain",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 1046,
    "section": "01C",
    "region": "01C: Loch Lomond to Strathyre",
    "feet": 3431,
    "summited": false,
    "lat": 56.356438,
    "lng": -4.576152,
    "link": "https://www.walkhighlands.co.uk/munros/cruach-ardrain",
    "description": "Cruach Àrdrain is a prominent and steep mountain that ascends to the south of Crianlarich, its unique silhouette making it a recognizable landmark from numerous vantage points on nearby hills. This striking peak can also be tackled in conjunction with its neighboring summit, Beinn Tulaichean, when approached from the southern side. The ascent offers a rewarding challenge for hillwalkers, with panoramic views that capture the rugged beauty of the surrounding landscape.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/cruach-ardrain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.33300,-4.51570/"
  },
  {
    "id": "152",
    "name": "Derry Cairngorm",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1155,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 3789,
    "summited": false,
    "lat": 57.062801,
    "lng": -3.622004,
    "link": "https://www.walkhighlands.co.uk/munros/derry-cairngorm",
    "description": "Derry Cairngorm is frequently confused with Ben Macdui when viewed from Deeside, as its impressive summit cone towers above the surrounding foothills. This majestic peak offers one of the finest vantage points for observing Ben Macdui, which can be seen looming above the magnificent Coire Uaine. The panoramic views from Derry Cairngorm are truly breathtaking, making it a must-visit for any avid hillwalker or nature enthusiast.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/derry-cairngorm-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.99000,-3.54430/"
  },
  {
    "id": "153",
    "name": "Driesh",
    "extra": "",
    "area": "Angus",
    "meters": 948,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3109,
    "summited": false,
    "lat": 56.848003,
    "lng": -3.196539,
    "link": "https://www.walkhighlands.co.uk/munros/driesh",
    "description": "For the locals of Dundee, Driesh stands out as one of the most familiar and frequently ascended Munros. This mountain ascends sharply from Glen Doll, situated in the upper reaches of Glen Clova. However, once you reach the summit, you'll find that the terrain becomes more rounded and less imposing, offering a gentler landscape compared to its steep approach.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/driesh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.87040,-3.17584/"
  },
  {
    "id": "154",
    "name": "Druim Shionnach",
    "extra": "",
    "area": "Kintail",
    "meters": 985,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3232,
    "summited": false,
    "lat": 57.126794,
    "lng": -5.182841,
    "link": "https://www.walkhighlands.co.uk/munros/druim-shionnach",
    "description": "Druim Shionnach stands as the second Munro along the South Glen Shiel Ridge, offering a captivating challenge for avid hikers. This section of the ridge is notably narrow, adding an element of excitement to the journey. As you approach from the east, you'll encounter a bit of scrambling, which adds a touch of adventure to the ascent. The panoramic views from the summit make the effort well worth it, providing a rewarding experience for those who take on this part of the traverse.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/druim-shionnach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.15600,-5.17815/"
  },
  {
    "id": "155",
    "name": "Eididh nan Clach Geala",
    "extra": "",
    "area": "Ullapool",
    "meters": 927,
    "section": "15A",
    "region": "15A: Loch Broom to Strath Oykel",
    "feet": 3041,
    "summited": false,
    "lat": 57.813492,
    "lng": -4.934218,
    "link": "https://www.walkhighlands.co.uk/munros/eididh-nan-clach-geala",
    "description": "Eididh nan Clach Geala ascends sharply from the shores of Lochan a' Chnapaich, presenting a dramatic rise that captures the eye. In contrast, its other slopes descend more gently, offering a less daunting approach. From its summit, hikers are rewarded with breathtaking vistas stretching northwest, where the unique silhouettes of Assynt's mountains and the picturesque Summer Isles dominate the horizon. The panoramic views from this munro are truly spectacular, making it a must-visit for any avid hillwalker.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/eididh-nan-clach-geala-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.81980,-5.06250/"
  },
  {
    "id": "156",
    "name": "Fionn Bheinn",
    "extra": "",
    "area": "Torridon",
    "meters": 933,
    "section": "14B",
    "region": "14B: The Fannaichs",
    "feet": 3061,
    "summited": false,
    "lat": 57.611148,
    "lng": -5.102696,
    "link": "https://www.walkhighlands.co.uk/munros/fionn-bheinn",
    "description": "Fionn Bheinn, though technically part of the Fannich range, stands apart from its neighboring peaks and is most commonly ascended from the village of Achnasheen. This mountain, characterized by its rounded shape, rewards climbers with stunning vistas of the majestic Torridon giants in the vicinity. Despite its isolation, Fionn Bheinn provides a unique and memorable experience for those who venture to its summit.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/fionn-bheinn-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.57930,-5.07340/"
  },
  {
    "id": "157",
    "name": "Gairich",
    "extra": "",
    "area": "Fort William",
    "meters": 919,
    "section": "10B",
    "region": "10B: Knoydart to Glen Kingie",
    "feet": 3015,
    "summited": false,
    "lat": 57.044879,
    "lng": -5.255827,
    "link": "https://www.walkhighlands.co.uk/munros/gairich",
    "description": "Gairich stands as a prominent and solitary Munro located on the southern shores of Loch Quoich. This mountain is most commonly ascended starting from the Loch Quoich Dam, offering an enjoyable and rewarding hike. The journey to its summit provides a memorable adventure, with stunning views and a sense of tranquility that makes the effort well worth it.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/gairich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.07190,-5.18770/"
  },
  {
    "id": "158",
    "name": "Garbh Chioch Mhor",
    "extra": "",
    "area": "Fort William",
    "meters": 1013,
    "section": "10B",
    "region": "10B: Knoydart to Glen Kingie",
    "feet": 3323,
    "summited": false,
    "lat": 57.008556,
    "lng": -5.444322,
    "link": "https://www.walkhighlands.co.uk/munros/garbh-chioch-mhor",
    "description": "Garbh Chioch Mhòr is a rugged and jagged ridge that exudes a wild and untamed charm, situated on the periphery of the remote Knoydart region. This formidable terrain is typically crossed by hikers making their way to the even more impressive, cone-shaped summit of Sgùrr na Cìche. The journey across Garbh Chioch Mhòr offers a challenging yet rewarding experience, with its dramatic landscape and breathtaking views providing a memorable adventure for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/garbh-chioch-mhor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.97190,-5.31230/"
  },
  {
    "id": "159",
    "name": "Geal Charn",
    "extra": "",
    "area": "Fort William",
    "meters": 1050,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3444,
    "summited": false,
    "lat": 56.897763,
    "lng": -4.457236,
    "link": "https://www.walkhighlands.co.uk/munros/geal-charn",
    "description": "Geal Chàrn is an expansive and sprawling peak within the Beinn a' Chlachair range. One of its most striking characteristics is the summit, which is adorned with an impressive cairn and a cylindrical trig point perched atop a charming, graceful cone. The mountain's broad slopes and varied terrain make it a fascinating destination for those seeking to explore the natural beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/geal-charn-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.91220,-4.57556/"
  },
  {
    "id": "160",
    "name": "Geal Charn",
    "extra": "Monadhliath",
    "area": "Cairngorms",
    "meters": 926,
    "section": "09B",
    "region": "09B: Glen Albyn and the Monadh Liath",
    "feet": 3038,
    "summited": false,
    "lat": 57.057418,
    "lng": -4.373572,
    "link": "https://www.walkhighlands.co.uk/munros/geal-charn-monadhliath",
    "description": "Geal Chàrn stands apart from the other Munros in the Monadhliath range, isolated by expansive stretches of undulating moorland and boggy terrain. This mountain is typically ascended solo, with popular starting points being Garva Bridge or the Spey Dam. The journey to its summit offers a true sense of remoteness and solitude, as hikers traverse the vast, open landscape that characterizes this part of the Highlands. The climb, though challenging due to the terrain, rewards adventurers with sweeping views and a profound connection to the wild beauty of Scotland.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/geal-charn-monadhliath-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.01990,-4.43590/"
  },
  {
    "id": "161",
    "name": "Geal-charn",
    "extra": "Alder",
    "area": "Cairngorms",
    "meters": 1132,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3714,
    "summited": false,
    "lat": 56.837836,
    "lng": -4.509694,
    "link": "https://www.walkhighlands.co.uk/munros/geal-charn-alder",
    "description": "This particular Geal Chàrn stands as the tallest among several Munros sharing the same name. Nestled in a secluded location, it occupies a central position on an impressive ridge that stretches between the majestic Ben Alder and the scenic Loch Laggan region. One of its most striking characteristics is the Lancet Edge, a breathtakingly dramatic ridge that plunges steeply down to Culra, offering a thrilling experience for adventurous climbers. The remote nature of this peak adds to its allure, making it a rewarding challenge for those who seek solitude and stunning landscapes in the heart of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/geal-charn-alder-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.85350,-4.42380/"
  },
  {
    "id": "162",
    "name": "Geal-charn",
    "extra": "Drumochter",
    "area": "Cairngorms",
    "meters": 917,
    "section": "05A",
    "region": "05A: Loch Ericht to Glen Tromie & Glen Garry",
    "feet": 3009,
    "summited": false,
    "lat": 56.874433,
    "lng": -4.304519,
    "link": "https://www.walkhighlands.co.uk/munros/geal-charn-drumochter",
    "description": "There are multiple Geal Chàrns in Scotland, but this particular one is situated on the northern side of the Drumochter Pass. Characterized by its rounded dome shape, it offers a relatively quick ascent starting from Balsporran Cottages. Historically, the route to its summit was marked by a series of very prominent cairns, which were located a short distance from the peak. This munro provides a rewarding climb with scenic views, making it a popular choice for hillwalkers looking for a manageable yet satisfying challenge.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/geal-charn-drumochter2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/56.88350,-4.25360/"
  },
  {
    "id": "163",
    "name": "Glas Bheinn Mhor",
    "extra": "",
    "area": "Fort William",
    "meters": 998,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3273,
    "summited": false,
    "lat": 56.542434,
    "lng": -5.005252,
    "link": "https://www.walkhighlands.co.uk/munros/glas-bheinn-mhor",
    "description": "Glas Bheinn Mhòr stands as a prominent peak located to the east of the imposing Ben Starav, nestled within the mountain range on the southern side of Glen Etive. This summit offers a striking contrast to its towering neighbor, providing a unique and rewarding challenge for munro baggers. The ascent of Glas Bheinn Mhòr promises breathtaking views and a sense of accomplishment, making it a must-visit for those exploring the scenic beauty of Glen Etive's southern highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/glas-bheinn-mhor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.57620,-5.03566/"
  },
  {
    "id": "164",
    "name": "Glas Maol",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1068,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3503,
    "summited": false,
    "lat": 56.873059,
    "lng": -3.368236,
    "link": "https://www.walkhighlands.co.uk/munros/glas-maol",
    "description": "Glas Maol stands as the tallest peak among a quartet of Munros located to the east of the Cairnwell Pass. This area has been adapted for skiing, making it a popular destination for winter sports enthusiasts. The nearby road provides a convenient high-altitude starting point, simplifying the climb up these gently sloping summits. However, for those seeking a more scenic and rewarding trek, the alternative route from Glen Isla via Monega Hill offers a superior hiking experience. This path meanders through picturesque landscapes, adding an extra layer of enjoyment to the journey.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/glas-maol-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.90330,-3.40080/"
  },
  {
    "id": "165",
    "name": "Glas Tulaichean",
    "extra": "",
    "area": "Perthshire",
    "meters": 1051,
    "section": "06B",
    "region": "06B: Pitlochry to Braemar & Blairgowrie",
    "feet": 3448,
    "summited": false,
    "lat": 56.865757,
    "lng": -3.558163,
    "link": "https://www.walkhighlands.co.uk/munros/glas-tulaichean",
    "description": "Glas Tulaichean is a prominent, dome-shaped peak that is typically ascended starting from the Spittal of Glenshee. Hikers will find that a landrover track extends nearly to the very top, making the journey more accessible. Interestingly, the lower slopes of this mountain were historically reached via a private railway, adding a touch of historical intrigue to your adventure. The expansive views from the summit and the relatively straightforward path make Glas Tulaichean a rewarding climb for both seasoned and novice munro baggers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/glas-tulaichean-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.81410,-3.46720/"
  },
  {
    "id": "166",
    "name": "Gleouraich",
    "extra": "",
    "area": "Fort William",
    "meters": 1035,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3396,
    "summited": false,
    "lat": 57.097163,
    "lng": -5.238035,
    "link": "https://www.walkhighlands.co.uk/munros/gleouraich",
    "description": "Gleouraich stands as an impressive peak on the northern shores of Loch Quioch, offering a striking presence in the landscape. This mountain is renowned for its majestic corries and forms a key part of an exceptional ridge walk that attracts many outdoor enthusiasts. One of the most captivating aspects of Gleouraich is the remarkable stalkers' path that ascends its southwest ridge, providing a unique and memorable route for hikers. The path not only offers a challenging climb but also rewards adventurers with breathtaking views and a sense of connection to the area's rich history of stalking and land management.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/gleouraich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.07570,-5.25320/"
  },
  {
    "id": "167",
    "name": "Gulvain",
    "extra": "",
    "area": "Fort William",
    "meters": 987,
    "section": "10D",
    "region": "10D: Mallaig to Fort William",
    "feet": 3238,
    "summited": false,
    "lat": 56.936211,
    "lng": -5.284527,
    "link": "https://www.walkhighlands.co.uk/munros/gulvain",
    "description": "Gulvain stands as an impressive and secluded mountain, boasting two distinct summits. It is the tallest peak in the rugged and untamed region nestled between Loch Eil and Loch Arkaig. This majestic mountain offers a sense of isolation and tranquility, making it a rewarding challenge for those who seek adventure in Scotland's wild landscapes. The journey to its summit promises breathtaking views and a true sense of accomplishment for any dedicated munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/gulvain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.85970,-5.34900/"
  },
  {
    "id": "168",
    "name": "Ladhar Bheinn",
    "extra": "",
    "area": "Fort William",
    "meters": 1020,
    "section": "10B",
    "region": "10B: Knoydart to Glen Kingie",
    "feet": 3346,
    "summited": false,
    "lat": 57.075263,
    "lng": -5.591745,
    "link": "https://www.walkhighlands.co.uk/munros/ladhar-bheinn",
    "description": "Nestled in the heart of the untamed Knoydart peninsula, Ladhar Bheinn often necessitates an overnight adventure to fully appreciate its splendor. This mountain stands as a truly awe-inspiring peak, perfectly situated along one of the most breathtaking stretches of the West Highlands coastline. With its striking ridges, numerous summits, and an impressive corrie, Ladhar Bheinn offers an unforgettable experience for any munro bagger. The journey to its summit is as rewarding as the views it provides, making it a must-visit for those seeking both challenge and beauty in the Scottish wilderness.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ladhar-bheinn-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.03860,-5.68540/"
  },
  {
    "id": "169",
    "name": "Mullach an Rathain",
    "extra": "Liathach",
    "area": "Torridon",
    "meters": 1024,
    "section": "13A",
    "region": "13A: Loch Torridon to Loch Maree",
    "feet": 3359,
    "summited": false,
    "lat": 57.560875,
    "lng": -5.492498,
    "link": "https://www.walkhighlands.co.uk/munros/mullach-an-rathain-liathach",
    "description": "Mullach an Rathain stands as the westernmost peak among the two Munros gracing the majestic ridge of Liathach, which is celebrated as one of the most spectacular in the Highlands. Ascending its notably steep inclines is a challenging endeavor, but those who reach the summit are rewarded with breathtaking vistas that stretch down to Loch Torridon and extend out towards the sea. The panoramic views from this vantage point are truly awe-inspiring, making the effort well worth it for any dedicated Munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/mullach-an-rathain-liathach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.55270,-5.45160/"
  },
  {
    "id": "170",
    "name": "Spidean a'Choire Leith",
    "extra": "Liathach",
    "area": "Torridon",
    "meters": 1055,
    "section": "13A",
    "region": "13A: Loch Torridon to Loch Maree",
    "feet": 3461,
    "summited": false,
    "lat": 57.564197,
    "lng": -5.463609,
    "link": "https://www.walkhighlands.co.uk/munros/spidean-a-choire-leith-liathach",
    "description": "Spidean a' Choire Lèith stands as the crowning peak of the formidable Liathach range. This mountain is renowned for its imposing cliffs and rugged buttresses, which make it a challenging ascent. There are only a handful of routes to the top, each characterized by steep, scrambly terrain that demands both skill and determination. The ridgeline extending from either side of the summit offers breathtaking views and an exhilarating experience for those who venture along its path.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/spidean-a-choire-leith-liathach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.55270,-5.45160/"
  },
  {
    "id": "171",
    "name": "Lochnagar",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1156,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3792,
    "summited": false,
    "lat": 56.960272,
    "lng": -3.245261,
    "link": "https://www.walkhighlands.co.uk/munros/lochnagar",
    "description": "Lochnagar stands as one of the most renowned Munros, its sharp peak towering majestically above one of Scotland's most picturesque corries. This mountain has not only captured the admiration of hikers and climbers but also inspired literary greats. Lord Byron immortalized Lochnagar in his poetry, concluding with these evocative lines: \"England thy beauties are tame and domestic, To one who has roved on the mountains afar. Oh! For the crags that are wild and majestic, The steep frowning glories of dark Lochnagar.\" The rugged beauty and dramatic landscape of Lochnagar continue to captivate all who venture into its shadow, offering a blend of natural splendor and cultural heritage that is truly unparalleled.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/lochnagar-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.95250,-3.13640/"
  },
  {
    "id": "172",
    "name": "Luinne Bheinn",
    "extra": "",
    "area": "Fort William",
    "meters": 939,
    "section": "10B",
    "region": "10B: Knoydart to Glen Kingie",
    "feet": 3081,
    "summited": false,
    "lat": 57.048325,
    "lng": -5.513607,
    "link": "https://www.walkhighlands.co.uk/munros/luinne-bheinn",
    "description": "Luinne Bheinn, often humorously referred to by those less familiar with Gaelic as \"Loony Bin,\" is a rugged and rocky peak nestled in the heart of the Knoydart peninsula. This mountain offers a challenging climb, but the effort is well rewarded with breathtaking panoramic views. The terrain is notably rough, making it a true adventure for avid hikers seeking both a physical challenge and the serene beauty of Scotland's wild landscapes.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/luinne-bheinn-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.03860,-5.68540/"
  },
  {
    "id": "173",
    "name": "Lurg Mhor",
    "extra": "",
    "area": "Torridon",
    "meters": 987,
    "section": "12A",
    "region": "12A: Kyle of Lochalsh to Garve",
    "feet": 3238,
    "summited": false,
    "lat": 57.413091,
    "lng": -5.223666,
    "link": "https://www.walkhighlands.co.uk/munros/lurg-mhor",
    "description": "Lurg Mhòr stands as one of the most isolated Munros in all of Scotland. While it may not boast the imposing presence of its nearby counterpart, Bidean a' Choire Sheasgaich, it more than compensates with its untamed and rugged ambiance. When viewed from the east, Lurg Mhòr presents a striking and majestic silhouette, embodying the wild spirit of the Scottish Highlands. Its remote location ensures a sense of solitude and adventure for those who venture to its heights.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/lurg-mhor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.39150,-5.45534/"
  },
  {
    "id": "174",
    "name": "Mam Sodhail",
    "extra": "",
    "area": "Loch Ness",
    "meters": 1179,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3869,
    "summited": false,
    "lat": 57.279801,
    "lng": -5.120267,
    "link": "https://www.walkhighlands.co.uk/munros/mam-sodhail",
    "description": "Màm Sodhail stands as a majestic twin to its neighboring peak, Càrn Eige, both of which are the tallest summits north of the Great Glen. This impressive mountain is graced with elegant ridges that soar high above the picturesque shores of Loch Affric, offering breathtaking views and a sense of serene isolation. The rugged terrain and stunning landscapes make Màm Sodhail a must-visit for any avid munro bagger seeking both challenge and beauty in the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/mam-sodhail-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.27340,-4.96180/"
  },
  {
    "id": "175",
    "name": "Maoile Lunndaidh",
    "extra": "",
    "area": "Torridon",
    "meters": 1005,
    "section": "12A",
    "region": "12A: Kyle of Lochalsh to Garve",
    "feet": 3297,
    "summited": false,
    "lat": 57.464477,
    "lng": -5.111002,
    "link": "https://www.walkhighlands.co.uk/munros/maoile-lunndaidh",
    "description": "Maoile Lunndaidh is an exceptionally secluded mountain located at the head of Loch Monar, though the most common ascent route begins from Glencarron. This mountain features an expansive plateau adorned with several steep and dramatic corries. Recently, Creag Toll a' Choin has been re-evaluated and identified as the highest summit of the mountain. However, the route recommended by Walkhighlands traverses both summits, offering a comprehensive exploration of this remote and rugged landscape.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/maoile-lunndaidh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.49140,-5.27220/"
  },
  {
    "id": "176",
    "name": "Maol Chean-dearg",
    "extra": "",
    "area": "Torridon",
    "meters": 933,
    "section": "13B",
    "region": "13B: Applecross to Achnasheen",
    "feet": 3061,
    "summited": false,
    "lat": 57.491697,
    "lng": -5.465549,
    "link": "https://www.walkhighlands.co.uk/munros/maol-chean-dearg",
    "description": "Maol Chean-dearg stands as a striking, steeply inclined dome composed of Torridonian sandstone, nestled within the enchanting Coulin Forest, situated between the regions of Torridon and Strathcarron. Its northern face dramatically descends in sheer cliffs to a serene lochan below, offering an awe-inspiring panorama of the majestic Torridon peaks. This mountain's rugged beauty and imposing presence make it a must-visit for any avid munro bagger exploring the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/maol-chean-dearg-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.44980,-5.40744/"
  },
  {
    "id": "177",
    "name": "Maol Chinn-dearg",
    "extra": "",
    "area": "Kintail",
    "meters": 980,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3216,
    "summited": false,
    "lat": 57.12756,
    "lng": -5.252651,
    "link": "https://www.walkhighlands.co.uk/munros/maol-chinn-dearg",
    "description": "Maol Chinn-dearg stands as one of the seven majestic Munros gracing the South Cluanie Ridge. This peak is renowned for its sweeping vistas and the sense of accomplishment it offers to those who reach its summit. The extensive ridge extending to the northeast provides a scenic and somewhat less challenging descent into the glen, making it a favored route for many hikers seeking both adventure and tranquility. The journey along this ridge not only tests your endurance but also rewards you with breathtaking landscapes and a profound connection to the natural beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/maol-chinn-dearg-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.15600,-5.17815/"
  },
  {
    "id": "178",
    "name": "Mayar",
    "extra": "",
    "area": "Angus",
    "meters": 929,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3047,
    "summited": false,
    "lat": 56.848936,
    "lng": -3.246316,
    "link": "https://www.walkhighlands.co.uk/munros/mayar",
    "description": "Mayar is a rounded peak situated on the southern edge of the Angus/Mounth plateau. This munro is often climbed in conjunction with its close companion, Driesh, offering a rewarding dual ascent for hillwalkers. The gentle slopes and expansive views make Mayar a popular choice for those looking to explore the scenic beauty of this part of Scotland.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/mayar-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.87040,-3.17584/"
  },
  {
    "id": "179",
    "name": "Meall a' Bhuiridh",
    "extra": "",
    "area": "Fort William",
    "meters": 1108,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3635,
    "summited": false,
    "lat": 56.612216,
    "lng": -4.852159,
    "link": "https://www.walkhighlands.co.uk/munros/meall-a-bhuiridh",
    "description": "Meall a' Bhùiridh stands as the tallest peak within the Black Mount range, offering a commanding presence on the periphery of Rannoch Moor. This location provides hikers with breathtaking panoramic views that are truly unparalleled. While the ascent promises a sense of untamed wilderness, this feeling is somewhat diminished by the presence of ski-tows that extend nearly to the summit. Despite this, the journey to the top remains a rewarding experience, blending natural beauty with a touch of modern convenience.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-a-bhuiridh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.63240,-4.82790/"
  },
  {
    "id": "180",
    "name": "Meall a' Choire Leith",
    "extra": "",
    "area": "Perthshire",
    "meters": 926,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3037,
    "summited": false,
    "lat": 56.566312,
    "lng": -4.259617,
    "link": "https://www.walkhighlands.co.uk/munros/meall-a-choire-leith",
    "description": "Meall a' Choire Lèith stands as a more secluded member of the Ben Lawers range. Characterized by its expansive, flat-topped dome, it lacks the striking features that make some of its neighboring peaks more memorable. Despite its less distinctive appearance, it offers a unique and serene experience for those who venture to its summit.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-a-choire-leith-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.54530,-4.28936/"
  },
  {
    "id": "181",
    "name": "Meall a' Chrasgaidh",
    "extra": "",
    "area": "Ullapool",
    "meters": 934,
    "section": "14B",
    "region": "14B: The Fannaichs",
    "feet": 3064,
    "summited": false,
    "lat": 57.712866,
    "lng": -5.048742,
    "link": "https://www.walkhighlands.co.uk/munros/meall-a-chrasgaidh",
    "description": "Meall a' Chrasgaidh is a modest, gently rounded peak situated just off the ridge that connects Sgùrr Mòr and Sgùrr nan Clach Geala. This unassuming summit is characterized by its lack of distinctive features, making it easily overshadowed by its more prominent and celebrated neighboring mountains. Despite its understated presence, Meall a' Chrasgaidh offers a serene and less frequented experience for those who venture to its heights, providing a peaceful contrast to the grandeur of its surroundings.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-a-chrasgaidh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.73730,-5.09000/"
  },
  {
    "id": "182",
    "name": "Meall Buidhe",
    "extra": "Glen Lyon",
    "area": "Perthshire",
    "meters": 932,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3058,
    "summited": false,
    "lat": 56.617231,
    "lng": -4.448608,
    "link": "https://www.walkhighlands.co.uk/munros/meall-buidhe-glen-lyon",
    "description": "Meall Buidhe stretches as a north-south ridge amidst expansive moorlands, offering a serene yet striking landscape. The eastern side is graced by the Glas Choire, which adds a touch of rugged charm to the otherwise gentle terrain. For those seeking a relatively straightforward and swift ascent, Meall Buidhe is an ideal choice, especially when starting from the picturesque Loch an Dàmh. The journey provides a delightful blend of ease and scenic beauty, making it a favorite among Munro baggers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-buidhe-glen-lyon-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.58580,-4.42486/"
  },
  {
    "id": "183",
    "name": "Meall Buidhe",
    "extra": "Knoydart",
    "area": "Fort William",
    "meters": 946,
    "section": "10B",
    "region": "10B: Knoydart to Glen Kingie",
    "feet": 3104,
    "summited": false,
    "lat": 57.031543,
    "lng": -5.546333,
    "link": "https://www.walkhighlands.co.uk/munros/meall-buidhe-knoydart",
    "description": "Meall Buidhe stands as a rugged and rocky sentinel, one of the trio of majestic Munros gracing the Knoydart peninsula. No matter which path you decide to take, the climb demands a significant amount of determination and stamina. The journey to its summit is challenging, but the breathtaking views and sense of accomplishment make every step worthwhile.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-buidhe-knoydart-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.03860,-5.68540/"
  },
  {
    "id": "184",
    "name": "Meall Chuaich",
    "extra": "",
    "area": "Cairngorms",
    "meters": 951,
    "section": "05B",
    "region": "05B: Loch Ericht to Glen Tromie & Glen Garry",
    "feet": 3119,
    "summited": false,
    "lat": 56.96385,
    "lng": -4.112568,
    "link": "https://www.walkhighlands.co.uk/munros/meall-chuaich",
    "description": "Nestled discreetly within a glen near Dalwhinnie, this unassuming hill provides one of the more accessible and less time-consuming climbs among the Munros. The typical route begins by navigating through areas associated with a hydro-electric project, leading to a gradual ascent up a wide, rounded slope. Despite its modest appearance, the hill's location affords hikers stunning panoramic views over the Badenoch region, making the journey well worth the effort.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-chuaich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.95120,-4.21480/"
  },
  {
    "id": "185",
    "name": "Meall Corranaich",
    "extra": "",
    "area": "Perthshire",
    "meters": 1069,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3507,
    "summited": false,
    "lat": 56.540955,
    "lng": -4.25347,
    "link": "https://www.walkhighlands.co.uk/munros/meall-corranaich",
    "description": "Meall Corranaich, nestled within the majestic Ben Lawers range, is a prominent peak that is easily visible from the Lawers visitor centre. While adventurous climbers can tackle its steep ridge directly from the centre, the more common route begins from the northwest. This approach starts at the summit of the pass, offering a slightly gentler ascent. The journey to the top of Meall Corranaich rewards hikers with breathtaking views and a sense of accomplishment as they conquer one of Scotland's renowned Munros.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-corranaich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.54530,-4.28936/"
  },
  {
    "id": "186",
    "name": "Meall Garbh",
    "extra": "Carn Mairg",
    "area": "Perthshire",
    "meters": 968,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3174,
    "summited": false,
    "lat": 56.637381,
    "lng": -4.207472,
    "link": "https://www.walkhighlands.co.uk/munros/meall-garbh-carn-mairg",
    "description": "Meall Garbh is part of a quartet of rounded Munros situated on the northern side of Glen Lyon. Typically, hikers tackle this peak in conjunction with its neighboring summits. While it may not boast a particularly striking or unique shape, it offers a rewarding experience for those who appreciate the subtle beauty of the Scottish Highlands. The gentle slopes and expansive views make it a worthwhile addition to any Munro-bagging adventure.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-garbh-carn-mairg-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.60290,-4.19200/"
  },
  {
    "id": "187",
    "name": "Meall Garbh",
    "extra": "Ben Lawers",
    "area": "Perthshire",
    "meters": 1123,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3685,
    "summited": false,
    "lat": 56.566131,
    "lng": -4.207698,
    "link": "https://www.walkhighlands.co.uk/munros/meall-garbh-ben-lawers",
    "description": "Meall Garbh, a prominent peak within the Ben Lawers range, shares its exact elevation with its neighboring summit, An Stùc. This mountain is an integral part of the picturesque circuit that encircles the corrie, which cradles the serene Lochan nan Cat. The route offers a rewarding experience for hikers, with stunning views and a sense of accomplishment as you traverse this beautiful section of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-garbh-ben-lawers-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.52950,-4.15186/"
  },
  {
    "id": "188",
    "name": "Meall Ghaordaidh",
    "extra": "",
    "area": "Perthshire",
    "meters": 1040,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3411,
    "summited": false,
    "lat": 56.525809,
    "lng": -4.416654,
    "link": "https://www.walkhighlands.co.uk/munros/meall-ghaordaidh",
    "description": "Meall Ghaordaidh may not stand out as a particularly remarkable peak at first glance. The common route of ascent from Glen Lochay reveals a rather unremarkable, featureless mound. However, when viewed from Glen Lyon to the north, the mountain presents a more striking appearance, bolstered by two prominent buttresses that add a touch of rugged charm to its profile. Despite its initial impression, Meall Ghaordaidh offers a unique perspective and a rewarding climb for those who appreciate the subtler beauties of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-ghaordaidh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.49610,-4.39556/"
  },
  {
    "id": "189",
    "name": "Meall Glas",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 959,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3147,
    "summited": false,
    "lat": 56.455711,
    "lng": -4.546837,
    "link": "https://www.walkhighlands.co.uk/munros/meall-glas",
    "description": "Meall Glas is a somewhat unremarkable Munro nestled between the scenic Glen Dochart and Glen Lochay. Despite its modest appearance, it offers a rewarding climb that can be approached from either of these picturesque glens. The journey to the summit provides a tranquil escape and a chance to immerse oneself in the serene beauty of the Scottish Highlands. Whether you choose to start your ascent from Glen Dochart or Glen Lochay, you'll find that the path to Meall Glas is a delightful adventure through some of Scotland's most captivating landscapes.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-glas-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.41480,-4.51720/"
  },
  {
    "id": "190",
    "name": "Meall Gorm",
    "extra": "",
    "area": "Ullapool",
    "meters": 950,
    "section": "14B",
    "region": "14B: The Fannaichs",
    "feet": 3116,
    "summited": false,
    "lat": 57.680837,
    "lng": -4.983801,
    "link": "https://www.walkhighlands.co.uk/munros/meall-gorm",
    "description": "Meall Gorm is situated along the Fannichs ridge, offering a splendid vantage point. This munro is distinguished by its four impressive corries on the northeastern flank, each cradling its own serene lochan. The landscape here is both rugged and picturesque, making it a rewarding destination for avid hillwalkers and nature enthusiasts alike.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-gorm-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.72480,-4.89430/"
  },
  {
    "id": "191",
    "name": "Meall Greigh",
    "extra": "",
    "area": "Perthshire",
    "meters": 1001,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3284,
    "summited": false,
    "lat": 56.567417,
    "lng": -4.159559,
    "link": "https://www.walkhighlands.co.uk/munros/meall-greigh",
    "description": "Meall Greigh, the easternmost peak in the Lawers range, presents a somewhat unremarkable and expansive profile. Often, hikers will traverse this mountain on their way to the more prominent Meall Garbh. Despite its less distinctive shape, Meall Greigh offers hikers the reward of sweeping, unobstructed views, as there are no higher summits to the east to block the panorama. The extensive vistas make the journey worthwhile, providing a serene and expansive outlook over the surrounding landscape.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-greigh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.52950,-4.15186/"
  },
  {
    "id": "192",
    "name": "Creag Mhor",
    "extra": "Meall na Aighean",
    "area": "Perthshire",
    "meters": 981,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3219,
    "summited": false,
    "lat": 56.620627,
    "lng": -4.128741,
    "link": "https://www.walkhighlands.co.uk/munros/creag-mhor-meall-na-aighean",
    "description": "Meall na Aighean, which is referred to as Creag Mhòr on older maps, is part of a quartet of gently rounded Munros situated on the northern side of the picturesque Glen Lyon. This mountain, along with its companions, offers a serene and scenic hiking experience, characterized by its smooth, rolling terrain and the stunning vistas that unfold as you ascend. The area is a haven for outdoor enthusiasts seeking both tranquility and the rewarding challenge of bagging multiple peaks in one outing.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/creag-mhor-meall-na-aighean-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.60290,-4.19200/"
  },
  {
    "id": "193",
    "name": "Meall na Teanga",
    "extra": "",
    "area": "Fort William",
    "meters": 917,
    "section": "10C",
    "region": "10C: Loch Arkaig to Glen Moriston",
    "feet": 3008,
    "summited": false,
    "lat": 56.989012,
    "lng": -4.930955,
    "link": "https://www.walkhighlands.co.uk/munros/meall-na-teanga",
    "description": "Meall na Teanga is a prominent, steeply rising dome, recognized as one of the two distinguished Loch Lochy Munros. It majestically ascends above the dense forestry, offering a striking view from the A82 road on the opposite side of the loch. The mountain's rounded summit is complemented by several subsidiary peaks, which are intricately separated by deep, scooped corries. This intricate landscape provides a captivating and varied terrain for hikers and nature enthusiasts.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-na-teanga-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.02130,-4.83917/"
  },
  {
    "id": "194",
    "name": "Meall nan Ceapraichean",
    "extra": "",
    "area": "Ullapool",
    "meters": 977,
    "section": "15A",
    "region": "15A: Loch Broom to Strath Oykel",
    "feet": 3205,
    "summited": false,
    "lat": 57.798514,
    "lng": -4.934012,
    "link": "https://www.walkhighlands.co.uk/munros/meall-nan-ceapraichean",
    "description": "Meall nan Ceapraichean is a rocky peak situated to the north of Beinn Dearg. Often hiked in conjunction with its neighboring summits, this munro offers particularly stunning vistas towards the northwest. The rugged terrain and panoramic views make it a rewarding climb for those exploring the region.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-nan-ceapraichean-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.81980,-5.06250/"
  },
  {
    "id": "195",
    "name": "Meall nan Eun",
    "extra": "",
    "area": "Fort William",
    "meters": 928,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3045,
    "summited": false,
    "lat": 56.561176,
    "lng": -4.942926,
    "link": "https://www.walkhighlands.co.uk/munros/meall-nan-eun",
    "description": "Meall nan Eun is a Munro characterized by its dome-shaped appearance and notably rounded summit. Despite its steep and challenging sides, the mountain's plateau-like top tends to diminish the depth of the surrounding views. However, the journey to the summit offers its own unique rewards, with the steep ascent providing a sense of accomplishment and the opportunity to experience the rugged beauty of the Scottish Highlands up close.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-nan-eun-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.57620,-5.03566/"
  },
  {
    "id": "196",
    "name": "Meall nan Tarmachan",
    "extra": "",
    "area": "Perthshire",
    "meters": 1044,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3424,
    "summited": false,
    "lat": 56.521673,
    "lng": -4.301344,
    "link": "https://www.walkhighlands.co.uk/munros/meall-nan-tarmachan",
    "description": "Meall nan Tarmachan stands as the sole Munro peak on the striking Tarmachan ridge. While it can be ascended swiftly from Lochain na Lairige, many adventurers prefer to experience it as part of an exhilarating and rugged scramble along the entire ridge. This route offers a more comprehensive and rewarding journey. The Tarmachan ridge itself is a notable feature, easily visible from the village of Killin, and its dramatic presence beckons hikers and climbers alike. The combination of quick access and the option for a more extended, scenic scramble makes Meall nan Tarmachan a versatile and appealing destination for Munro baggers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/meall-nan-tarmachan-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.51080,-4.26280/"
  },
  {
    "id": "197",
    "name": "Monadh Mor",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1113,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 3652,
    "summited": false,
    "lat": 57.0268,
    "lng": -3.75007,
    "link": "https://www.walkhighlands.co.uk/munros/monadh-mor",
    "description": "Monadh Mòr is an expansive plateau situated in the core of the untamed Cairngorms. Climbing this munro, often paired with an ascent of Beinn Bhrotain, demands significant exertion. Whether you choose to approach it by traversing the extensive plateaux from Glen Feshie, or opt for the more straightforward path past White Bridge and the Linn of Dee, or ascend through Glen Geusachan, the journey is both challenging and rewarding. The rugged terrain and remote location make it a true adventure for dedicated munro baggers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/monadh-mor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.06310,-3.89700/"
  },
  {
    "id": "198",
    "name": "Moruisg",
    "extra": "",
    "area": "Torridon",
    "meters": 928,
    "section": "12A",
    "region": "12A: Kyle of Lochalsh to Garve",
    "feet": 3045,
    "summited": false,
    "lat": 57.499712,
    "lng": -5.17063,
    "link": "https://www.walkhighlands.co.uk/munros/moruisg",
    "description": "Moruisg stands out dramatically, resembling a stranded whale, as it towers above the upper reaches of Glen Carron. The typical path to the summit, however, is less than ideal, involving a broad and often waterlogged incline that offers little in the way of interesting landmarks to distract from the climb. Despite the challenging terrain, the effort is rewarded with stunning views and a sense of accomplishment upon reaching the top.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/moruisg-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.51760,-5.20773/"
  },
  {
    "id": "199",
    "name": "Mount Keen",
    "extra": "",
    "area": "Angus",
    "meters": 939,
    "section": "07B",
    "region": "07B: Braemar to Montrose",
    "feet": 3081,
    "summited": false,
    "lat": 56.96976,
    "lng": -2.973622,
    "link": "https://www.walkhighlands.co.uk/munros/mount-keen",
    "description": "Mount Keen holds the distinction of being the easternmost Munro, characterized by its distinctive cone-shaped peak that rises prominently above the expansive Mounth plateau. This mountain offers a relatively swift ascent if approached from Glen Esk, but for those seeking a more picturesque route, the journey through Glen Tanar provides a scenic alternative. Whether you choose the direct path or the more leisurely scenic route, Mount Keen promises a rewarding experience with its unique position and striking form.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/mount-keen-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.91150,-2.91052/"
  },
  {
    "id": "200",
    "name": "Mullach Clach a' Bhlair",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1019,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 3343,
    "summited": false,
    "lat": 57.011879,
    "lng": -3.841271,
    "link": "https://www.walkhighlands.co.uk/munros/mullach-clach-a-bhlair",
    "description": "Mullach Clach a' Bhlàir boasts a rather unremarkable summit located towards the southern extremity of the expansive plateau that extends north to Sgòr Gaoith and east to Cairn Toul. Despite its modest peak, the mountain's most captivating aspects are revealed during the approach from the picturesque Glen Feshie, which is adorned with lush woodlands. The journey through this scenic glen, particularly when passing by the rugged Coire Garbhlach, offers a truly enchanting experience for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/mullach-clach-a-bhlair-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.06310,-3.89700/"
  },
  {
    "id": "201",
    "name": "Mullach Coire Mhic Fhearchair",
    "extra": "",
    "area": "Ullapool",
    "meters": 1015,
    "section": "14A",
    "region": "14A: Loch Maree to Loch Broom",
    "feet": 3331,
    "summited": false,
    "lat": 57.708995,
    "lng": -5.271357,
    "link": "https://www.walkhighlands.co.uk/munros/mullach-coire-mhic-fhearchair",
    "description": "Mullach Coire Mhic Fhearchair stands as one of the most isolated Munros within the vast expanse of the Fisherfield Forest, often referred to as the Great Wilderness. The journey to reach this peak is notably lengthy, regardless of the chosen route, demanding a significant commitment from any adventurer. Adding to the challenge is the rugged terrain along the ridge, which is strewn with sharp, angular quartzite boulders, making the ascent both physically demanding and technically intricate. This remote and wild setting offers a true test of endurance and skill, rewarding those who venture here with a profound sense of accomplishment and breathtaking natural beauty.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/mullach-coire-mhic-fhearchair-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.77680,-5.25450/"
  },
  {
    "id": "202",
    "name": "Mullach Fraoch-choire",
    "extra": "",
    "area": "Kintail",
    "meters": 1101,
    "section": "11B",
    "region": "11B: Glen Affric to Glen Moriston",
    "feet": 3612,
    "summited": false,
    "lat": 57.205388,
    "lng": -5.155637,
    "link": "https://www.walkhighlands.co.uk/munros/mullach-fraoch-choire",
    "description": "Mullach Fraoch-Choire, though not immediately visible from Cluanie, stands as one of the most remarkable peaks in the area. The journey to its summit typically begins from a' Chralaig, leading adventurers along a dramatic ridge that is intricately carved with a series of exposed pinnacles. Upon reaching the top, climbers are rewarded with breathtaking panoramic views that stretch across the stunning expanse of Glen Affric. This mountain offers a truly memorable experience for those who seek both challenge and beauty in their Munro-bagging adventures.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/mullach-fraoch-choire-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.15960,-5.16470/"
  },
  {
    "id": "203",
    "name": "Mullach na Dheiragain",
    "extra": "",
    "area": "Loch Ness",
    "meters": 982,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3222,
    "summited": false,
    "lat": 57.283399,
    "lng": -5.18635,
    "link": "https://www.walkhighlands.co.uk/munros/mullach-nan-dheiragain",
    "description": "Mullach na Dheiragain is known for being one of the more challenging Munros to access. Nestled on an extensive ridge that stretches northward from the towering peak of Sgùrr nan Ceathreamhnan, it presents a demanding journey for hikers. Typically, after reaching Mullach na Dheiragain, climbers find themselves retracing their steps back over the imposing parent mountain, adding to the adventure and effort required to conquer this remote summit.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/mullach-nan-dheiragain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.23220,-5.18340/"
  },
  {
    "id": "204",
    "name": "Mullach nan Coirean",
    "extra": "",
    "area": "Fort William",
    "meters": 939,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3082,
    "summited": false,
    "lat": 56.749866,
    "lng": -5.072446,
    "link": "https://www.walkhighlands.co.uk/munros/mullach-nan-coirean",
    "description": "Mullach nan Coirean stands as the western sentinel of the Mamores range. This peak features a graceful, grassy ridge that offers a different kind of beauty compared to its more sharply defined neighbors. While it may not boast the dramatic, pointed summit that characterizes many of the other mountains in the area, its gentle slopes and expansive views make it a rewarding climb for those who appreciate subtler landscapes. The journey to its summit provides a serene and picturesque experience, capturing the essence of the Scottish Highlands in a unique way.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/mullach-nan-coirean-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.76950,-5.03720/"
  },
  {
    "id": "205",
    "name": "Na Gruagaichean",
    "extra": "",
    "area": "Fort William",
    "meters": 1054,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3459,
    "summited": false,
    "lat": 56.743699,
    "lng": -4.939851,
    "link": "https://www.walkhighlands.co.uk/munros/na-gruagaichean",
    "description": "Na Gruagaichean is a splendid peak situated along the central ridge of the Mamores range, offering breathtaking vistas that extend down to Kinlochleven. This mountain features a distinctive pair of summits, which are divided by a steep and narrow bealach. The ascent provides a rewarding challenge, with panoramic views that make the effort well worth it. Whether you're an experienced climber or a passionate hillwalker, Na Gruagaichean promises an unforgettable experience amidst the rugged beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/na-gruagaichean2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/56.71690,-4.96308/"
  },
  {
    "id": "206",
    "name": "Ruadh Stac Mor",
    "extra": "",
    "area": "Ullapool",
    "meters": 919,
    "section": "14A",
    "region": "14A: Loch Maree to Loch Broom",
    "feet": 3014,
    "summited": false,
    "lat": 57.726781,
    "lng": -5.329288,
    "link": "https://www.walkhighlands.co.uk/munros/ruadh-stac-mor",
    "description": "Ruadh Stac Mòr, along with its nearby companion A' Mhaighdean, is often considered one of the most remote Munros in all of Britain. Nestled deep within the Fisherfield Forest, this peak offers an unparalleled vantage point. The landscape here is nothing short of breathtaking, with rugged mountains soaring dramatically from the lochs and bogs that encircle them. To the west, the expansive view of the sea adds to the sense of isolation and natural beauty. This area is a true haven for those seeking solitude and awe-inspiring scenery.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/ruadh-stac-mor2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/57.77680,-5.25450/"
  },
  {
    "id": "207",
    "name": "Sail Chaorainn",
    "extra": "",
    "area": "Kintail",
    "meters": 999,
    "section": "11B",
    "region": "11B: Glen Affric to Glen Moriston",
    "feet": 3278,
    "summited": false,
    "lat": 57.191622,
    "lng": -5.091199,
    "link": "https://www.walkhighlands.co.uk/munros/sail-chaorainn",
    "description": "Sàil Chaorainn often goes unnoticed among the Kintail Munros, largely due to its hidden location behind the more prominent Sgùrr nan Conbhairean. Nestled on the ridge that stretches northward from its more famous neighbor, Sàil Chaorainn offers a sense of seclusion and remoteness. This peak, while less frequented, provides a unique and tranquil experience for those willing to venture off the beaten path. Its position ensures that it remains a quiet retreat, away from the more crowded summits, making it a perfect destination for those seeking solitude amidst the stunning Highland scenery.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sail-chaorainn-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.14610,-5.06820/"
  },
  {
    "id": "208",
    "name": "Saileag",
    "extra": "",
    "area": "Kintail",
    "meters": 956,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3136,
    "summited": false,
    "lat": 57.181264,
    "lng": -5.281331,
    "link": "https://www.walkhighlands.co.uk/munros/saileag",
    "description": "Sàileag, nestled on the North Kintail Ridge, finds itself positioned between the renowned Five Sisters and the Brothers. Despite its relatively modest stature and unassuming presence, it has surprisingly earned a spot on the esteemed Munro list. This summit, often overlooked by many, offers a unique charm and a sense of tranquility that contrasts with its more famous neighbors. Its inclusion as a Munro might raise a few eyebrows, but for those who venture to its peak, Sàileag provides a rewarding experience and a different perspective on the majestic Kintail landscape.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/saileag-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.16960,-5.29450/"
  },
  {
    "id": "209",
    "name": "Schiehallion",
    "extra": "",
    "area": "Perthshire",
    "meters": 1083,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3554,
    "summited": false,
    "lat": 56.666942,
    "lng": -4.10023,
    "link": "https://www.walkhighlands.co.uk/munros/schiehallion",
    "description": "Schiehallion stands as one of Scotland's most iconic and recognizable peaks. From many vantage points, it presents a graceful whaleback ridge, but when viewed from the shores of Loch Rannoch, it transforms into a strikingly perfect cone. This mountain holds a special place in the history of science, as it was the site of a groundbreaking experiment aimed at calculating the Earth's mass, which led to the invention of contour lines. Schiehallion's unique shape and historical significance make it a must-visit for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/schiehallion-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.67580,-4.03603/"
  },
  {
    "id": "210",
    "name": "Seana Bhraigh",
    "extra": "",
    "area": "Ullapool",
    "meters": 926,
    "section": "15A",
    "region": "15A: Loch Broom to Strath Oykel",
    "feet": 3038,
    "summited": false,
    "lat": 57.84733,
    "lng": -4.89662,
    "link": "https://www.walkhighlands.co.uk/munros/seana-bhraigh",
    "description": "Seana Bhràigh stands as one of the more secluded Munros, nestled on the far reaches of a rolling plateau. This majestic peak is dramatically perched above the breathtaking Luchd Choire, offering a sense of isolation and tranquility. The journey to Seana Bhràigh rewards hikers with sweeping vistas and a profound connection to the rugged beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/seana-bhraigh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.82030,-5.06260/"
  },
  {
    "id": "211",
    "name": "Sgairneach Mhor",
    "extra": "",
    "area": "Cairngorms",
    "meters": 991,
    "section": "05A",
    "region": "05A: Loch Ericht to Glen Tromie & Glen Garry",
    "feet": 3251,
    "summited": false,
    "lat": 56.828447,
    "lng": -4.297792,
    "link": "https://www.walkhighlands.co.uk/munros/sgairneach-mhor",
    "description": "Sgàirneach Mhòr is a notably rounded peak situated on the western flank of the Drumochter Pass. One of its most striking features is Coire Creagach, a corrie nestled just below the summit. This mountain offers a gentle ascent, making it accessible for many walkers, and provides sweeping views of the surrounding highlands. The landscape around Sgàirneach Mhòr is characterized by its rolling hills and expansive moorlands, creating a serene and picturesque environment for outdoor enthusiasts.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgairneach-mhor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.85150,-4.24440/"
  },
  {
    "id": "212",
    "name": "Sgiath Chuil",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 920,
    "section": "02B",
    "region": "02B: Glen Lyon to Glen Dochart & Loch Tay",
    "feet": 3019,
    "summited": false,
    "lat": 56.453157,
    "lng": -4.495638,
    "link": "https://www.walkhighlands.co.uk/munros/sgiath-chuil",
    "description": "Sgiath Chùil, while not the most striking of peaks, is nestled between the scenic Glen Dochart and Glen Lochay. Its summit, perched atop a modest crag when viewed from the southern approach, offers a rewarding climb. Adventurers often tackle Sgiath Chùil in conjunction with its nearby counterpart, Meall Glas. However, the route between these two munros features a low and steep-sided bealach, adding a bit of a challenge to the journey. Despite its unassuming appearance, Sgiath Chùil provides a fulfilling experience for those who venture to its heights.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgiath-chuil-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.41480,-4.51720/"
  },
  {
    "id": "213",
    "name": "Sgor an Lochain Uaine",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1258,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 4127,
    "summited": false,
    "lat": 57.058376,
    "lng": -3.725897,
    "link": "https://www.walkhighlands.co.uk/munros/sgor-an-lochain-uaine",
    "description": "Sgòr an Lochain Uaine, often referred to as Angel's Peak, achieved full Munro status in 1997. Nestled deep within the Cairngorms, this mountain is renowned for its remote and rugged beauty. Its striking summit, which serves as a twin to the nearby Cairn Toul, offers breathtaking views over the awe-inspiring Garbh Choire. The journey to this peak is a true adventure, rewarding climbers with a sense of solitude and the splendor of the surrounding wilderness.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgor-an-lochain-uaine-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.14620,-3.67930/"
  },
  {
    "id": "214",
    "name": "Sgor Gaibhre",
    "extra": "",
    "area": "Fort William",
    "meters": 955,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3133,
    "summited": false,
    "lat": 56.772553,
    "lng": -4.546498,
    "link": "https://www.walkhighlands.co.uk/munros/sgor-gaibhre",
    "description": "Sgòr Gaibhre is a secluded Munro situated above the serene Loch Ossian, nestled deep within the heart of the Scottish Highlands. This mountain offers a sense of remoteness and tranquility, making it a rewarding challenge for avid hikers. Typically, adventurers embark on their journey to Sgòr Gaibhre from either Rannoch or Corrour stations, both of which are conveniently located along the scenic West Highland railway line. The trek to the summit provides an immersive experience in the rugged beauty of the Highlands, with panoramic views that make the effort truly worthwhile.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgor-gaibhre-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.76040,-4.69070/"
  },
  {
    "id": "215",
    "name": "Sgor Gaoith",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1116,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 3661,
    "summited": false,
    "lat": 57.068561,
    "lng": -3.810856,
    "link": "https://www.walkhighlands.co.uk/munros/sgor-gaoith",
    "description": "Sgòr Gaoith stands out as a prominent peak situated on the eastern boundary of an expansive, undulating plateau. Its striking position is perched dramatically on the brink of a towering wall of fragmented cliffs that plunge steeply down to the serene waters of Loch Einich. This unique setting offers one of the most spectacular and rewarding shorter hillwalks in the Cairngorms, combining breathtaking scenery with a sense of adventure.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgor-gaoith-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.08790,-3.89510/"
  },
  {
    "id": "216",
    "name": "Sgorr Ruadh",
    "extra": "",
    "area": "Torridon",
    "meters": 961,
    "section": "13B",
    "region": "13B: Applecross to Achnasheen",
    "feet": 3152,
    "summited": false,
    "lat": 57.498622,
    "lng": -5.407747,
    "link": "https://www.walkhighlands.co.uk/munros/sgorr-ruadh",
    "description": "Sgòrr Ruadh stands as a striking sandstone giant within the Couilin Forest, renowned for its majestic presence. Its most awe-inspiring feature is the grand face that towers above Coire Lair, offering a dramatic and rugged landscape. In contrast, the southern and western flanks of the mountain present a more subdued and less imposing aspect. Many adventurers choose to ascend Sgòrr Ruadh on its own, tackling the steep and often boggy southern slopes. However, a more captivating route involves approaching from the bealach that connects it with Beinn Liath Mhòr, providing a more varied and scenic climb.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgorr-ruadh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.48180,-5.32920/"
  },
  {
    "id": "217",
    "name": "Sgurr a' Bhealaich Dheirg",
    "extra": "",
    "area": "Kintail",
    "meters": 1036,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3399,
    "summited": false,
    "lat": 57.177825,
    "lng": -5.252177,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-a-bhealaich-dheirg",
    "description": "Sgùrr a' Bhealaich Dheirg stands as the tallest and most impressive peak on the Brothers Ridge, which extends eastward from the renowned Five Sisters of Kintail. This majestic mountain's true summit is situated on a slender spur that juts out to the north of the main ridge. At the pinnacle, you'll find a meticulously constructed cairn marking the highest point, offering breathtaking views and a rewarding sense of accomplishment for those who reach it.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-a-bhealaich-dheirg-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.16960,-5.29450/"
  },
  {
    "id": "218",
    "name": "Sgurr a' Chaorachain",
    "extra": "",
    "area": "Torridon",
    "meters": 1053,
    "section": "12A",
    "region": "12A: Kyle of Lochalsh to Garve",
    "feet": 3455,
    "summited": false,
    "lat": 57.452501,
    "lng": -5.189284,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-a-chaorachain",
    "description": "Sgùrr a' Chaorachain is often ascended in tandem with its nearby counterpart, Sgùrr Chòinnich. These two peaks are nestled deep within the glen of the Allt a' Chonais, a secluded area branching off from the primary path that winds through Glen Carron. The journey to these mountains offers a sense of remoteness and tranquility, making the effort to reach them all the more rewarding for avid munro baggers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-a-chaorachain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.49130,-5.27236/"
  },
  {
    "id": "219",
    "name": "Sgurr a' Choire Ghlais",
    "extra": "",
    "area": "Loch Ness",
    "meters": 1084,
    "section": "12A",
    "region": "12A: Kyle of Lochalsh to Garve",
    "feet": 3555,
    "summited": false,
    "lat": 57.444288,
    "lng": -4.903757,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-a-choire-ghlais",
    "description": "Standing as the tallest of the Glen Strathfarrar Munros, Sgùrr a' Choire Ghlais is a majestic summit that commands attention at the heart of the range. This impressive peak is crowned with two well-crafted cairns, offering a rewarding destination for those who venture to its heights. The panoramic views from the top are nothing short of spectacular, making the climb well worth the effort for any dedicated munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-a-choire-ghlais-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.40560,-4.85910/"
  },
  {
    "id": "220",
    "name": "Sgurr a' Ghreadaidh",
    "extra": "",
    "area": "Islands",
    "meters": 972,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3189,
    "summited": false,
    "lat": 57.227313,
    "lng": -6.234425,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-a-ghreadaidh",
    "description": "Sgùrr a' Ghreadaidh stands as the tallest peak in the central section of the Cuillin ridge, offering a challenging and exhilarating experience for climbers. This majestic mountain boasts two distinct summits, divided by an incredibly narrow arete, reputed to be the sharpest in the British Isles. The true summit is the northern peak, which is most commonly accessed through a demanding scramble up An Dorus. However, there are alternative routes available for those seeking a different approach, as detailed in our comprehensive guide. This mountain promises not only a test of skill but also breathtaking views and a sense of accomplishment for those who reach its heights.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-a-ghreadaidh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.21980,-6.29290/"
  },
  {
    "id": "221",
    "name": "Sgurr a' Mhadaidh",
    "extra": "",
    "area": "Islands",
    "meters": 918,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3012,
    "summited": false,
    "lat": 57.230869,
    "lng": -6.231931,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-a-mhadaidh",
    "description": "Sgùrr a' Mhadaidh boasts four distinct summits along one of the more challenging stretches of the Cuillin Ridge. Among these, the highest peak stands out as the sole Munro and is unique in that it can be reached without the need for technical rock-climbing skills. The most common route to the summit is through An Dorus, a notable gap in the ridge. However, for those seeking a less demanding climb, there is an alternative path that diverges from the gully before arriving at the bealach, offering a slightly easier ascent. This mountain provides a rewarding experience for those who venture its rugged terrain, with breathtaking views and a sense of accomplishment upon reaching the top.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-a-mhadaidh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.21980,-6.29290/"
  },
  {
    "id": "222",
    "name": "Sgurr a' Mhaim",
    "extra": "",
    "area": "Fort William",
    "meters": 1099,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3606,
    "summited": false,
    "lat": 56.75592,
    "lng": -5.00369,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-a-mhaim",
    "description": "Sgùrr a' Mhàim stands prominently on a jutting spur to the north of the central Mamores ridge. Its summit, often cloaked in gleaming quartzite, can be mistaken for snow when viewed from Glen Nevis, especially under certain lighting conditions. The connection to the rest of the Mamores range is via the exhilarating and narrow 'Devil's Ridge,' which offers both a thrilling challenge and breathtaking views for those who traverse it.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-a-mhaim-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.77770,-5.00034/"
  },
  {
    "id": "223",
    "name": "Sgurr a' Mhaoraich",
    "extra": "",
    "area": "Fort William",
    "meters": 1027,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3369,
    "summited": false,
    "lat": 57.105849,
    "lng": -5.330509,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-a-mhaoraich",
    "description": "Sgùrr a' Mhaoraich stands as a lone Munro on the northern shores of Loch Quoich, nestled between the regions of Kintail and Knoydart. This mountain offers an exceptional vantage point, with particularly stunning views stretching down the length of Loch Huorn. Its isolated position makes it a unique and rewarding climb for those seeking both solitude and breathtaking scenery.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-a-mhaoraich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.08480,-5.27810/"
  },
  {
    "id": "224",
    "name": "Sgurr Alasdair",
    "extra": "",
    "area": "Islands",
    "meters": 992,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3255,
    "summited": false,
    "lat": 57.206589,
    "lng": -6.224143,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-alasdair",
    "description": "Sgùrr Alasdair stands as the tallest peak in Britain outside of the mainland, offering a truly unique and exhilarating experience for climbers. Despite its modestly sized summit, it boasts one of the most breathtaking vantage points in the Skye Cuillin range. From this lofty perch, you can take in the dramatic expanse of the Cuillin Ridge, marvel at the sheer cliffs, and gaze upon the shimmering lochs below. The panoramic views extend to the surrounding sea and the scattered islands, creating a mesmerizing and unforgettable landscape in every direction.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-alasdair-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.20300,-6.29140/"
  },
  {
    "id": "225",
    "name": "Sgurr an Doire Leathain",
    "extra": "",
    "area": "Kintail",
    "meters": 1010,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3314,
    "summited": false,
    "lat": 57.13687,
    "lng": -5.281531,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-an-doire-leathain",
    "description": "Sgùrr an Doire Leathain stands as one of the seven majestic Munros gracing the South Cluanie ridge. Unlike its counterparts, its summit is uniquely positioned a short distance to the north of the main ridge, perched on a distinctive projecting spur. This location offers a slightly different perspective and a rewarding challenge for avid munro baggers. The panoramic views from the summit are truly breathtaking, capturing the rugged beauty of the surrounding landscape. Photo © Russel Wills from Geograph under CCSA licence.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-an-doire-leathain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.15600,-5.17815/"
  },
  {
    "id": "226",
    "name": "Sgurr an Lochain",
    "extra": "",
    "area": "Kintail",
    "meters": 1004,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3294,
    "summited": false,
    "lat": 57.141288,
    "lng": -5.297466,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-an-lochain",
    "description": "Sgùrr an Lochain is often considered the most impressive of the seven Munros that grace the southern Glen Shiel Ridge. Its striking, pointed summit towers majestically above a rugged corrie, which cradles the lochan that lends the mountain its name. The dramatic landscape and the serene lochan combine to create a breathtaking vista, making Sgùrr an Lochain a must-visit for any avid Munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-an-lochain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.15600,-5.17815/"
  },
  {
    "id": "227",
    "name": "Sgurr Ban",
    "extra": "",
    "area": "Ullapool",
    "meters": 989,
    "section": "14A",
    "region": "14A: Loch Maree to Loch Broom",
    "feet": 3245,
    "summited": false,
    "lat": 57.718538,
    "lng": -5.265903,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-ban",
    "description": "Sgùrr Bàn stands as one of the most isolated Munros nestled within the rugged expanse of the Fisherfield Forest. This majestic peak can be accessed through a challenging and rewarding trek starting from Kinlochewe, or alternatively, approached via the scenic route by Loch a'Bhraoin. However, the most common ascent begins from the Shenavall bothy, offering a more practical base for climbers. The journey to Sgùrr Bàn is an adventure in itself, promising breathtaking landscapes and a true sense of wilderness.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-ban-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.77680,-5.25450/"
  },
  {
    "id": "228",
    "name": "Sgurr Breac",
    "extra": "",
    "area": "Ullapool",
    "meters": 1000,
    "section": "14B",
    "region": "14B: The Fannaichs",
    "feet": 3280,
    "summited": false,
    "lat": 57.691943,
    "lng": -5.09131,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-breac",
    "description": "Sgùrr Breac, along with its companion A' Chailleach, forms part of the western Fannich range. This striking munro is particularly notable for its dramatically steep northern face, which presents a formidable and awe-inspiring sight. The rugged terrain and the sheer cliffs make it a challenging yet rewarding climb for avid munro baggers. The panoramic views from the summit are nothing short of spectacular, offering a true sense of the wild and untamed beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-breac2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/57.73740,-5.09000/"
  },
  {
    "id": "229",
    "name": "Sgurr Choinnich",
    "extra": "",
    "area": "Torridon",
    "meters": 999,
    "section": "12A",
    "region": "12A: Kyle of Lochalsh to Garve",
    "feet": 3279,
    "summited": false,
    "lat": 57.451026,
    "lng": -5.207916,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-choinnich",
    "description": "Sgùrr Chòinnich is frequently climbed in tandem with its loftier companion, Sgùrr a' Chaorachain. Although Sgùrr Chòinnich stands at a slightly lower elevation, it is often considered the more striking of the two peaks. Its summit ridge is gracefully adorned with numerous crags, adding to its rugged charm and making it a favorite among hikers. The ascent offers a rewarding experience with breathtaking views and a sense of accomplishment as you navigate its impressive terrain.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-choinnich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.49130,-5.27236/"
  },
  {
    "id": "230",
    "name": "Sgurr Choinnich Mor",
    "extra": "",
    "area": "Fort William",
    "meters": 1094,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3589,
    "summited": false,
    "lat": 56.80043,
    "lng": -4.90396,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-choinnich-mor",
    "description": "Sgùrr Chòinnich Mòr stands as a striking pyramidal summit, marking the western boundary of the Grey Corries range. This impressive peak is renowned for its sharp, elegant arete, which presents a rewarding challenge for climbers. Reaching this majestic mountain involves a lengthy and demanding approach, no matter which direction you choose to tackle it from. The journey, however, is well worth the effort, offering breathtaking views and a true sense of accomplishment.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-choinnich-mor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.87270,-4.86820/"
  },
  {
    "id": "231",
    "name": "Sgurr Dearg",
    "extra": "Inaccessible Pinnacle",
    "area": "Islands",
    "meters": 986,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3234,
    "summited": false,
    "lat": 57.213261,
    "lng": -6.234818,
    "link": "https://www.walkhighlands.co.uk/munros/inaccessible-pinnacle",
    "description": "The Inaccessible Pinnacle, commonly referred to as the In Pinn, stands as the second loftiest peak within the Skye Cuillin range. Renowned for its formidable challenge, it is widely considered the most arduous of all the Munros. The ascent demands not only a rock climb but also an abseil, necessitating either substantial climbing experience or the guidance of a seasoned expert. This striking pinnacle emerges dramatically from the summit of Sgùrr Dearg, offering a thrilling adventure for those who dare to conquer it. Photo credit: Ian Jeffrey.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/inaccessible-pinnacle-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.21200,-6.28840/"
  },
  {
    "id": "232",
    "name": "Sgurr Dubh Mor",
    "extra": "",
    "area": "Islands",
    "meters": 944,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3097,
    "summited": false,
    "lat": 57.204869,
    "lng": -6.211385,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-dubh-mor",
    "description": "Sgùrr Dubh Mòr stands as a striking rocky pinnacle located just off the main Cuillin Ridge, presenting a formidable challenge for munro baggers. Typically, adventurers reach this peak through a demanding and often elusive scramble from the surrounding range. On the opposite side, the Dubhs Ridge offers a direct ascent from Loch Coruisk to the summit. This route is renowned as the longest rock climb in Britain, making it an iconic and exhilarating experience for those equipped with the necessary climbing skills. The journey to Sgùrr Dubh Mòr is not just a test of endurance but also a celebration of Scotland's rugged and breathtaking landscapes.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-dubh-mor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.20300,-6.29140/"
  },
  {
    "id": "233",
    "name": "Sgurr Eilde Mor",
    "extra": "",
    "area": "Fort William",
    "meters": 1010,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3314,
    "summited": false,
    "lat": 56.750006,
    "lng": -4.895435,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-eilde-mor",
    "description": "Sgùrr Èilde Mòr stands as an eastern sentinel of the Mamores range, characterized by its sharp, conical shape composed of scree and rugged rock. The climb to its summit is a challenging endeavor, rising steeply above the picturesque Coire an Lochain. The mountain's precipitous slopes offer breathtakingly deep and expansive views, rewarding those who undertake the demanding ascent.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-eilde-mor2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/56.71680,-4.96280/"
  },
  {
    "id": "234",
    "name": "Sgurr Fhuar-thuill",
    "extra": "",
    "area": "Loch Ness",
    "meters": 1049,
    "section": "12A",
    "region": "12A: Kyle of Lochalsh to Garve",
    "feet": 3442,
    "summited": false,
    "lat": 57.44968,
    "lng": -4.94178,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-fhuar-thuill",
    "description": "Sgùrr Fhuar-thuill presents itself as a narrow, grassy ridge adorned with striking corries that add to its dramatic landscape. To the northeast, you'll find Fhuar-thuill Mòr, which boasts a picturesque lochan that enhances the area's natural beauty. Heading south, you'll come across Loch Toll a'Mhuic, a serene body of water nestled beneath the imposing slabby crags of Sgùrr na Muice, an outlying peak of the mountain. This combination of features makes Sgùrr Fhuar-thuill a captivating destination for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-fhuar-thuill-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.40560,-4.85910/"
  },
  {
    "id": "235",
    "name": "Sgurr Fhuaran",
    "extra": "",
    "area": "Kintail",
    "meters": 1069,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3507,
    "summited": false,
    "lat": 57.19615,
    "lng": -5.34765,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-fhuaran",
    "description": "Sgùrr Fhuaran stands as the central and tallest summit among the famed Five Sisters of Kintail. This peak, with its strikingly perfect conical shape, boasts a west ridge that is arguably the longest uninterrupted ascent route in all of Scotland. However, most climbers typically reach Sgùrr Fhuaran by traversing its neighboring peaks first, making for a more varied and scenic approach.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-fhuaran-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.16940,-5.29450/"
  },
  {
    "id": "236",
    "name": "Sgurr Mhic Choinnich",
    "extra": "",
    "area": "Islands",
    "meters": 948,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3111,
    "summited": false,
    "lat": 57.208937,
    "lng": -6.224113,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-mhic-choinnich",
    "description": "Sgùrr Mhic Chòinnich stands as a striking, wedge-shaped ridge of rock that towers above the scenic Coire Lagan. This Munro is renowned for presenting a significant challenge to those who are not seasoned climbers, as it is considered one of the more demanding peaks in the Cuillin range. The ascent from the bealach features a particularly exposed and nerve-wracking climb that tests the mettle of even experienced hikers. The mountain proudly bears the name of John Mackenzie, an early and influential local climbing guide who left a lasting legacy in the region.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-mhic-choinnich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.20300,-6.29140/"
  },
  {
    "id": "237",
    "name": "Sgurr Mor",
    "extra": "Loch Quiche",
    "area": "Fort William",
    "meters": 1003,
    "section": "10B",
    "region": "10B: Knoydart to Glen Kingie",
    "feet": 3291,
    "summited": false,
    "lat": 57.028446,
    "lng": -5.354206,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-mor-loch-quoich",
    "description": "Sgùrr Mòr stands as a towering, rugged peak, characterized by its steep and rocky terrain. This Munro is one of the most secluded and challenging to access, nestled between the expansive Loch Quoich and the desolate Glen Kingie. The most common approach to conquer this majestic mountain begins at Strathan, located at the head of Loch Arkaig. This route demands a strenuous ascent over an intervening pass, both on the journey to the summit and on the return trip. The effort required to reach Sgùrr Mòr is substantial, but the breathtaking views and sense of accomplishment make it a rewarding endeavor for dedicated munro baggers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-mor-loch-quoich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.97190,-5.31230/"
  },
  {
    "id": "238",
    "name": "Sgurr Mor",
    "extra": "",
    "area": "Ullapool",
    "meters": 1109,
    "section": "14B",
    "region": "14B: The Fannaichs",
    "feet": 3638,
    "summited": false,
    "lat": 57.700133,
    "lng": -5.016765,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-mor",
    "description": "Sgùrr Mòr stands as the tallest peak among the Fannichs, easily identifiable from a distance thanks to its striking and almost surreal cone-like silhouette. This majestic mountain offers an exceptional vantage point for taking in the breathtaking vistas of the northwest Highlands. For those embarking on a ridgewalk in the Fannichs, Sgùrr Mòr undoubtedly serves as the crowning jewel, providing an unforgettable experience and panoramic views that are second to none.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-mor-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.72480,-4.89430/"
  },
  {
    "id": "239",
    "name": "Sgurr na Banachdich",
    "extra": "",
    "area": "Islands",
    "meters": 965,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3166,
    "summited": false,
    "lat": 57.220972,
    "lng": -6.241638,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-na-banachdich",
    "description": "Sgùrr na Banachdich stands out as one of the more accessible Munros within the Skye Cuillin range, particularly when approached through Coir nan Eich. Despite its relative ease of ascent, this peak boasts a sharply defined summit that offers breathtaking panoramic views. It is uniquely positioned at the convergence of three prominent ridges that are popular among scramblers, making it a rewarding climb for both novice and experienced hikers alike.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-na-banachdich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.21980,-6.29290/"
  },
  {
    "id": "240",
    "name": "Sgurr na Carnach",
    "extra": "",
    "area": "Kintail",
    "meters": 1002,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3287,
    "summited": false,
    "lat": 57.189034,
    "lng": -5.349224,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-na-carnach",
    "description": "Sgùrr na Càrnach, one of the renowned Five Sisters of Kintail, was distinguished as a separate Munro during the 1997 revision of Munro's tables. This peak is characterized by its steep, rocky cone, offering a challenging yet rewarding climb for avid hikers. The rugged terrain and dramatic slopes make it a notable feature in the Kintail landscape, providing breathtaking views and a sense of accomplishment for those who reach its summit.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-na-carnach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.16940,-5.29450/"
  },
  {
    "id": "241",
    "name": "Sgurr na Ciche",
    "extra": "",
    "area": "Fort William",
    "meters": 1040,
    "section": "10B",
    "region": "10B: Knoydart to Glen Kingie",
    "feet": 3413,
    "summited": false,
    "lat": 57.013468,
    "lng": -5.456905,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-na-ciche",
    "description": "Sgùrr na Cìche stands out as one of the most elegantly contoured peaks in the Scottish Highlands, often recognized by its striking conical shape visible from various vantage points. Nestled in the rugged and untamed landscape on the periphery of Knoydart, this mountain offers an unparalleled panorama, stretching down the entire expanse of Loch Nevis. The remote location and wild surroundings add to the allure, making it a must-visit for those seeking both adventure and breathtaking natural beauty.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-na-ciche-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.97190,-5.31230/"
  },
  {
    "id": "242",
    "name": "Sgurr na Ciste Duibhe",
    "extra": "",
    "area": "Kintail",
    "meters": 1027,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3369,
    "summited": false,
    "lat": 57.180924,
    "lng": -5.337134,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-na-ciste-duibhe",
    "description": "Sgùrr na Ciste Duibhe, the southernmost peak among the renowned Five Sisters of Kintail, provides breathtaking vistas stretching down Loch Duich. One of its most striking characteristics is the graceful eastern ridge that extends over the Top of Sgùrr nan Spainteach, making it a favorite among hikers and climbers. The mountain's rugged terrain and scenic beauty offer a rewarding experience for those who venture to its summit, where the panoramic views are truly unparalleled.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-na-ciste-duibhe-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.16940,-5.29450/"
  },
  {
    "id": "243",
    "name": "Sgor na h-Ulaidh",
    "extra": "",
    "area": "Fort William",
    "meters": 994,
    "section": "03B",
    "region": "03B: Loch Linnhe to Loch Etive",
    "feet": 3261,
    "summited": false,
    "lat": 56.619796,
    "lng": -5.08006,
    "link": "https://www.walkhighlands.co.uk/munros/sgor-na-h-ulaidh",
    "description": "Nestled in the heart of Glen Coe, Sgòr na h-Ulaidh is often overlooked and remains one of the lesser-known mountains in the area. Its secluded position means it is not as frequently climbed as its more famous neighbors. The ascent is notably steep, demanding a good level of fitness and determination. However, those who reach its summit are rewarded with a unique and breathtaking perspective of the surrounding peaks, offering a fresh and captivating view of this iconic glen.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgor-na-h-ulaidh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.66110,-5.06878/"
  },
  {
    "id": "244",
    "name": "Sgurr na Lapaich",
    "extra": "",
    "area": "Loch Ness",
    "meters": 1152,
    "section": "12B",
    "region": "12B: Killilan to Inverness",
    "feet": 3779,
    "summited": false,
    "lat": 57.369311,
    "lng": -5.059726,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-na-lapaich",
    "description": "Sgùrr na Lapaich stands as the tallest peak within the vast and secluded mountain range located to the north of Loch Mullardoch. This majestic summit is particularly notable for its prominence on clear days, where it can be distinctly seen from vantage points such as the Kessock Bridge and the city of Inverness. The remote nature of this range adds to the allure and challenge for avid munro baggers seeking to conquer its heights.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-na-lapaich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.33990,-4.96150/"
  },
  {
    "id": "245",
    "name": "Sgurr na Ruaidhe",
    "extra": "",
    "area": "Loch Ness",
    "meters": 993,
    "section": "12A",
    "region": "12A: Kyle of Lochalsh to Garve",
    "feet": 3258,
    "summited": false,
    "lat": 57.441497,
    "lng": -4.852465,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-na-ruaidhe",
    "description": "Sgùrr na Ruaidhe, one of the quartet of Munros nestled in Glen Strathfarrar, presents itself as a rather unremarkable, dome-shaped hill blanketed in soft, spongy moss. Despite its somewhat plain appearance, the hill offers a notable highlight: a captivating view stretching eastward towards the Cromarty and Beauly Firths. This scenic vantage point provides a rewarding visual treat for those who venture to its summit, making the climb worthwhile.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-na-ruaidhe-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.40560,-4.85910/"
  },
  {
    "id": "246",
    "name": "Sgurr na Sgine",
    "extra": "",
    "area": "Kintail",
    "meters": 946,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3104,
    "summited": false,
    "lat": 57.147088,
    "lng": -5.396699,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-na-sgine",
    "description": "Sgùrr na Sgìne might not match the imposing presence of its nearby counterpart, The Saddle, but it remains an impressive summit in its own right. Its notable feature, Faochag (meaning 'the whelk'), presents a strikingly steep and conical appearance when viewed from the elevated vantage points of Glen Shiel. This peak offers a rewarding climb and captivating views, making it a worthy addition to any munro bagger's list.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-na-sgine-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.17620,-5.36459/"
  },
  {
    "id": "247",
    "name": "Sgurr nan Ceathreamhnan",
    "extra": "",
    "area": "Loch Ness",
    "meters": 1151,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3776,
    "summited": false,
    "lat": 57.254911,
    "lng": -5.222732,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-nan-ceathreamhnan",
    "description": "Sgùrr nan Ceathreamhnan stands as a truly majestic mountain, serving as the crowning jewel of an array of impressive ridges. Nestled deep within the untamed wilderness at the head of Glen Affric, it is one of the most secluded summits in all of Scotland. Due to its remote location, most adventurers will find that an overnight stay is essential to successfully undertake the ascent. This peak offers an unparalleled experience for those willing to venture into its rugged and isolated terrain.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-nan-ceathreamhnan-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.23220,-5.18340/"
  },
  {
    "id": "248",
    "name": "Sgurr nan Clach Geala",
    "extra": "",
    "area": "Ullapool",
    "meters": 1093,
    "section": "14B",
    "region": "14B: The Fannaichs",
    "feet": 3586,
    "summited": false,
    "lat": 57.696278,
    "lng": -5.048237,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-nan-clach-geala",
    "description": "Sgùrr nan Clach Geala stands as a truly majestic mountain, characterized by its impressive north-south ridge and a breathtaking eastern face adorned with a series of rugged crags. The typical route to this splendid peak begins at the base of Loch a'Bhraoin, offering a scenic and rewarding approach. As you ascend, the dramatic landscape unfolds, revealing the mountain's striking geological features and the serene beauty of the surrounding wilderness.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-nan-clach-geala-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.73730,-5.09000/"
  },
  {
    "id": "249",
    "name": "Sgurr nan Coireachan",
    "extra": "Glen Dessary",
    "area": "Fort William",
    "meters": 954,
    "section": "10B",
    "region": "10B: Knoydart to Glen Kingie",
    "feet": 3129,
    "summited": false,
    "lat": 57.007158,
    "lng": -5.40544,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-nan-coireachan-glen-dessary",
    "description": "Sgùrr nan Coireachan presents a challenging climb with its blend of grassy and rocky inclines, making the ascent from Glen Dessary quite demanding. For those who choose to follow the ridge all the way to its end at Sgùrr na Cìche, Sgùrr nan Coireachan serves as just the beginning, a prelude to the more strenuous efforts that lie ahead. The journey offers a rewarding experience for dedicated munro baggers, with stunning views and a sense of accomplishment awaiting at each peak.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-nan-coireachan-glen-dessary-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.97190,-5.31230/"
  },
  {
    "id": "250",
    "name": "Sgurr nan Coireachan",
    "extra": "Glenfinnan",
    "area": "Fort William",
    "meters": 956,
    "section": "10D",
    "region": "10D: Mallaig to Fort William",
    "feet": 3137,
    "summited": false,
    "lat": 56.935728,
    "lng": -5.448551,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-nan-coireachan-glenfinnan",
    "description": "Sgùrr nan Coireachan stands proudly as one of a duo of Munros, with its companion peak, Sgùrr Thuilm, situated at the head of the picturesque Glen Finnan. These two majestic, rocky summits offer not only breathtaking panoramic views but also share some of the rugged charm and wild character of the nearby Knoydart region. The ascent of Sgùrr nan Coireachan promises an exhilarating experience for any munro bagger, with its craggy terrain and the sense of adventure that comes with exploring such a remote and beautiful part of Scotland.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-nan-coireachan-glenfinnan-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.87110,-5.43640/"
  },
  {
    "id": "251",
    "name": "Sgurr nan Conbhairean",
    "extra": "",
    "area": "Kintail",
    "meters": 1109,
    "section": "11B",
    "region": "11B: Glen Affric to Glen Moriston",
    "feet": 3638,
    "summited": false,
    "lat": 57.177622,
    "lng": -5.095407,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-nan-conbhairean",
    "description": "Sgùrr nan Conbhairean is a somewhat elusive, dome-shaped peak that rises above the serene waters of Loch Cluanie. Its position, set back from the main road, makes it a hidden gem not immediately visible to passersby. This mountain is the tallest among a trio of Munros in the area, offering an engaging and rewarding circuit for those who venture to explore its heights. The journey to its summit provides a sense of seclusion and discovery, making it a memorable experience for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-nan-conbhairean-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.14610,-5.06820/"
  },
  {
    "id": "252",
    "name": "Sgurr nan Each",
    "extra": "",
    "area": "Ullapool",
    "meters": 923,
    "section": "14B",
    "region": "14B: The Fannaichs",
    "feet": 3028,
    "summited": false,
    "lat": 57.681008,
    "lng": -5.04635,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-nan-each",
    "description": "Sgùrr nan Each, a distinguished Munro located on the southern ridge of Sgùrr nan Clach Geala, presents itself as a striking and graceful 'S'-shaped ridge. Its steep, rugged flanks add to its dramatic appearance, making it a notable peak for avid climbers and hikers. The ascent offers breathtaking views and a rewarding challenge for those who seek to conquer its elegant slopes.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-nan-each-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.73730,-5.09000/"
  },
  {
    "id": "253",
    "name": "Sgurr nan Eag",
    "extra": "",
    "area": "Islands",
    "meters": 926,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3039,
    "summited": false,
    "lat": 57.19581,
    "lng": -6.211264,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-nan-eag",
    "description": "Sgùrr nan Eag, the southernmost summit in the Cuillin range, offers a relatively straightforward ridge walk, though it still demands some scrambling expertise. This part of the ridge extends out to the final peak, Gars-bheinn, and its elevated position above the sea provides breathtaking panoramic views. The journey along this ridge is not only a test of your mountaineering skills but also a feast for the eyes, with the dramatic landscape unfolding beneath you.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-nan-eag-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.20300,-6.29140/"
  },
  {
    "id": "254",
    "name": "Sgurr nan Gillean",
    "extra": "",
    "area": "Islands",
    "meters": 966,
    "section": "17B",
    "region": "17B: Minginish and the Cuillin Hills",
    "feet": 3170,
    "summited": false,
    "lat": 57.248215,
    "lng": -6.193159,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-nan-gillean",
    "description": "Sgùrr nan Gillean is often celebrated as the most striking peak within the Skye Cuillin range. This majestic, pyramid-shaped mountain boasts three prominent ridges. The most accessible of these ridges is still a challenge, suitable only for enthusiastic and experienced scramblers. The remaining two ridges present even greater challenges, as they are classified as graded rock climbs, demanding advanced climbing skills and equipment. The breathtaking views and exhilarating ascent make Sgùrr nan Gillean a must-visit for dedicated mountaineers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-nan-gillean2.jpg",
    "startingPointURL": "https://www.google.com/maps/search/57.28940,-6.17600/"
  },
  {
    "id": "255",
    "name": "Sgurr Thuilm",
    "extra": "",
    "area": "Fort William",
    "meters": 963,
    "section": "10D",
    "region": "10D: Mallaig to Fort William",
    "feet": 3159,
    "summited": false,
    "lat": 56.937056,
    "lng": -5.389207,
    "link": "https://www.walkhighlands.co.uk/munros/sgurr-thuilm",
    "description": "Sgùrr Thuilm stands as one of the two majestic Munros in the Glenfinnan area. This impressive rocky summit exudes a unique charm and character, offering breathtaking panoramic views. From its heights, you can marvel at the stunning vistas of lochs and the dramatic, steep mountains that stretch out in every direction. The experience of reaching the peak is as rewarding as the scenery itself, making it a must-visit for any Munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sgurr-thuilm-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.87110,-5.43640/"
  },
  {
    "id": "256",
    "name": "Slioch",
    "extra": "",
    "area": "Torridon",
    "meters": 981,
    "section": "14A",
    "region": "14A: Loch Maree to Loch Broom",
    "feet": 3219,
    "summited": false,
    "lat": 57.667148,
    "lng": -5.347061,
    "link": "https://www.walkhighlands.co.uk/munros/slioch",
    "description": "Slioch stands as one of the most iconic peaks in the Scottish Highlands, its majestic silhouette often captured in photographs that grace numerous calendars and travel brochures. The mountain's striking presence, as seen from across the serene waters of Loch Maree, leaves a lasting impression on all who behold it. Beyond its picturesque appearance, Slioch offers an exceptional vantage point, providing sweeping views over the rugged expanse of the Fisherfield Forest to the north. This combination of visual appeal and panoramic vistas makes Slioch a must-visit destination for any avid munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/slioch-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.60850,-5.28660/"
  },
  {
    "id": "257",
    "name": "Spidean Mialach",
    "extra": "",
    "area": "Fort William",
    "meters": 996,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3268,
    "summited": false,
    "lat": 57.088964,
    "lng": -5.193614,
    "link": "https://www.walkhighlands.co.uk/munros/spidean-mialach",
    "description": "Spidean Mialach, along with its companion Munro, Gleouraich, graces the northern shores of Loch Quoich. These two peaks offer a splendid hiking experience, featuring well-maintained stalkers' paths that wind through their lower elevations. The journey up Spidean Mialach is particularly rewarding, providing hikers with breathtaking views and a sense of tranquility amidst the rugged landscape. Whether you're an experienced climber or a casual walker, the paths leading up these Munros promise an enjoyable and memorable adventure.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/spidean-mialach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.07570,-5.25320/"
  },
  {
    "id": "258",
    "name": "Sron a' Choire Ghairbh",
    "extra": "",
    "area": "Fort William",
    "meters": 936,
    "section": "10C",
    "region": "10C: Loch Arkaig to Glen Moriston",
    "feet": 3072,
    "summited": false,
    "lat": 57.00784,
    "lng": -4.928747,
    "link": "https://www.walkhighlands.co.uk/munros/sron-a-choire-ghairbh",
    "description": "Sròn a' Choire Ghairbh stands as the loftier of the two Munros gracing the northern shores of Loch Lochy. When viewed from the A82 on the southern side of the loch, it rises majestically above the dense forestry. The mountain's rounded summit is characterized by its steep slopes and deep corries. Notably, the largest of these corries, which presently shelters the small Loch a' Choire Ghlais, is earmarked for an extensive hydro-scheme project. This development promises to bring significant changes to the landscape, adding a layer of intrigue to this already captivating peak.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/sron-a-choire-ghairbh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.02130,-4.83917/"
  },
  {
    "id": "259",
    "name": "Stob a' Choire Mheadhoin",
    "extra": "",
    "area": "Fort William",
    "meters": 1105,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3625,
    "summited": false,
    "lat": 56.823684,
    "lng": -4.760199,
    "link": "https://www.walkhighlands.co.uk/munros/stob-a-choire-mheadhoin",
    "description": "Stob a' Choire Mheadhoin, often considered a twin to the adjacent Stob Coire Easain, forms part of an extensive north-south ridge. When viewed from the vicinity of Moy, it presents itself as an impressive pyramid. Its central location and considerable height offer hikers a splendid vantage point, making it a noteworthy destination for those seeking panoramic views of the surrounding landscape.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-a-choire-mheadhoin-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.86540,-4.70840/"
  },
  {
    "id": "260",
    "name": "Stob a' Choire Odhair",
    "extra": "",
    "area": "Argyll",
    "meters": 945,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3100,
    "summited": false,
    "lat": 56.573308,
    "lng": -4.838302,
    "link": "https://www.walkhighlands.co.uk/munros/stob-a-choire-odhair",
    "description": "Stob a' Choire Odhair might not be a household name, but its distinctive dome-shaped silhouette is a familiar landmark, often captured in photographs of the scenic Rannoch Moor. This mountain offers an excellent vantage point, providing sweeping views over the expansive and untamed wilderness of the moor. Its relatively modest height belies the grandeur of the panoramas it affords, making it a rewarding climb for those who venture up its slopes. Whether you're an avid photographer or simply a lover of breathtaking landscapes, Stob a' Choire Odhair promises a memorable experience amidst the rugged beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-a-choire-odhair-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.53720,-4.81407/"
  },
  {
    "id": "261",
    "name": "Stob Ban",
    "extra": "Mamores",
    "area": "Fort William",
    "meters": 1000,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3280,
    "summited": false,
    "lat": 56.743706,
    "lng": -5.030328,
    "link": "https://www.walkhighlands.co.uk/munros/stob-ban-mamores",
    "description": "Stob Bàn stands out as a remarkably steep and sharply defined Munro, often regarded as one of the most striking summits within the Mamores range. Its distinctive profile is easily recognizable from numerous vantage points throughout the lower reaches of Glen Nevis, making it a favorite among hillwalkers and climbers. The peak's dramatic slopes and rugged terrain offer a challenging yet rewarding ascent, providing breathtaking views and a true sense of accomplishment for those who reach its summit.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-ban-mamores-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.76950,-5.03720/"
  },
  {
    "id": "262",
    "name": "Stob Ban",
    "extra": "Grey Corries",
    "area": "Fort William",
    "meters": 977,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3205,
    "summited": false,
    "lat": 56.810656,
    "lng": -4.840877,
    "link": "https://www.walkhighlands.co.uk/munros/stob-ban-grey-corries",
    "description": "Stob Bàn is a striking, cone-shaped peak that often goes unnoticed due to its position behind the towering Grey Corries range. Despite its somewhat concealed location, this mountain offers a unique and rewarding climb for those who seek it out. Its distinct shape and the scenic views it provides make it a memorable addition to any munro bagger's list.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-ban-grey-corries-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.86830,-4.86370/"
  },
  {
    "id": "263",
    "name": "Stob Binnein",
    "extra": "",
    "area": "Loch Lomond",
    "meters": 1165,
    "section": "01C",
    "region": "01C: Loch Lomond to Strathyre",
    "feet": 3822,
    "summited": false,
    "lat": 56.370717,
    "lng": -4.535753,
    "link": "https://www.walkhighlands.co.uk/munros/stob-binnein",
    "description": "Stob Binnein, often overshadowed by its slightly taller twin, Ben More, is a remarkable summit in its own right. While it is commonly climbed in conjunction with Ben More from the north, Stob Binnein can also be approached independently from the south. This route offers a unique perspective and allows hikers to fully appreciate the mountain's distinct beauty. Despite being less frequently singled out, many consider Stob Binnein to be the more picturesque of the two peaks, with its elegant slopes and stunning vistas. Whether tackled alone or as part of a duo, Stob Binnein promises a rewarding and memorable experience for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-binnein-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.40280,-4.56120/"
  },
  {
    "id": "264",
    "name": "Stob Choire Claurigh",
    "extra": "",
    "area": "Fort William",
    "meters": 1177,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3862,
    "summited": false,
    "lat": 56.823786,
    "lng": -4.849624,
    "link": "https://www.walkhighlands.co.uk/munros/stob-choire-claurigh",
    "description": "Standing as the tallest summit in the Grey Corries, this impressive peak often presents a scree-covered appearance when viewed from afar. The range itself offers a quintessential ridge walk, typically encompassing the adjacent Stob Coire an Laoigh. This journey along the ridge is a favorite among hikers, providing both a challenging and rewarding experience with breathtaking vistas and a sense of accomplishment.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-choire-claurigh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.87270,-4.86820/"
  },
  {
    "id": "265",
    "name": "Stob Coir an Albannaich",
    "extra": "",
    "area": "Fort William",
    "meters": 1045,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3428,
    "summited": false,
    "lat": 56.554903,
    "lng": -4.979809,
    "link": "https://www.walkhighlands.co.uk/munros/stob-coir-an-albannaich",
    "description": "Stob Coir' an Albannaich is a striking peak nestled within the impressive range of mountains on the southern side of Glen Etive. This mountain boasts a remarkable summit that perches dramatically on the brink of a steep crag, offering breathtaking views and a sense of exhilaration. The ascent and traverse of Stob Coir' an Albannaich provide a thoroughly enjoyable and rewarding experience for any munro bagger, with its rugged terrain and stunning scenery making it a memorable highlight of the region.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-coir-an-albannaich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.57620,-5.03566/"
  },
  {
    "id": "266",
    "name": "Stob Coire a' Chairn",
    "extra": "",
    "area": "Fort William",
    "meters": 981,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3219,
    "summited": false,
    "lat": 56.750756,
    "lng": -4.968985,
    "link": "https://www.walkhighlands.co.uk/munros/stob-coire-a-chairn",
    "description": "Stob Coire a' Chàirn boasts a prime location where the lofty An Gearanach ridge converges with the central backbone of the Mamores range. This region is renowned for offering some of the most exhilarating ridgewalking experiences in all of Scotland, with breathtaking views and challenging paths that attract avid hikers and mountaineers alike.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-coire-a-chairn-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.77770,-5.00034/"
  },
  {
    "id": "267",
    "name": "Stob Coire an Laoigh",
    "extra": "",
    "area": "Fort William",
    "meters": 1116,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3661,
    "summited": false,
    "lat": 56.810877,
    "lng": -4.884907,
    "link": "https://www.walkhighlands.co.uk/munros/stob-coire-an-laoigh",
    "description": "Stob Coire an Laoigh stands as the second prominent peak among the Grey Corries, offering an exhilarating experience along a stunning ridgewalk. Reaching this majestic summit involves lengthy approaches, and the traverse of the Grey Corries demands both respect and preparation. The journey, though challenging, rewards hikers with breathtaking views and a profound sense of accomplishment.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-coire-an-laoigh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.87270,-4.86820/"
  },
  {
    "id": "268",
    "name": "Stob Coire Easain",
    "extra": "",
    "area": "Fort William",
    "meters": 1115,
    "section": "04A",
    "region": "04A: Fort William to Loch Treig & Loch Leven",
    "feet": 3658,
    "summited": false,
    "lat": 56.818199,
    "lng": -4.77371,
    "link": "https://www.walkhighlands.co.uk/munros/stob-coire-easain",
    "description": "Stob Coire Easain, often considered a twin to its nearby counterpart Stob a' Choire Mheadhoin, presents a dramatic and steep face to the northeast. This extensive ridge is nestled between the profound trench of Loch Treig, which is famously crossed by the West Highland railway line, and the historic Lairig Leacach pass. The rugged terrain and striking landscapes make it a notable feature in the region, offering a challenging yet rewarding experience for avid munro baggers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-coire-easain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.86540,-4.70840/"
  },
  {
    "id": "269",
    "name": "Stob Coire Sgreamhach",
    "extra": "",
    "area": "Fort William",
    "meters": 1072,
    "section": "03B",
    "region": "03B: Loch Linnhe to Loch Etive",
    "feet": 3517,
    "summited": false,
    "lat": 56.638314,
    "lng": -5.010284,
    "link": "https://www.walkhighlands.co.uk/munros/stob-coire-sgreamhach",
    "description": "Stob Coire Sgreamhach, officially recognized as a Munro in 1997, is intrinsically linked to the Bidean nam Bian massif. This impressive peak is strategically located at the junction where the Beinn Fhada ridge converges with the primary ridge that spans the rear of Bidean. The terrain of Beinn Fhada is notably challenging, especially when descending, making it a test of skill and endurance. Most climbers opt for the route through the Lost Valley, which entails a demanding and steep ascent up eroded scree slopes. This path, while arduous, offers a rewarding experience for those who tackle its rugged landscape.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-coire-sgreamhach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.66770,-4.98650/"
  },
  {
    "id": "270",
    "name": "Stob Coire Sgriodain",
    "extra": "",
    "area": "Fort William",
    "meters": 979,
    "section": "04B",
    "region": "04B: Loch Treig to Loch Ericht",
    "feet": 3212,
    "summited": false,
    "lat": 56.831744,
    "lng": -4.694934,
    "link": "https://www.walkhighlands.co.uk/munros/stob-coire-sgriodain",
    "description": "Stob Coire Sgriodain is a striking, steep-sided ridge that towers majestically above the glacially-carved valley of Loch Treig. This impressive peak is often ascended in tandem with its nearby counterpart, Chno Dearg, offering a rewarding challenge for avid munro baggers. The rugged terrain and breathtaking views make the journey to the summit an unforgettable experience, showcasing the raw beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-coire-sgriodain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.86550,-4.70850/"
  },
  {
    "id": "271",
    "name": "Stob Daimh",
    "extra": "",
    "area": "Argyll",
    "meters": 999,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3278,
    "summited": false,
    "lat": 56.431336,
    "lng": -5.091319,
    "link": "https://www.walkhighlands.co.uk/munros/stob-diamh",
    "description": "Stob Daimh, occasionally misspelled as Diamh on certain Ordnance Survey maps, is a splendid peak that often finds itself overshadowed by its more famous neighbor, Ben Cruachan. Typically, hikers choose to ascend Stob Daimh as part of an exhilarating circuit around Coire Cruachan, which offers breathtaking views and a rewarding challenge. Another favored route among enthusiasts is the Dalmally Horseshoe, which provides an alternative circuit encompassing the mountain's eastern ridges. This route not only showcases the rugged beauty of the area but also offers a different perspective on the majestic landscape that surrounds these peaks. Whether you opt for the Coire Cruachan circuit or the Dalmally Horseshoe, Stob Daimh promises an unforgettable experience for any munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-diamh-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.39370,-5.11198/"
  },
  {
    "id": "272",
    "name": "Stob Ghabhar",
    "extra": "",
    "area": "Argyll",
    "meters": 1089,
    "section": "03C",
    "region": "03C: Glen Etive to Glen Lochy",
    "feet": 3573,
    "summited": false,
    "lat": 56.568103,
    "lng": -4.882099,
    "link": "https://www.walkhighlands.co.uk/munros/stob-ghabhar",
    "description": "Stob Ghabhar stands as the crowning jewel of the Black Mount range, characterized by its slender, rocky ridges, precipitous cliffs, and profound corries. This majestic peak is a well-known landmark, often admired from the lochans scattered across Rannoch Moor, especially when viewed from the A82 road. Its dramatic landscape and striking features make it a favorite among hillwalkers and mountaineers, offering both a challenging ascent and breathtaking vistas.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-ghabhar-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.53720,-4.81407/"
  },
  {
    "id": "273",
    "name": "Stob Poite Coire Ardair",
    "extra": "",
    "area": "Fort William",
    "meters": 1054,
    "section": "09C",
    "region": "09C: Loch Lochy to Loch Laggan",
    "feet": 3458,
    "summited": false,
    "lat": 56.964037,
    "lng": -4.585762,
    "link": "https://www.walkhighlands.co.uk/munros/stob-poite-coire-ardair",
    "description": "Stob Poite Coire Àrdair is a striking ridge situated directly across from Creag Meagaidh, separated by the dramatic feature known as the Window. This ridge provides hikers with breathtaking vistas of the awe-inspiring cliffs that define Coire Àrdair. The southern slopes of Stob Poite Coire Àrdair are characterized by steep, rugged crags, adding to the challenging and rewarding nature of the ascent. The panoramic views from the ridge make it a must-visit for any munro bagger seeking to experience the raw beauty of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stob-poite-coire-ardair-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.95210,-4.49592/"
  },
  {
    "id": "274",
    "name": "Stuc a' Chroin",
    "extra": "",
    "area": "Perthshire",
    "meters": 973,
    "section": "01B",
    "region": "01B: Strathyre to Strathallan",
    "feet": 3192,
    "summited": false,
    "lat": 56.329315,
    "lng": -4.237533,
    "link": "https://www.walkhighlands.co.uk/munros/stuc-a-chroin",
    "description": "Stùc a' Chròin is a rugged and imposing peak, characterized by its steep and rocky terrain. The ascent typically involves a challenging scramble, especially when approached from the adjacent Ben Vorlich. This route is popular among climbers seeking a more adventurous and exhilarating experience. The effort is well rewarded with stunning panoramic views and a true sense of accomplishment upon reaching the summit.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stuc-a-chroin-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.38130,-4.21580/"
  },
  {
    "id": "275",
    "name": "Stucd an Lochain",
    "extra": "",
    "area": "Perthshire",
    "meters": 960,
    "section": "02A",
    "region": "02A: Loch Rannoch to Glen Lyon",
    "feet": 3150,
    "summited": false,
    "lat": 56.570907,
    "lng": -4.470602,
    "link": "https://www.walkhighlands.co.uk/munros/stuchd-an-lochain",
    "description": "Stùc an Lochain is a delightful peak that offers a rewarding climb, featuring a striking northern corrie that cradles the nearly circular Lochan nan Cat. The most common ascent is a brief yet satisfying route starting from Loch an Dàimh to the north. However, for those seeking a more extended adventure, an alternative approach can be taken from Pubil in the upper reaches of Glen Lyon. This mountain provides a memorable experience with its scenic beauty and varied routes.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/stuchd-an-lochain-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.58560,-4.42609/"
  },
  {
    "id": "276",
    "name": "The Cairnwell",
    "extra": "",
    "area": "Cairngorms",
    "meters": 933,
    "section": "06B",
    "region": "06B: Pitlochry to Braemar & Blairgowrie",
    "feet": 3061,
    "summited": false,
    "lat": 56.87952,
    "lng": -3.421199,
    "link": "https://www.walkhighlands.co.uk/munros/the-cairnwell",
    "description": "The Cairnwell stands out as a striking, cone-shaped peak, especially noticeable when approaching from the south along the Cairnwell Pass. This mountain offers fantastic panoramic views, making it a popular spot for hikers and nature enthusiasts. However, the summit's natural beauty has been somewhat marred by the presence of various communications masts. Additionally, its slopes are dotted with equipment and infrastructure related to skiing, which detracts from the otherwise pristine landscape. Despite these intrusions, The Cairnwell remains a worthwhile destination for those seeking both adventure and scenic vistas.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/the-cairnwell-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.88680,-3.41490/"
  },
  {
    "id": "277",
    "name": "The Devil's Point",
    "extra": "",
    "area": "Cairngorms",
    "meters": 1007,
    "section": "08A",
    "region": "08A: Cairngorms",
    "feet": 3303,
    "summited": false,
    "lat": 57.03571,
    "lng": -3.688803,
    "link": "https://www.walkhighlands.co.uk/munros/the-devils-point",
    "description": "The Devil's Point, known in its original Gaelic as Bod an Deamhain (which translates to \"Penis of the Demon\"), stands as a stark, rocky pyramid that vigilantly oversees the southern entrance to the Lairig Ghru. This imposing peak, with its rugged and bare slopes, serves as a formidable sentinel. When approached from other directions, its role as the southernmost extension of the Cairn Toul massif becomes more evident, revealing its true geological character and significance within the landscape. The Devil's Point is not just a striking feature in the terrain but also a key landmark for those venturing into this wild and remote part of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/the-devils-point-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.14620,-3.67930/"
  },
  {
    "id": "278",
    "name": "The Saddle",
    "extra": "",
    "area": "Kintail",
    "meters": 1012,
    "section": "10A",
    "region": "10A: Glen Shiel to Loch Hourn and Loch Quoich",
    "feet": 3319,
    "summited": false,
    "lat": 57.162395,
    "lng": -5.414721,
    "link": "https://www.walkhighlands.co.uk/munros/the-saddle",
    "description": "The Saddle, known as An Diollaid in Gaelic, stands as the most distinguished peak in the Kintail region. This majestic mountain boasts a collection of impressive ridges that radiate from its splendid summit. Among these, the renowned Forcan Ridge is particularly noteworthy, offering one of the most exhilarating and airy scrambles in the Scottish Highlands. The combination of breathtaking views and challenging terrain makes The Saddle a must-visit for any avid munro bagger.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/the-saddle-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.17620,-5.36459/"
  },
  {
    "id": "279",
    "name": "Toll Creagach",
    "extra": "",
    "area": "Loch Ness",
    "meters": 1054,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3457,
    "summited": false,
    "lat": 57.309228,
    "lng": -4.999937,
    "link": "https://www.walkhighlands.co.uk/munros/toll-creagach",
    "description": "Toll Creagach is a modest, dome-shaped peak nestled between the scenic Glen Affric and the serene Loch Mullardoch. Its gentle slopes are adorned with shallow corries, offering a tranquil yet rewarding experience for those who venture to its summit. The surrounding landscape provides a picturesque backdrop, making the journey to Toll Creagach a delightful escape into the heart of the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/toll-creagach-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.27440,-4.95870/"
  },
  {
    "id": "280",
    "name": "Tolmount",
    "extra": "",
    "area": "Cairngorms",
    "meters": 958,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3142,
    "summited": false,
    "lat": 56.904724,
    "lng": -3.297946,
    "link": "https://www.walkhighlands.co.uk/munros/tolmount",
    "description": "Tolmount presents a striking, cone-shaped silhouette when viewed from the serene shores of Loch Callater. In contrast, from other perspectives, it appears as a twin to its nearby companion, Tom Buidhe. Both peaks are characterized by their gently rounded, dome-like forms, rising modestly from the expansive and rugged Mounth plateau. This area offers a unique blend of scenic beauty and tranquil isolation, making it a rewarding destination for dedicated munro baggers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/tolmount-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.97740,-3.39000/"
  },
  {
    "id": "281",
    "name": "Tom a' Choinich",
    "extra": "",
    "area": "Loch Ness",
    "meters": 1113,
    "section": "11A",
    "region": "11A: Loch Duich to Cannich",
    "feet": 3651,
    "summited": false,
    "lat": 57.299545,
    "lng": -5.048945,
    "link": "https://www.walkhighlands.co.uk/munros/tom-a-choinich",
    "description": "Tom a' Chòinich serves as an eastern extension of the majestic Càrn Eige range, forming an 'e'-shaped convergence of three distinct ridges that rise prominently above the scenic Glen Affric. This peak stands out as a more striking and impressive summit compared to its somewhat unremarkable neighbor, Toll Creagach. The rugged terrain and panoramic views from Tom a' Chòinich make it a rewarding climb for any munro bagger seeking both challenge and beauty in the Scottish Highlands.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/tom-a-choinich-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/57.27440,-4.95870/"
  },
  {
    "id": "282",
    "name": "Tom Buidhe",
    "extra": "",
    "area": "Cairngorms",
    "meters": 958,
    "section": "07A",
    "region": "07A: Braemar to Montrose",
    "feet": 3142,
    "summited": false,
    "lat": 56.893624,
    "lng": -3.292357,
    "link": "https://www.walkhighlands.co.uk/munros/tom-buidhe",
    "description": "Tom Buidhe is characterized by its unremarkable, dome-shaped rise on the expansive Mounth plateau, presenting an appearance that scarcely resembles a traditional mountain from any vantage point. This Munro is frequently tackled in conjunction with its nearby counterpart, Tolmount. There are several routes to reach its summit, including ascents from Glen Callater, Glen Doll, or the Cairnwell Pass. Each approach offers its own unique perspective and challenges, making the journey to Tom Buidhe a versatile and rewarding experience for avid hillwalkers.",
    "pictureURL": "https://d3teiib5p3f439.cloudfront.net/munros/tom-buidhe-1.JPG",
    "startingPointURL": "https://www.google.com/maps/search/56.97740,-3.39000/"
  }
]
